[
  {
    "Name": "Tyreek Hill",
    "Team": "MIA",
    "Bye Week": "6",
    "Rank": "1",
    "Points": "358.4",
    "Risk": "1.3",
    "Upside": "9.3",
    "ADP": "1.04",
    "Outlook": "171 targets with this guy’s speed and ability…my goodness. Hill was unreal last season, posting 3.82 yards per route run en route to the WR2 overall finish. For context anything north of 2.0 yards per route run is considered great. You could argue the efficiency will come down a bit after that outlier season, but we still expect Hill to dominate once again as the central figure in Mike McDaniel’s high-flying offense. He’s an easy top-five pick in fantasy drafts once again this year.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "CeeDee Lamb",
    "Team": "DAL",
    "Bye Week": "7",
    "Rank": "2",
    "Points": "357.3",
    "Risk": "3.0",
    "Upside": "9.7",
    "ADP": "1.03",
    "Outlook": "Alpha. That’s what Lamb was in 2023 when he was the engine of the Dallas offense. Among all WRs, Lamb ranked #1 in both targets and catches while finishing the year as the WR2 in fantasy points per game. He is as good of a bet as anyone to lead the league in receiving in 2024 and a no-brainer top-five fantasy pick given the lack of target competition and mind-meld connection with Dak.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Christian McCaffrey",
    "Team": "SF",
    "Bye Week": "9",
    "Rank": "3",
    "Points": "355.0",
    "Risk": "1.7",
    "Upside": "9.7",
    "ADP": "1.01",
    "Outlook": "This man is not from this planet. CMC set career-highs in rushing yards, yards per carry, and total TDs at the age of 27 and there is little reason to believe he is finished. He belongs in the Fantasy Hall of Fame after tying Priest Holmes and LaDainian Tomlinson as the only RBs with three seasons averaging 24+ PPR points per game. McCaffrey is under contract for two more years and with the NFL's best work ethic, he should be able to churn out another top-5 season in 2024 barring an injury. Oh, you should take him at 1.01. Do it.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Amon-Ra St. Brown",
    "Team": "DET",
    "Bye Week": "5",
    "Rank": "4",
    "Points": "329.3",
    "Risk": "1.0",
    "Upside": "9.3",
    "ADP": "1.06",
    "Outlook": "All St. Brown has done since he entered the NFL is produce at an extremely high level. Coming off a year in which he banked the WR3 overall finish on the back of 164 targets and a career high 1,500 yards, the Sun God is here to stay as the top weapon in Detroit’s potent offensive attack. His skill set fits perfectly with today’s game, and Jared Goff looks for him over the middle of the field as the first read in the offense. We are on board with St. Brown as an obvious Round 1 fantasy pick, especially in any PPR type of format.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Ja'Marr Chase",
    "Team": "CIN",
    "Bye Week": "12",
    "Rank": "5",
    "Points": "306.4",
    "Risk": "3.0",
    "Upside": "9.7",
    "ADP": "1.06",
    "Outlook": "A top-three talent at the WR position in the NFL, Chase is well worth an early first-round investment in fantasy drafts and one of the few players who could finish as the WR1 come season end. Burrow is back, and we expect the team to be one of the most pass-heavy offenses in the league. After setting a career-high in receptions last year with 100 catches, Chase not only has the floor we look for in fantasy, but the ceiling to be a legit difference maker for your squad.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Justin Jefferson",
    "Team": "MIN",
    "Bye Week": "6",
    "Rank": "6",
    "Points": "303.4",
    "Risk": "3.0",
    "Upside": "9.7",
    "ADP": "1.04",
    "Outlook": "Jefferson was in the conversation for the 1.01 last year, but sadly, he didn’t live up to those lofty expectations due to a serious hamstring injury that cost him eight weeks. For reference of how elite this guy can be, he averaged 11.4 targets per game in the eight games where he started and finished the game. Sure, Kirk Cousins is now in Atlanta, and J.J. McCarthy is an unproven rookie QB, but this guy is one of, if not the, most talented WR in the league. We fully expect head coach Kevin O’Connell to once again absolutely pepper this guy with targets and whenever that happens with a talent like JJetts, good things usually happen.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "A.J. Brown",
    "Team": "PHI",
    "Bye Week": "5",
    "Rank": "7",
    "Points": "301.0",
    "Risk": "2.8",
    "Upside": "9.2",
    "ADP": "1.10",
    "Outlook": "Remember that start to the year? My goodness, A.J. Brown was looking like a league winner, a candidate to finish as the overall WR1 in fantasy, and a legit Offensive Player of the Year candidate. Unfortunately, as the Eagles’ offense looked inept over the final six weeks, Brown’s fantasy performance took a massive hit and fizzled out down the stretch. We know the talent is there, he’s still in his prime, and under new OC Kellen Moore, the Eagles should be up-tempo and throw at an elevated rate. If we get anything close to what we saw in the first half of the season, Brown is well worth his ADP.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Bijan Robinson",
    "Team": "ATL",
    "Bye Week": "12",
    "Rank": "8",
    "Points": "291.2",
    "Risk": "2.7",
    "Upside": "9.7",
    "ADP": "1.08",
    "Outlook": "It wasn’t exactly all peaches in Bijan’s first year in the Peach State but he still finished as the RB9 for fantasy becoming the eighth rookie RB over the last decade with 270+ touches. He was prolific in the passing game with the second-most routes run and fourth-most receiving yards among all RBs. With Arthur Smith now in Pittsburgh, expect a more balanced offensive approach with tons of 11-personnel looks. In sets with three or more WRs on the field, Bijan averaged 5.8 yards per carry as a rookie. He’s a locked-in 1st round pick and a true foundational piece for a fantasy roster.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Breece Hall",
    "Team": "NYJ",
    "Bye Week": "12",
    "Rank": "9",
    "Points": "287.0",
    "Risk": "3.0",
    "Upside": "9.3",
    "ADP": "1.09",
    "Outlook": "Breece Hall stiff-armed all of the offensive line woes and the lack of an actual NFL QB under center to finish as a top-5 fantasy RB in his sophomore year. He is essentially this team's WR2 as his 95 targets led the RB position and 48% of his fantasy points came via the air, the highest rate of any top-5 RB over the last five years. Expect some of those checkdowns to regress with the return of Aaron Rodgers but the red zone opportunities could also finally be in his favor. The J-E-T-S ranked L-A-S-T in plays inside the five yard line in 2023. Hall is a 1st round stud and someone to anchor your fantasy team around.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Garrett Wilson",
    "Team": "NYJ",
    "Bye Week": "12",
    "Rank": "10",
    "Points": "278.8",
    "Risk": "5.0",
    "Upside": "8.8",
    "ADP": "1.11",
    "Outlook": "Wilson finishing last year with over 1,000 yards is honestly an impressive feat considering he was playing with QBs who will be crushing it in the UFL in a year or two. Please, Aaron Rodgers, stay healthy. If he does, we expect Wilson to push for top-10 numbers this year. Once again, count us in on the hype train with one of the NFL’s most talented receivers.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Puka Nacua",
    "Team": "LAR",
    "Bye Week": "6",
    "Rank": "11",
    "Points": "274.8",
    "Risk": "3.3",
    "Upside": "9.0",
    "ADP": "1.11",
    "Outlook": "Oh ya know, no big deal. Just the best fantasy season from a rookie WR of ALL TIME! Puka was sensational last season, especially considering he wasn’t even selected in the NFL Draft until day three and went undrafted in the majority of fantasy leagues. The secret is out now; Puka is the top option in the Rams passing game. He bested Kupp in targets per game, yards per route run, and first-read target share last season. Sure, Kupp will have his moments and have his games, but Puka looks like the alpha now. It’ll probably cost you a first-round pick, but after what we saw last year, he definitely deserves it.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Jahmyr Gibbs",
    "Team": "DET",
    "Bye Week": "5",
    "Rank": "12",
    "Points": "274.2",
    "Risk": "3.0",
    "Upside": "9.3",
    "ADP": "1.11",
    "Outlook": "Who is laughing now? The Lions drew the ire of tons of pundits after selecting Gibbs 12th overall in the 2023 NFL Draft. After being brought along slowly the first month of the season, Gibbs caught fire as the RB3 in fantasy from Week 7 on. He tied Clinton Portis for the third-highest fantasy points per touch rookie season ever and the versatility in the passing game was showcased every week. David Montgomery will still be a thorn in the side of Gibbs managers in the red zone but Gibbs’ trajectory as an impact fantasy RB is approaching the moon. We have him locked-in as a top-five RB and a building block piece near the 1-2 turn of redraft leagues.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Davante Adams",
    "Team": "LV",
    "Bye Week": "10",
    "Rank": "13",
    "Points": "271.6",
    "Risk": "6.3",
    "Upside": "7.5",
    "ADP": "2.06",
    "Outlook": "Adams has been incredible for the last decade, but it’s very fair to wonder if he's at least started to decline. After all, he turns 32 years old in December, and his peripheral efficiency metrics suggest he’s not the player he was even three years ago. His yards per route run, yards after the catch per reception and yards per target have all dropped in three straight years. Adams is still going to see a boatload of targets in this offense, but perhaps he doesn’t have the ceiling he once had.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Marvin Harrison Jr.",
    "Team": "ARI",
    "Bye Week": "11",
    "Rank": "14",
    "Points": "262.3",
    "Risk": "4.0",
    "Upside": "8.7",
    "ADP": "2.03",
    "Outlook": "Even as a rookie, we expect Marvin Harrison Jr. to be the alpha in this offense right away. Arizona simply doesn’t have someone capable of stealing meaningful targets away from the 4th overall pick. Sure, Trey McBride will get looks over the middle of the field, but Harrison can win at all three levels and in our eyes, a lock to finish as a top-20 fantasy option barring injury. He might be going as the highest drafted rookie WR in fantasy football history according to ADP but that isn’t stopping us from taking him there. Believe the hype.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Chris Olave",
    "Team": "NO",
    "Bye Week": "12",
    "Rank": "15",
    "Points": "260.0",
    "Risk": "3.7",
    "Upside": "8.2",
    "ADP": "2.07",
    "Outlook": "Olave quietly has some of the softest target competition in the league entering 2024, and we know the talent and pedigree are there for him to capitalize. Prayers up for the Saints offense as they finally transition from the stone age and incorporate more pre-snap motion with new OC Klint Kubiak. If he can take that Year 3 leap and truly become an alpha WR1 in the league, he’s a sneaky candidate to finish as a top-10 fantasy WR if things break right.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Kyren Williams",
    "Team": "LAR",
    "Bye Week": "6",
    "Rank": "16",
    "Points": "257.2",
    "Risk": "5.7",
    "Upside": "9.0",
    "ADP": "2.04",
    "Outlook": "Kyren was incredible for fantasy, and he completely capitalized on his opportunity, leading the NFL in rushing yards per game last season. He joined Priest Holmes as the only other RB to score 15+ total TDs in 12 or fewer games over the last 40 years. It was truly a miracle season if you had Kyren last year (or felt the pain of facing him). However, there are warning signs for regression in 2024 with an astounding 37% of his fantasy points coming via TDs and the selection of TD-machine Blake Corum in the third round certainly being a punch in the gut. Despite some off-season injuries, we still view Kyren as an RB1 heading into drafts.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Travis Etienne Jr.",
    "Team": "JAX",
    "Bye Week": "12",
    "Rank": "17",
    "Points": "253.8",
    "Risk": "4.0",
    "Upside": "8.7",
    "ADP": "2.11",
    "Outlook": "We speculated about Etienne’s workload before the season and the Jaguars gave him all he could handle. He saw the third-most opportunities (340) among RBs and led the league in forced missed tackles. Before the team’s bye, he had four straight top-5 finishes, averaging 123 total yards. Things fell off afterwards and if there was a reason for concern, he was asked to pass-block at an alarming rate and now this team restocked with other pass-catchers in Gabe Davis and Brian Thomas Jr. We still view Etienne as a top-10 RB with a chance to repeat in the top-5 if Trevor Lawrence and the offense improves in sustaining drives.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Jonathan Taylor",
    "Team": "IND",
    "Bye Week": "14",
    "Rank": "18",
    "Points": "253.7",
    "Risk": "5.0",
    "Upside": "9.0",
    "ADP": "2.01",
    "Outlook": "There aren't many RBs in the NFL more talented than Taylor when he's healthy. Last year, in games with 50+ % snaps, he averaged 21.4 opportunities per game. He was the RB6 in points per game from Week 6 on, showcasing that he should be viewed as a top tier fantasy RB. Anthony Richardson’s return certainly lowers some of his ceiling with the rushing around the goal-line. Regardless, JTT should see a monster workload on an up-tempo and up-and-coming offense. He is a strong RB1 in our book.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Jaylen Waddle",
    "Team": "MIA",
    "Bye Week": "6",
    "Rank": "19",
    "Points": "252.1",
    "Risk": "3.8",
    "Upside": "7.3",
    "ADP": "3.12",
    "Outlook": "It was the Tyreek Hill show in 2023 as Waddle took a bit of a back seat. For reference, Hill saw a 32.7% target share compared to Waddle’s 24% market share. We do expect Hill to once again be the top option, but Waddle’s cheaper this year than he was in drafts a year ago, yet we know the talent and upside is immense. There aren’t a lot of players going around him in drafts who can win you a matchup, and if Tyreek were to miss any time, Waddle would be a top-10 play every single week.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Mike Evans",
    "Team": "TB",
    "Bye Week": "11",
    "Rank": "20",
    "Points": "250.7",
    "Risk": "4.7",
    "Upside": "7.7",
    "ADP": "3.05",
    "Outlook": "Andy’s “My Guy” last year! Evans was a smash and a real difference-maker for fantasy as one of the best values in all of football last season. Now entering his age 31 season, Evans might not repeat what he did last year (over 1,200 yards and 13 TD). But, this target tree should be condensed to Evans and Godwin and we expect him to once again finish the year with over 1,000 yards, something he’s done in 10 straight years!",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Drake London",
    "Team": "ATL",
    "Bye Week": "12",
    "Rank": "21",
    "Points": "250.5",
    "Risk": "4.7",
    "Upside": "8.2",
    "ADP": "2.06",
    "Outlook": "All aboard! The hype train is officially out of control with London now that he has an actual QB under center, but we get it. The archaic Arthur Smith offense is gone, Desmond Ridder is holding a clipboard elsewhere and London is entering year three when we see some massive breakouts from elite young prospects. Under this new regime with Kirk Cousins, we should see a massive spike in pass rate for the Falcons, which means London is set to log career highs in targets, yards and TDs.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Deebo Samuel Sr.",
    "Team": "SF",
    "Bye Week": "9",
    "Rank": "22",
    "Points": "249.2",
    "Risk": "6.0",
    "Upside": "8.5",
    "ADP": "3.09",
    "Outlook": "Deebo missed Weeks 7-8 with a shoulder injury but after the Week 9 bye, he went on an absolute tear and helped fantasy managers make a push for the playoffs. From Weeks 10-17, Samuel was fantasy’s WR2 behind only CeeDee Lamb. For context, only four WRs averaged 18+ fantasy points per game in that sample - Lamb, Deebo, Keenan Allen, and Tyreek Hill. We know the skill guys will have their ups and downs week-to-week with so many mouths to feed, but there aren’t many offenses who can score 30+ real-life points every week. We’re comfortable living with the down weeks knowing Deebo can win you your week any time he steps on the field.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "DK Metcalf",
    "Team": "SEA",
    "Bye Week": "10",
    "Rank": "23",
    "Points": "248.4",
    "Risk": "3.8",
    "Upside": "7.5",
    "ADP": "4.08",
    "Outlook": "At this stage of their respective careers, Metcalf is the obvious target over Lockett. He’s in his prime at 26 years old and could really take a big step forward in earning a hefty target share with Lockett at the tail end of his career. Even after a 1,100-yard season with eight scores, Metcalf left a lot of meat on the bone so to speak last season with his lowest catch rate of his career. If he and Geno can connect on a few more deep targets, he has top-12 upside.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Nico Collins",
    "Team": "HOU",
    "Bye Week": "14",
    "Rank": "24",
    "Points": "247.4",
    "Risk": "5.0",
    "Upside": "7.7",
    "ADP": "3.05",
    "Outlook": "What a year three breakout it was for Nico Collins. How good? Only three WRs logged a yards per route run rate of 3+ during the regular season - Tyreek Hill, Brandon Aiyuk and Nico Collins. Yup, that’ll work! Collins exploded down the stretch after Tank Dell’s injury and he was a key cog in their playoff run. We expect him to have a great season, but it is fair to wonder if the target count comes down a little bit with Diggs in town and Tank Dell now healthy.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Michael Pittman Jr.",
    "Team": "IND",
    "Bye Week": "14",
    "Rank": "25",
    "Points": "246.0",
    "Risk": "3.7",
    "Upside": "7.3",
    "ADP": "4.02",
    "Outlook": "Pitty City…so back, baby! A PPR machine last season, Pittman averaged just under seven catches per game as the first-read in Shane Steichen’s RPO offense. We expect him to yet again be the alpha here and command a healthy target share. Playing in an offense with a great RB in Jonathan Taylor and one of the most electric runners at the position in Anthony Richardson, it might be tough for Pittman to find his way to 8+ TDs in a season. That could cap the upside a bit, but he’s a solid and consistent WR2 for your squad.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "DeVonta Smith",
    "Team": "PHI",
    "Bye Week": "5",
    "Rank": "26",
    "Points": "245.7",
    "Risk": "3.0",
    "Upside": "7.8",
    "ADP": "4.09",
    "Outlook": "Smith’s 2023 season felt like a bit of a disappointment relative to expectations following the WR10 finish in 2022. It certainly didn’t help that watching this Eagles offense in November and December made you want to vomit every Sunday. With a full offseason to take a step back and evaluate Smith, he probably was a bit overvalued in ADP last season. Now, his cost in drafts is down after failing to live up to the hype of 2023, making him a fantastic target as a rock-solid WR2 who could explode in the event of an A.J. Brown injury.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Brandon Aiyuk",
    "Team": "SF",
    "Bye Week": "9",
    "Rank": "27",
    "Points": "244.8",
    "Risk": "4.7",
    "Upside": "7.3",
    "ADP": "2.11",
    "Outlook": "Aiyuuuuuuken! Brandon Aiyuk was one of the best values in fantasy drafts last year, finishing the season as the WR14 on the back of a career high 1300 yards. How good was Aiyuk last year? His 3.01 yards per route run was one of the best YPRR seasons of all time. On top of that, he led all wideouts in fantasy points per target and over 80% of his catches went for a first down or a TD, which was the highest rate for any WR over the last five seasons. This offense is one of the most efficient in the league, but there are some warning signs here that Aiyuk could regress a little bit after a historic efficiency year.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Tank Dell",
    "Team": "HOU",
    "Bye Week": "14",
    "Rank": "28",
    "Points": "244.6",
    "Risk": "5.3",
    "Upside": "7.7",
    "ADP": "5.06",
    "Outlook": "Entering the league, Dell was a prospect who was knocked due to his slight frame. This dude proved everyone wrong and was fantastic as a rookie, running routes at all three levels of the field from both the perimeter and the slot. The yards per route run numbers (2.22) say Dell is a legit talent, and we love betting on middle-round WRs entering year two in the league. The hit rate on this cohort has been really strong over the years, so even though it doesn’t exactly feel clean given the target competition with Nico and Diggs, Dell is a really talented WR who could outperform his ADP if things break right. Call us crazy, but we want pieces of this Texans offense, and Tank could be the cheapest way to get your Houston exposure.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Alvin Kamara",
    "Team": "NO",
    "Bye Week": "12",
    "Rank": "29",
    "Points": "244.2",
    "Risk": "5.7",
    "Upside": "6.8",
    "ADP": "5.04",
    "Outlook": "After missing the first month of the season due to suspension, Kamara’s fantasy production followed a very simple formula: check it down Derek Carr! Kamara led all RBs in targets per game (6.6) and receptions per game (5.7) while being targeted on an insane 32% of his routes. He was this team’s 1B wide receiver alongside Chris Olave, and yet as a runner, it was rough. His yards per touch (4.5) was the lowest of his career highlighting some warning signs that the decline may be coming quite quickly. In full PPR leagues, his floor remains high knowing targets are so much more valuable than carries for fantasy football.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "DJ Moore",
    "Team": "CHI",
    "Bye Week": "7",
    "Rank": "30",
    "Points": "244.2",
    "Risk": "4.3",
    "Upside": "7.0",
    "ADP": "3.11",
    "Outlook": "Moore was sensational in his first season in Chicago, posting career highs in targets, yards, and receiving TDs en route to the WR6 finish, but things look a little different this season. Not only does his target competition go from Darnell Mooney and Equanimeous St. Brown to Keenan Allen and 9th overall pick, Rome Odunze, he’s also set to play with a rookie QB in Caleb Williams. While we like Williams and think he’s a good bet to succeed, there is a lot more volatility to Moore’s outlook in 2024 playing next to an unproven QB with more talented teammates. He slides into WR2 territory.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Saquon Barkley",
    "Team": "PHI",
    "Bye Week": "5",
    "Rank": "31",
    "Points": "242.1",
    "Risk": "5.0",
    "Upside": "8.3",
    "ADP": "2.03",
    "Outlook": "After losing Miles Sanders the previous year and D'Andre Swift to the Bears, the Eagles opened up their checkbook for hometown guy Saquon Barkley. He was the RB8 and RB5 against Philly last year so maybe those wounds loomed large. As a fluid pass-catcher and an athletic freak, he remains an elite option but you have to expect some of those goal-line looks to be pushed via Jalen Hurts' tush. The offensive line upgrade is night-and-day, giving Barkley a high floor on a great offense and top-10 RB status for 2023.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "George Pickens",
    "Team": "PIT",
    "Bye Week": "9",
    "Rank": "32",
    "Points": "241.2",
    "Risk": "5.0",
    "Upside": "7.7",
    "ADP": "5.06",
    "Outlook": "Pickens played four games last year without Diontae Johnson. In those contests, Pickens averaged a 28% target share with 3.0 yards per route run and just over 16 fantasy points per game. Sure, it’s an incredibly small sample size, but it just shows he can produce as the WR1 if the opportunity is there. Expect Pickens to be a boom-bust WR this year with the QB concerns and the low-volume passing offense. We like him more as your WR3 who can provide those boom weeks for your squad.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Travis Kelce",
    "Team": "KC",
    "Bye Week": "6",
    "Rank": "33",
    "Points": "240.0",
    "Risk": "3.7",
    "Upside": "9.3",
    "ADP": "3.01",
    "Outlook": "Kelce’s aDOT has dropped in seven straight years, and he’s coming off his lowest snap share since 2014, yet he still finished as the TE3 with 15 games played. At this stage of his career, KC has openly talked about managing his snap counts during the regular season to keep him fresh for the playoffs, so perhaps he doesn’t have the elite upside he once had to blow the TE position out of the water, but this is Travis Freakin’ Kelce. He’s got a mind-meld connection with Mahomes, and you know he’s getting plenty of looks inside the red zone. Assuming health, Kelce is once again a virtual lock for top-five numbers.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Isiah Pacheco",
    "Team": "KC",
    "Bye Week": "6",
    "Rank": "34",
    "Points": "239.4",
    "Risk": "4.2",
    "Upside": "7.3",
    "ADP": "3.07",
    "Outlook": "Pacheco (and his cartoonish running style) firmly solidified himself as one of the most valuable RBs in fantasy last season, going from a role player as a rookie in 2022 to a true workhorse in 2023. From Weeks 1-17, Pacheco was 11th among all RBs in total opportunities per game, and he was a key piece of their Super Bowl run as well. A fantasy value in 2023 drafts, there's no more guessing when it comes to the Chiefs backfield. The price is much higher this year but you can leave your drafts with a volume-based RB2 who can easily finish as a top-10 guy.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Rachaad White",
    "Team": "TB",
    "Bye Week": "11",
    "Rank": "35",
    "Points": "238.0",
    "Risk": "5.7",
    "Upside": "8.0",
    "ADP": "4.04",
    "Outlook": "After catching 50 passes as a rookie behind Leonard Fournette, Rachaad White followed up with an impressive sophomore campaign... from a fantasy standpoint. The opportunities (336) were glorious and from Week 7 on, he was the RB2 in total fantasy points. However, the efficiency numbers are somewhat concerning as his yards per carry (3.64) is the lowest for a top-15 RB over the last five years. He should be the locked-in starter for 2024 but there are some red flags that he might not be able to repeat that ceiling performance again. Treat him more as a high-end, volume-based RB2 moving forward. The added variable of a changing offensive coordinator to Liam Coan should also be taken into account.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Cooper Kupp",
    "Team": "LAR",
    "Bye Week": "6",
    "Rank": "36",
    "Points": "237.8",
    "Risk": "5.3",
    "Upside": "7.5",
    "ADP": "4.06",
    "Outlook": "Kupp’s 2023 season went off the rails thanks to a hamstring injury suffered during training camp. He missed Weeks 1-4 then had an up-and-down year for his standards. With Puka emerging as the top option, Kupp doesn’t have the same ceiling he once had entering his age 31 season, but look no further than his 8/115/1 and 8/111/1 stat lines in Weeks 14 and 15 as an example of the type of weekly upside he still has in this offense. For as bad of a season as it was for his standards, Kupp still averaged north of 2.0 yards per route run, proving he still has something left in the tank. He could be a value if the targets end up being more evenly distributed between Puka and Kupp.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Trey McBride",
    "Team": "ARI",
    "Bye Week": "11",
    "Rank": "37",
    "Points": "236.0",
    "Risk": "3.3",
    "Upside": "9.0",
    "ADP": "4.05",
    "Outlook": "It was a slow start to the year for McBride, who started the year behind Zach Ertz on the depth chart (yes, that actually happened). But oh baby, from Week 6 on, McBride was a stud muffin. In that sample, he was third among all TEs in targets, second in catches, and third in yards. How good was T McB? There were two starting TEs in the league last year who averaged 2+ yards per route run: Travis Kelce and Trey McBride. Marvin Harrison Jr. will be the top target earner in this offense, but there should be plenty of volume for T McB to eat with Kyler finally healthy.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Amari Cooper",
    "Team": "CLE",
    "Bye Week": "10",
    "Rank": "38",
    "Points": "235.9",
    "Risk": "4.3",
    "Upside": "7.8",
    "ADP": "5.10",
    "Outlook": "Is Amari Cooper a value in drafts? It feels like once again, no one is excited to draft Cooper despite the fact that he’s coming off a year in which he went for over 1,200 yards. All the dude has done over the last two years in Cleveland is finish as the WR9 and WR18. Expect him to slip a bit in drafts this year, and when he does, scoop him up as your WR3. We know he can still put up monstrous weeks - just ask the guy in your league who faced him in Week 16 last year.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "James Cook",
    "Team": "BUF",
    "Bye Week": "12",
    "Rank": "39",
    "Points": "235.5",
    "Risk": "3.7",
    "Upside": "7.3",
    "ADP": "4.10",
    "Outlook": "Cook was a fantasy enigma in 2023. Was he good? Or did he merely compile by not missing a game? His 1,567 yards from scrimmage were third-most in the NFL behind only CMC and Breece Hall, and he ranked #1 in yards before contact thanks to the Buffalo offensive line. However, he also became one of five RBs since 2000 to finish as an RB1 for fantasy with two or fewer rushing TDs. The shift in offensive coordinator approaches from Ken Dorsey to Joe Brady resulted in a massive spike in Cook’s opportunity as he went from 14.8 opportunities per game to 20.4 from Week 11 on. With a lack of goal-line opportunities (thanks Josh Allen!) and a heavy reliance on efficiency, Cook is best treated as an RB2 in redraft.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Mark Andrews",
    "Team": "BAL",
    "Bye Week": "14",
    "Rank": "40",
    "Points": "234.0",
    "Risk": "5.7",
    "Upside": "9.0",
    "ADP": "4.11",
    "Outlook": "Andrews missed the final five games of the 2023 season after suffering a fractured fibula on a nasty hip drop tackle against the Bengals in Week 11. But in nine games played from Weeks 1-10, Andrews was a legit difference maker for your squad. His 17-game pace in that sample? 81 catches, 985 yards and 11 TDs. There aren’t many TEs in the league who have that in their potential range of outcomes. If he stays healthy, he’s a threat to finish as the overall TE1 in fantasy.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Malik Nabers",
    "Team": "NYG",
    "Bye Week": "11",
    "Rank": "41",
    "Points": "232.8",
    "Risk": "6.3",
    "Upside": "7.5",
    "ADP": "4.02",
    "Outlook": "The Giants’ WR room is a mess behind Nabers, and Danny Dimes is coming off a torn ACL. It could certainly be a bit of a bumpy ride for him as a rookie with so many moving parts, but the target competition here is virtually non-existent and Nabers is an extremely talented prospect. He could really emerge down the stretch and give you big-time PPR stat lines if he’s as talented as the NFL Draft capital and production profile suggest.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Tee Higgins",
    "Team": "CIN",
    "Bye Week": "12",
    "Rank": "42",
    "Points": "231.8",
    "Risk": "6.0",
    "Upside": "7.5",
    "ADP": "5.09",
    "Outlook": "The Bengals offense was broken last year, so it may be difficult to remember how good Higgins was early in his career. After playing just 12 games last season while battling a hamstring injury, Tee was a complete bust in fantasy. Yes, Ja’Marr is the alpha here, but Tee was the WR17 and WR22 in 2021 and 2022 prior to this lost season. We’re still believers in his talent, and we know the Bengals want to chuck it all over the yard. Look for Higgins to put up WR2 numbers with the upside to post top-12 numbers should anything happen to Chase.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Sam LaPorta",
    "Team": "DET",
    "Bye Week": "5",
    "Rank": "43",
    "Points": "231.3",
    "Risk": "4.3",
    "Upside": "8.8",
    "ADP": "2.08",
    "Outlook": "LaPorta completely windmill dunked on the notion that rookie TEs don’t produce in year one, finishing as THE TE1. He set the rookie TE record for receptions and tied Gronk for the most receiving TDs by a rookie TE. OC Ben Johnson is back, Jared Goff just signed an extension, and this offense is one of the best in football. All that said, there are some signs that LaPorta could regress slightly in year two. LaPorta scored 10 TDs on 889 yards, but over the last decade, every TE with 10+ scores and less than 900 yards has regressed in the TD department. If LaPorta has somewhere in the 6-8 range for TDs, you’re probably looking at something closer to the TE5 finish. Obviously, we expect him to be great, but there is an opportunity cost associated with where he goes in ADP. It’s something to consider.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Derrick Henry",
    "Team": "BAL",
    "Bye Week": "14",
    "Rank": "44",
    "Points": "227.5",
    "Risk": "4.7",
    "Upside": "7.5",
    "ADP": "3.03",
    "Outlook": "Get out of the Big Dog’s way! After leading the NFL in yards after contact four of the last five years and carrying the Titans on his massive back, King Henry finds a new nest to call home in Baltimore. He has double-digit rushing TDs in six straight years and while father time is catching up to the 30 year old, we do have some precedent of players at this age still getting in the end zone. Since 2010, nine different RBs age 30+ scored 10 or more total TDs including Raheem Mostert’s absurd 21 last year. Henry’s splits have always followed closely to team wins and losses so Baltimore is a perfect blend for him at this stage in his career. We still see him as a back-end RB1 for fantasy regardless of the lack of receiving work.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Christian Kirk",
    "Team": "JAX",
    "Bye Week": "12",
    "Rank": "45",
    "Points": "227.5",
    "Risk": "3.0",
    "Upside": "6.5",
    "ADP": "6.03",
    "Outlook": "Prior to suffering a groin injury (ACK!) in Week 13, Kirk was the WR23 in fantasy. He sort of feels like the new Tyler Lockett - an undervalued veteran WR who’s a strong bet to beat his ADP most seasons. With Calvin Ridley out the door and Zay Jones now in Arizona, this offense vacates the league’s fifth-highest WR target share and the second-highest air yards share. In other words, if Gabe Davis does Gabe Davis things and disappears at times and Brian Thomas Jr. doesn’t hit in year one as a rookie, Kirk could see a ton of volume in this offense. Among the WRs currently on the squad, his 21.5% targets per route run rate is easily the highest on this team. He’s not a sexy pick, but he’s a high floor WR2/3 for your squad.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "De'Von Achane",
    "Team": "MIA",
    "Bye Week": "6",
    "Rank": "46",
    "Points": "225.5",
    "Risk": "6.2",
    "Upside": "9.5",
    "ADP": "2.11",
    "Outlook": "The efficiency numbers were off-the-charts and not repeatable. Right? He ranked second among all RBs in yards after contact per attempt and led all NFL RBs in yards per touch (7.7) while seemingly hitting a 40+ yard score every healthy week. He almost breaks our “upside meter” metric in our rankings but we’re split on how his season could shake out. Counting on him as your fantasy team’s dependable, consistent RB1 is exhilarating and yet the contract extension of Raheem Mostert plus the addition of speedster Jaylen Wright certainly adds more risk.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Joe Mixon",
    "Team": "HOU",
    "Bye Week": "14",
    "Rank": "47",
    "Points": "225.2",
    "Risk": "5.0",
    "Upside": "7.5",
    "ADP": "4.12",
    "Outlook": "Maybe you forgot but Joe Mixon finished the year as the… RB5! Yeah, we blanked out too, but it seems like the Texans took notice pivoting early in free agency to strike a deal with the Bengals for Mixon and extending him for three years. The soon-to-be 28 year old is a workhorse back and the only RB to finish top-12 each of the last three years. He should gobble up all the backfield opportunities (sorry Dameon Pierce) on a great Houston Texans offense. His age and C.J. Stroud’s lack of targeting the RB position are the main red flags keeping Mixon from churning out another top-12 season.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Evan Engram",
    "Team": "JAX",
    "Bye Week": "12",
    "Rank": "48",
    "Points": "224.0",
    "Risk": "2.7",
    "Upside": "6.3",
    "ADP": "6.07",
    "Outlook": "Engram almost set the all-time record for TE receptions in 2023, hauling in 114 balls on 143 targets. Keep in mind, Engram’s previous career high in targets was 115 as a rookie, so perhaps he won’t see almost 150 targets again. That said, Doug Pederson’s scheme usually features the TE, and now the Jags are losing Calvin Ridley and Zay Jones. Engram doesn’t profile as a dominant TD scorer, but he should see enough volume to support PPR-friendly box scores.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Dalton Kincaid",
    "Team": "BUF",
    "Bye Week": "12",
    "Rank": "49",
    "Points": "219.1",
    "Risk": "3.3",
    "Upside": "8.7",
    "ADP": "5.02",
    "Outlook": "If you don’t want to spend a premium pick on someone like LaPorta or Kelce, Kincaid is a very strong target in the middle rounds with just as much upside. Kincaid finished top-10 last season among all TEs in both catches and yards as a rookie and that was on an offense that still had Stefon Diggs. With Diggs vacating 160 targets in this offense, there is a ton of room for Kincaid’s role to grow in year two. It doesn’t hurt that he’s catching passes from some guy named Josh Allen.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Calvin Ridley",
    "Team": "TEN",
    "Bye Week": "5",
    "Rank": "50",
    "Points": "216.7",
    "Risk": "6.2",
    "Upside": "7.2",
    "ADP": "7.07",
    "Outlook": "Everyone in the NFL thought Ridley would be back in Jacksonville, but the Titans swooped in at the last minute and backed up the Brinks truck for him, giving him a 4-year deal worth $92 million. He’s obviously not the player he was back in his prime in Atlanta, but it’s clear the team still valued him as a true WR1. He’s 29 years old and coming off a solid 1,000-yard season with 8 TDs. Anything close to that with Will Levis would be a win for fantasy, but we don’t see a huge ceiling for a player like this given the QB situation and career arc trajectory.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "James Conner",
    "Team": "ARI",
    "Bye Week": "11",
    "Rank": "51",
    "Points": "215.6",
    "Risk": "6.7",
    "Upside": "6.5",
    "ADP": "6.03",
    "Outlook": "Coming off his first 1,000 rushing yard season of his career, Conner dispelled concerns that he was “too old” with an insane final five game stretch where he averaged 22.6 fantasy points and a whopping 23.8 opportunities per game. Like clockwork, he remains a value in drafts due to his perceived elder status, but this Arizona offense should be even more competitive in 2024. The lingering worries are rookie Trey Benson eventually cutting in and the fact Conner is guaranteed to miss a few games thanks to his playing style. Sometimes a solid, not sexy RB2 is what your fantasy team needs.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Keenan Allen",
    "Team": "CHI",
    "Bye Week": "7",
    "Rank": "52",
    "Points": "214.2",
    "Risk": "4.8",
    "Upside": "6.5",
    "ADP": "5.11",
    "Outlook": "Eat it, Father Time! Allen is 32 years old and entering Year 12 in the NFL. You wouldn’t know it after watching him in 2023 when he was an absolute target hog, earning over 11 targets per game in LA. Among WRs who saw 50+ targets last year, he was 11th in the NFL in yards per route and still playing at an extremely high level. We usually don’t love targeting veteran WRs changing teams this late in their career, especially playing with a rookie QB, but it is certainly possible Keenan is a value once again this season, especially in full PPR formats. Consider him a WR3/FLEX.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Stefon Diggs",
    "Team": "HOU",
    "Bye Week": "14",
    "Rank": "53",
    "Points": "214.1",
    "Risk": "6.7",
    "Upside": "7.7",
    "ADP": "3.06",
    "Outlook": "Will the real Stefon Diggs please stand up? From Weeks 1-7, he looked like the same player he’s been for years - a dominant WR1 for fantasy. The back half of the year? Irrelevant for fantasy football. It’s wild given the stark difference from the first half compared to the second, but it is a reminder that even the elite players fall off eventually. We don’t think Diggs is done, but he is entering his age 31 season and he is going from a situation in Buffalo where he was the no-question alpha to a situation in Houston where he’ll compete with two studs in Nico Collins and Tank Dell for targets. There are a wide range of outcomes here.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Raheem Mostert",
    "Team": "MIA",
    "Bye Week": "6",
    "Rank": "54",
    "Points": "213.6",
    "Risk": "6.5",
    "Upside": "8.2",
    "ADP": "7.12",
    "Outlook": "Raheem Mostert, who led the NFL in rushing TDs with 18, may have been the steal of the draft last year considering where he was taken. He was a big play waiting to happen and hilariously lowered his career average to 5.2 yards per carry thanks to his 20 carries inside the five-yard line. The 32-year-old’s career path doesn’t make logical sense but then again, have you ever played fantasy football? Mostert is one of the better values in the draft as his age, and the presence of De’Von Achane and rookie Jaylen Wright is driving down his draft cost. He might not repeat 21 total TDs but at his ADP, he doesn’t need to despite being on one of the best offenses in the NFL.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Kenneth Walker III",
    "Team": "SEA",
    "Bye Week": "10",
    "Rank": "55",
    "Points": "213.4",
    "Risk": "4.7",
    "Upside": "8.0",
    "ADP": "5.05",
    "Outlook": "Walker’s first two seasons were nearly identical in fantasy points per game, total touchdowns, and yards per touch. He saw 73% of the team’s rush attempts (10th best among RBs) in 15 games played and his elite red zone role remained unchallenged despite Zach Charbonnet’s presence and in spite of the Seahawks’ ineptitude in sustaining drives in 2023. Walker seems very game script dependent (ala Derrick Henry) as he averaged 14.8 fantasy points per game in Seattle wins versus a pedestrian 8.6 in losses. We can expect those trends to continue but he remains a valuable RB2 for fantasy.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Terry McLaurin",
    "Team": "WAS",
    "Bye Week": "14",
    "Rank": "56",
    "Points": "213.2",
    "Risk": "4.7",
    "Upside": "6.5",
    "ADP": "6.10",
    "Outlook": "Scary Terry has always been a talented WR, but he’s now entering his age 29 season and has finished on average as the WR23. At this point in a player’s career, you sort of know what you’re going to get - fringe WR2/3 fantasy production and probably not much more, especially with a mobile rookie QB under center. Unless Jayden Daniels is the next rookie QB phenom, don’t expect McLaurin to all of a sudden start producing big numbers.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Josh Jacobs",
    "Team": "GB",
    "Bye Week": "10",
    "Rank": "57",
    "Points": "211.6",
    "Risk": "6.0",
    "Upside": "7.3",
    "ADP": "3.03",
    "Outlook": "After leading the league in rushing the previous year, Jacobs bottomed-out in 2023 regressing in a number of important efficiency areas including ranking 47th out of 50 qualifying RBs in fantasy points per opportunity. His landing spot in Green Bay is a boost to his stock fueled by this Jordan Love-led offense. The volume should be there early in the year although it shouldn’t be surprising if rookie MarShawn Lloyd gains more trust. Jacobs feels like a player you ask Siri to remind you about in Week 5. Is he the same old workhorse RB1 or were his struggles in Las Vegas last year a warning sign to stay far, far away?",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Zay Flowers",
    "Team": "BAL",
    "Bye Week": "14",
    "Rank": "58",
    "Points": "210.5",
    "Risk": "3.7",
    "Upside": "6.2",
    "ADP": "5.02",
    "Outlook": "Flowers’ usage last year was a bit all over the map, but he definitely showed he can play in this league and produce for fantasy. To start the year, a lot of his targets were coming close to the line of scrimmage, but as the season went on, he started to see more downfield looks. A versatile weapon in a good offense, expect Flowers to be a popular breakout candidate in the fantasy community, and for good reason. We like him more as a WR2/3 for your fantasy squad.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Jayden Reed",
    "Team": "GB",
    "Bye Week": "10",
    "Rank": "59",
    "Points": "210.1",
    "Risk": "3.7",
    "Upside": "6.5",
    "ADP": "7.02",
    "Outlook": "Reed is one of the more polarizing players in fantasy entering 2024. He showed you everything you hoped you’d see in year one with 2.05 yards per route run, yet he completely disappeared in the playoffs in favor of guys like Romeo Doubs, Dontayvion Wicks and the tight ends. Our fear with Reed is that the Packers could view him as a slot-only WR, and most of his big games came with Christian Watson sidelined. That said, there is no denying the talent is there. Expect him to be a popular breakout candidate among the fantasy community entering 2024.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Diontae Johnson",
    "Team": "CAR",
    "Bye Week": "11",
    "Rank": "60",
    "Points": "207.3",
    "Risk": "4.3",
    "Upside": "5.3",
    "ADP": "8.09",
    "Outlook": "For years in Pittsburgh, Johnson was a target hog, averaging 10.1 targets per game with Big Ben. Unfortunately, we saw the production really fall off with Kenny Pickett under center over the last couple of years. The talent is still there, and he is only 28 years old, but we have major question marks about his new QB in Bryce Young. Given the perception around Young and the Panthers, Johnson could be a value similar to Thielen last year, but we’re not expecting him to be a league winner in 2024.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Aaron Jones",
    "Team": "MIN",
    "Bye Week": "6",
    "Rank": "61",
    "Points": "204.4",
    "Risk": "5.3",
    "Upside": "7.0",
    "ADP": "5.12",
    "Outlook": "Jones tore through the final month of the season and NFC playoffs with five straight 100+ rushing performances as the team's best offensive weapon in the playoffs. Unfortunately, the Packers parted ways and signed Josh Jacobs. Jones is 29, but it's clear he still has something left in the tank as a multi-faceted RB. He stays in the NFC North on a one-year deal to play for the rival Vikings and should have some sort of time share with Ty Chandler, who looked explosive in his opportunities last season. We still view him as a capable RB2 albeit behind a worse offensive line and downgrade at QB.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "George Kittle",
    "Team": "SF",
    "Bye Week": "9",
    "Rank": "62",
    "Points": "202.7",
    "Risk": "6.0",
    "Upside": "7.7",
    "ADP": "6.02",
    "Outlook": "As a volatile TE, we know Kittle will have some down weeks, but what TE doesn’t? This dude is sure to give your fantasy lineup some week-winning scores at least 3-5 times per year. Kittle was 5th at the position in yards per route run and top-10 in yards after the catch per reception showing he’s still got the game-breaking ability we look for in TEs. It doesn’t hurt that he was the apple of Brock Purdy’s eye last year when he was the starter. Assuming Purdy wins the starting job, Kittle’s outlook is strong.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Jaxon Smith-Njigba",
    "Team": "SEA",
    "Bye Week": "10",
    "Rank": "63",
    "Points": "202.2",
    "Risk": "5.7",
    "Upside": "6.8",
    "ADP": "9.03",
    "Outlook": "Smith-Njigba was a first round pick for Seattle last year and the year played out kind of how we expected - he was stuck behind Metcalf and Lockett for playing time and targets, and as a result, the fantasy season wasn’t anything to write home about. The real issue was the horrendous 6.4-yard average depth of target. In fact, he led all players in percentage of targets behind the line of scrimmage and simply put, it’s really hard to score fantasy points like that. Now with a new coaching staff and scheme change, maybe they open up the playbook for JSN to win downfield. That said, as long as Metcalf and Lockett are healthy, the ceiling will probably be capped for JSN in year two.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "DeAndre Hopkins",
    "Team": "TEN",
    "Bye Week": "5",
    "Rank": "64",
    "Points": "201.1",
    "Risk": "5.3",
    "Upside": "6.0",
    "ADP": "8.06",
    "Outlook": "Can Will Levis support two top-36 WRs? If you don’t believe so, you should be avoiding one of, or both of Nuk and Ridley in drafts. If you believe in “Banana-Rama” and a resurgence in Tennessee's passing game with the new regime, then Nuk could be a value. Unfortunately, he’s now 32 years old, and the target competition is a lot more difficult with Ridley and Tyler Boyd in town. While he was pretty good last year from an efficiency standpoint, it’s definitely possible we look back at that 2023 season as his last good year in the NFL.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Rhamondre Stevenson",
    "Team": "NE",
    "Bye Week": "14",
    "Rank": "65",
    "Points": "200.4",
    "Risk": "5.3",
    "Upside": "5.5",
    "ADP": "6.10",
    "Outlook": "2022 was a banner year for Rhamondre as he gobbled up 88 targets and was on pace for 72 last year. Unfortunately, an ankle injury cut his season short, but he lowered his yards per carry by a full yard: 5.0 to 4.0. New England’s new look offense with Drake Maye and new OC Alex Van Pelt represents a complete facelift - with an emphasis on an outside zone blocking scheme as a new wrinkle for Rhamondre to learn. Expect 16+ touches per game as the team showed renewed confidence signing him to a multi-year extension although free agent acquisition Antonio Gibson should steal some of the passing downs work. We are Rhamondre fans and love him as a low-end RB2 but also don’t assume we’ll ever get back to that 2022 season.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Kyle Pitts",
    "Team": "ATL",
    "Bye Week": "12",
    "Rank": "66",
    "Points": "199.1",
    "Risk": "5.3",
    "Upside": "7.7",
    "ADP": "5.08",
    "Outlook": "To quote the great Michael Scott, “No question about it, I’m ready to get hurt again.” That’s what it feels like with Kyle Pitts. You can make excuses for him…For one, Arthur Smith is a madman who couldn’t help getting Jonnu Smith touches. He was also recovering from PCL and MCL surgery for most of the 2023 season while trying to catch passes from Marcus Mariota and Desmond Ridder over the last couple of years. No matter where you land on Pitts, it’s not difficult to see a path where it goes much better this year. Of course, it’s all about where he settles when it comes to ADP. If we get a discount, count us in. If he’s steamed up the board with the other Atlanta guys, we wouldn’t fault anyone for running far, far away.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Brian Thomas Jr.",
    "Team": "JAX",
    "Bye Week": "12",
    "Rank": "67",
    "Points": "198.3",
    "Risk": "4.7",
    "Upside": "6.5",
    "ADP": "8.12",
    "Outlook": "With Zay Jones cut and Calvin Ridley in Tennessee, the 3WR set for the Jags should be Brian Thomas Jr. and Gabe Davis on the perimeter with Kirk in the slot. Thomas should have an opportunity to produce right away, but keep in mind that both Evan Engram and Christian Kirk are excellent target earners. It could be a bit frustrating for Thomas, especially early in the year, but there’s certainly some upside in his range of outcomes as a deep threat for Trevor Lawrence.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Chris Godwin",
    "Team": "TB",
    "Bye Week": "11",
    "Rank": "68",
    "Points": "197.6",
    "Risk": "4.7",
    "Upside": "4.3",
    "ADP": "7.03",
    "Outlook": "Doesn’t it feel like Godwin should be at least 30 years old by now? He’s still in his prime at the age of 28 and coming off a year where he saw 130 targets. So why does he feel like the most boring fantasy pick of all time? Touchdowns! With just 5 total TDs over the past two seasons, Godwin hasn’t really popped for fantasy. However, he’s banked 80+ catches and 1,000+ yards in four of his last five seasons. If that TD total comes up to the 5-7 range, Godwin could outperform his ADP by a wide margin.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Tony Pollard",
    "Team": "TEN",
    "Bye Week": "5",
    "Rank": "69",
    "Points": "193.5",
    "Risk": "5.0",
    "Upside": "5.8",
    "ADP": "7.09",
    "Outlook": "That sound you just heard was a gentle flush of the toilet… because that’s where Pollard’s efficiency went in 2023. After fantasy managers pleaded with Dallas for years to give Tony P the rock, he was given a massive opportunity on the league’s best offense and promptly responded by converting just three of his 16 carries inside the five yard line into TDs. The Titans signed the veteran to a three-year deal in hopes the offensive weapons around Will Levis can jump start this team. Pollard is the presumed starter but we are worried this might end up being a 1A & 1B tandem with Tyjae Spears.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Christian Watson",
    "Team": "GB",
    "Bye Week": "10",
    "Rank": "70",
    "Points": "191.4",
    "Risk": "7.2",
    "Upside": "6.8",
    "ADP": "9.06",
    "Outlook": "Will someone please get this man a new set of hamstrings? The hype on Watson entering 2023 was out of control after he exploded down the stretch in 2022. Unfortunately, recurring hamstring problems never let him get on the field consistently to do anything for fantasy. Could he be a post-hype sleeper in 2024 on one of the most exciting up-and-coming offenses in football?",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Jake Ferguson",
    "Team": "DAL",
    "Bye Week": "7",
    "Rank": "71",
    "Points": "189.6",
    "Risk": "3.2",
    "Upside": "6.5",
    "ADP": "8.03",
    "Outlook": "Ferguson broke out in his sophomore season (102 targets for 71/761/5) finishing as the TE8 on a high-powered Cowboys offense. He led all TEs in red zone targets (25) but the five total receiving TDs left something to be desired. He was second on the Cowboys in total targets and with no significant pass-catchers added this off-season, it shouldn't surprise you if Ferguson repeats that feat again and instead hits the 7+ TD range. He’s a late-round TE we’re into.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Jaylen Warren",
    "Team": "PIT",
    "Bye Week": "9",
    "Rank": "72",
    "Points": "189.3",
    "Risk": "4.7",
    "Upside": "5.8",
    "ADP": "9.02",
    "Outlook": "Simply put, Warren was one of the most effective backs in the NFL last year. Among 69 RBs with 50+ rush attempts, Warren ranked third in yards after contact per attempt, fourth in breakaway rush rate, and second in missed tackles forced per attempt. He also was targeted on 28% of his routes making him an efficiency monster. New OC Arthur Smith sold his soul for an unrelenting commitment to run the ball so an emphasis on the running game is a foregone conclusion. We have Warren as a startable FLEX option with upside if Najee Harris were to miss time.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "David Njoku",
    "Team": "CLE",
    "Bye Week": "10",
    "Rank": "73",
    "Points": "188.1",
    "Risk": "5.3",
    "Upside": "7.3",
    "ADP": "8.02",
    "Outlook": "From Week 7 on last season, Njoku was the TE1 in fantasy land, averaging a whopping 9.2 targets per game in that sample. Sure, most of that was with Joe Flacco, but if you’re looking for a later-round TE who has the potential to be a top-three guy, Njoku fits the mold.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Zamir White",
    "Team": "LV",
    "Bye Week": "10",
    "Rank": "74",
    "Points": "186.3",
    "Risk": "5.7",
    "Upside": "6.3",
    "ADP": "7.10",
    "Outlook": "The hard-nosed runner had a solid final four game stretch to close the 2023 season, averaging 24.3 opportunities per game. That is the sample size we have to go off of after Josh Jacobs took the cheese in Green Bay, giving White a massive opportunity entering 2024. New OC Luke Getsy ranked top-two in rush rate each of his two seasons in Chicago and we can expect a ground-and-pound approach again in Las Vegas. Do we think White is super talented? Is he this year’s Alexander Mattison as a backup thrust into a starting role? Maybe yes to both (he can ask his teammate Mattison about the latter) but the main focus is the opportunities at hand as Jacobs vacates 56% of the carries and 10% of the team’s targets.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "David Montgomery",
    "Team": "DET",
    "Bye Week": "5",
    "Rank": "75",
    "Points": "185.1",
    "Risk": "4.0",
    "Upside": "6.2",
    "ADP": "6.05",
    "Outlook": "Montgomery was a red zone monster last year despite sharing the backfield with Jahmyr Gibbs. He had the fifth-most red zone touches and converted 19 of his attempts inside the five yard line to nine rushing TDs. 90% of Montgomery’s fantasy points came via the ground which does raise some red flags with the lack of passing work and a history of regression from fantasy RBs with that much reliance on rushing. While Gibbs might see a bigger workload in 2024, the scoring opportunities will be plentiful for David “Mopportunity” on an offense that averaged the fifth-most points and second-most plays per game in the NFL. Consider him a high floor RB2.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Najee Harris",
    "Team": "PIT",
    "Bye Week": "9",
    "Rank": "76",
    "Points": "185.0",
    "Risk": "6.3",
    "Upside": "5.5",
    "ADP": "7.05",
    "Outlook": "Najee is the guy who shows up late to the party but man, the fashionably late usually have the best time. He was the RB8 from Week 7 and on, repeating his second half performance from the previous year. The end of season numbers look fine with 1,000+ rushing yards each of his first three seasons in the league. However, he’s been usurped as a pass-catcher by Jaylen Warren and the efficiency numbers are declining. His snap rate, opportunities, and fantasy points per game have all trended downward these last two years and the team declined his 5th-year option. It’s rare to find a starting RB on a run-first team this late in your drafts so we aren’t totally out on Najee if you get him late enough.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Tyler Lockett",
    "Team": "SEA",
    "Bye Week": "10",
    "Rank": "77",
    "Points": "184.5",
    "Risk": "5.7",
    "Upside": "5.3",
    "ADP": "11.01",
    "Outlook": "Lockett appears to be quickly approaching that age cliff…sadly. Lockett’s yards per route run and yards per target have dropped in three consecutive seasons as he enters his 10th year in the league. Could he bank a top-36 season and be serviceable? Sure. Does he have enough juice to be a league winner at this stage of his career? Sadly, probably not.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Gus Edwards",
    "Team": "LAC",
    "Bye Week": "5",
    "Rank": "78",
    "Points": "182.1",
    "Risk": "5.7",
    "Upside": "6.8",
    "ADP": "10.05",
    "Outlook": "Beep Beep! The Gus Bus stepped out when J.K. Dobbins went out including a ridiculous run from Weeks 7-11 where he totaled eight rushing TDs in that span. Despite the onslaught of TDs, Edwards’ RB20 finish is the fourth-worst among 80 RBs to hit the 13+ rushing TD mark since 2000. The soon-to-be 29-year-old looked like he would be on his last legs as an early down grinder until his former OC (Greg Roman) hand-picked him to join his high-T approach in Los Angeles. His no-nonsense running style is exactly what gets Roman going in the morning, but for fantasy, his lack of pass-catching will always hold him back from a true ceiling.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Rashee Rice",
    "Team": "KC",
    "Bye Week": "6",
    "Rank": "79",
    "Points": "182.1",
    "Risk": "7.7",
    "Upside": "6.3",
    "ADP": "6.12",
    "Outlook": "Well this offseason has been…something. Sadly, the headlines around Rice right now are not about his stellar on-field play as a rookie; but about his off-the-field issues. It seems almost certain that Rice will get some sort of suspension this year, it’s just a matter of how many games. Obviously, his ADP will be depressed due to the possibility of missing more than a month, and we expect it to fluctuate over the course of the summer as we get more information.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "D'Andre Swift",
    "Team": "CHI",
    "Bye Week": "7",
    "Rank": "80",
    "Points": "181.1",
    "Risk": "4.7",
    "Upside": "6.3",
    "ADP": "6.06",
    "Outlook": "Swifties out there are hoopin’ and hollerin’ that he received the first reported RB free agent contract of 2024. He signed a 3-year, $15 million guaranteed deal as the RB1 for a completely remade Bears offense. Keep in mind that 47% of Swift’s rushing yardage last year came before contact, the highest rate in the NFL and a testament to the Philly offensive line. Since 2011, lead RBs playing alongside rookie QBs have averaged 250+ opportunities and low-end RB2 fantasy point production. That is probably Swift’s floor with room to finish as an RB1 if the Chicago offense hums with Caleb Williams.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Tyjae Spears",
    "Team": "TEN",
    "Bye Week": "5",
    "Rank": "81",
    "Points": "180.9",
    "Risk": "4.3",
    "Upside": "4.8",
    "ADP": "10.02",
    "Outlook": "The 3rd round RB saw 50+ % of snaps in 12 of 17 games as Derrick Henry’s change-of-pace backfield. He became the 14th rookie RB over the last decade to gather 50 receptions and often functioned as this team’s No. 2 pass catcher behind DeAndre Hopkins. He should share touches with Tony Pollard making this a frustrating backfield to buy into for fantasy. We like some of Spears’ efficiency numbers but this Titans offense is also a complete wildcard with Will Levis. Think of Spears at the beginning of the year as a FLEX with benefits.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Jordan Addison",
    "Team": "MIN",
    "Bye Week": "6",
    "Rank": "82",
    "Points": "180.1",
    "Risk": "4.5",
    "Upside": "6.0",
    "ADP": "6.11",
    "Outlook": "Addison had a solid rookie campaign, finishing with over 900 yards and 10 scores. Of course, the Jefferson injury probably helped inflate those numbers, but we love betting on Year 2 wideouts in fantasy who flashed as rookies, and Addison is a former first-round talent. TJ Hockenson is coming off a late-season torn ACL, so the target tree here could be ultra condensed between Jefferson and Addison. Historically, rookie QBs don’t usually support multiple elite fantasy pass catchers, so we’re keeping expectations in check a bit, but Addison looks like a rock-solid target in the middle rounds.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Zack Moss",
    "Team": "CIN",
    "Bye Week": "12",
    "Rank": "83",
    "Points": "179.1",
    "Risk": "5.0",
    "Upside": "6.3",
    "ADP": "8.11",
    "Outlook": "There was a moment when Zack Moss was one of THE stories of fantasy football in 2023. When Jonathan Taylor was out, he was a usage monster, averaging 17.2 fantasy points per game and 22.2 opportunities from Weeks 2-7. He was eventually phased out once JTT returned. Moss is only 26, and he now gets rewarded for his play last season with a two-year deal to play with Joe Burrow and the Bengals, while Joe Mixon is off to Houston. Expect Moss to be the team's primary early down back with last year's 5th round rookie, Chase Brown, mixing in as a change of pace option. Moss is nothing special talent-wise but sometimes all your fantasy roster needs is a RB with opportunities to fill out a FLEX spot.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Javonte Williams",
    "Team": "DEN",
    "Bye Week": "14",
    "Rank": "84",
    "Points": "177.7",
    "Risk": "6.2",
    "Upside": "6.0",
    "ADP": "8.09",
    "Outlook": "Javonte was by no means an inferno with a predictably down year in 2023. He had just three total rushing TDs, and averaged 3.6 yards per carry, 3.8 yards per touch. Sean Payton still loaded him up with 275 opportunities despite his inefficiency coming off a major injury. This Denver backfield was peppered with targets from Russell Wilson and Bo Nix does excel in the short area passing game. The hope is he is a usage monster in a contract year and gives your team top-15 type numbers. However, the reality is (to quote the great philosopher Jason Moore) this Denver team projects to be one of the worst in the NFL so scoring opportunities might be few and far between. He is more in the low-end RB2 camp to start the year.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Austin Ekeler",
    "Team": "WAS",
    "Bye Week": "14",
    "Rank": "85",
    "Points": "177.3",
    "Risk": "6.7",
    "Upside": "5.5",
    "ADP": "8.12",
    "Outlook": "Apologies if you inhaled the fantasy football stink bomb known as Austin Ekeler in 2023. His yards per carry plummeted to 3.5 as 61% of his rush attempts went for three yards or fewer. In fact from Thanksgiving on, he had just one gain of 10+ yards on 77 attempts… oh, and it went for 10 yards. Time to take out the SNES cartridge, blow on it, and fire this thing back up! Ekeler reunites with RB coach Anthony Lynn (his HC in Los Angeles) and finds himself in a backfield where he could make some noise as a PPR option. Brian Robinson Jr. is the early down grinder but Ekeler can make his bones on passing downs and reinvent himself as a low-end RB2. You can’t hold onto what he once was for fantasy but maybe we can find room for him for a little bit more Awesome Excellence.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Devin Singletary",
    "Team": "NYG",
    "Bye Week": "11",
    "Rank": "86",
    "Points": "176.7",
    "Risk": "3.3",
    "Upside": "6.3",
    "ADP": "9.08",
    "Outlook": "“Singlecarry” morphed into the Texans’ workhorse back, averaging 19.6 opportunities per game from Week 9 on, making Houston’s one-year $3 million investment look like a steal and Dameon Pierce an afterthought. He leaves one of the best young offenses in the NFL and lands in New York with $9.5 million guaranteed in hand to try to replace Saquon Barkley, who accounted for 30% of the team’s total yardage in his 14 games played, the highest rate in the NFL.  Add in an offensive line that is… well, downright offensive and it could be a “close your eyes” situation where you ignore the jersey (sorry Giants fans) and lean into his volume in fantasy as a startable FLEX option.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Ladd McConkey",
    "Team": "LAC",
    "Bye Week": "5",
    "Rank": "87",
    "Points": "176.5",
    "Risk": "5.7",
    "Upside": "7.3",
    "ADP": "8.04",
    "Outlook": "The Bolts used the 34th overall pick on McConkey, and he landed in a dream scenario for him to produce right away. The target competition here is virtually non-existent. If he’s talented enough to capitalize on the opportunity, he could easily outperform his ADP.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Jakobi Meyers",
    "Team": "LV",
    "Bye Week": "10",
    "Rank": "88",
    "Points": "175.3",
    "Risk": "3.3",
    "Upside": "4.2",
    "ADP": "11.10",
    "Outlook": "Meyers with Jimmy G? Randy Moss. Meyers with Aidan O’Connell? Cardio king. The splits with and without Jimmy G last year were wild. With Garoppolo under center last year, Meyers averaged over 18 PPR points per game then disappeared down the stretch with AOC under center. The truth is probably somewhere in the middle - a talented WR who is unlikely to see a ton of volume and therefore, a low upside pick in fantasy circles. Of course, if Davante would get injured, we know Meyers is talented enough to earn volume but as far as his season-long outlook with Adams and Bowers now in town, we’re not thrilled.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Darnell Mooney",
    "Team": "ATL",
    "Bye Week": "12",
    "Rank": "89",
    "Points": "175.3",
    "Risk": "3.0",
    "Upside": "4.7",
    "ADP": "16.04",
    "Outlook": "The pass rate is going to be there for the Falcons, but is Mooney talented enough to capitalize on it? After logging 1,000 yards in his second year, Mooney’s numbers have fallen off a cliff over the last two years, leaving us wondering if that was just a flash in the pan back in 2021. Financially, the Falcons think there’s something there after signing him to almost $40 million. There’s a good chance Mooney cracks your lineup as a FLEX option a handful of times this year, but he is likely to be quite the boom-bust option in this offense.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Ezekiel Elliott",
    "Team": "DAL",
    "Bye Week": "7",
    "Rank": "90",
    "Points": "172.6",
    "Risk": "6.0",
    "Upside": "4.5",
    "ADP": "10.09",
    "Outlook": "Well, well, well. Look who’s back! Elliott returns to Dallas after a year in New England where he was quietly effective for fantasy down the stretch as the RB9 from Week 13 on. Shield your gaze from the efficiency numbers as he averaged just three yards per carry in that span with the RB age cliff certainly working against him. This Dallas offense ranked #1 in red zone plays per game last year and Tony Pollard woefully converted just three of his 16 carries inside the five into TDs. The opportunity is there for Zeke to fall into the end zone and be a FLEX-worthy play on a weekly basis.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Brian Robinson Jr.",
    "Team": "WAS",
    "Bye Week": "14",
    "Rank": "91",
    "Points": "172.4",
    "Risk": "3.3",
    "Upside": "4.8",
    "ADP": "10.04",
    "Outlook": "BRob had the same amount of touches (214) as his rookie year but out produced in both the yardage and TD department big time. It feels like a dream but for the first 11 weeks of the season, he was the RB4(!) in fantasy averaging 13.5 fantasy points per game and 15.5 opportunities. The surprising part was he showed out as a pass-catcher after totaling just 60 receiving yards as a rookie. This Washington offense has a major offensive scheme change from Eric Bienemy to Kliff Kingsbury and with the added variable of a rookie QB, you can kiss the memories of BRob’s early season breakout good-bye. We have Austin Ekeler ranked ahead of him and can’t endorse him as much more than a depth piece to your roster.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Jonathon Brooks",
    "Team": "CAR",
    "Bye Week": "11",
    "Rank": "92",
    "Points": "172.4",
    "Risk": "6.3",
    "Upside": "7.0",
    "ADP": "8.07",
    "Outlook": "While the Panthers offense does give us some paws (see what we did there), Brooks was selected as the RB1 and only RB taken in the first two rounds of the NFL Draft. The competition (Chuba Hubbard and Miles Sanders) is not concerning and new HC Dave Canales' run-heavy scheme should do wonders for Bryce Young and the entire offense. A rebuilt interior of the offensive line and a decade-long streak of rookie RBs contributing top-24 fantasy seasons says Brooks has a path to continue that trend. Consider him in FLEX territory to begin the season, but he should work his way to RB2 status as the weather turns colder.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Rome Odunze",
    "Team": "CHI",
    "Bye Week": "7",
    "Rank": "93",
    "Points": "171.5",
    "Risk": "6.0",
    "Upside": "6.3",
    "ADP": "6.08",
    "Outlook": "Chicago used the ninth overall pick in the NFL Draft on Odunze, giving Caleb Williams yet another weapon to try to help him get off to a fast start as a pro. D.J. Moore and Keenan Allen are some elite target earners, so for redraft purposes, Odunze may disappoint, especially early in the year. That said, he’s a very talented player, and rookie WRs can really peak late in the season. Should Moore or Keenan get injured, Odunze’s value would skyrocket, so we don’t mind taking a ‘wait and see’ approach with Odunze on your bench.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Brandin Cooks",
    "Team": "DAL",
    "Bye Week": "7",
    "Rank": "94",
    "Points": "170.9",
    "Risk": "3.7",
    "Upside": "5.2",
    "ADP": "13.05",
    "Outlook": "Cooks was basically non-existent in the first month and a half of last year, but after the bye week when Dallas cranked up their pass rate, Cooks’ 17-game pace from Week 8 on was 63 receptions, 847 yards, and 11 TD. That sort of TD production is likely not sustainable for a player entering his age 31 season, but anything close to that reception and yardage total would make Cooks a very strong value target in drafts. After Michael Gallup was released, there really isn’t anyone to threaten Cooks’ playing time as the WR2 across from Lamb.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Mike Williams",
    "Team": "NYJ",
    "Bye Week": "12",
    "Rank": "95",
    "Points": "170.4",
    "Risk": "6.7",
    "Upside": "4.3",
    "ADP": "11.12",
    "Outlook": "Coming off the torn ACL as a big boundary wide receiver, there’s some concern about his ability to separate and have a monster year for fantasy. That said, could he see plenty of red zone targets and put up 8-10 TDs if things go well for Rodgers and this offense? Certainly. He’s an interesting WR3/4 for your fantasy team where we’re generally inviting variance after already having a couple of locked-in studs.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Adam Thielen",
    "Team": "CAR",
    "Bye Week": "11",
    "Rank": "96",
    "Points": "169.5",
    "Risk": "5.3",
    "Upside": "4.3",
    "ADP": "15.08",
    "Outlook": "If you happened to draft Thielen last year, you are well aware of how much volume he earned early in the season. After shockingly looking like a league winner at the age of 48 years old last season, Thielen fizzled out down the stretch. He proved us wrong last year, but we’re not buying back into him after the team drafted Legette and brought in Diontae Johnson. Expect Thielen to help the Panthers more than your fantasy team.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Keon Coleman",
    "Team": "BUF",
    "Bye Week": "12",
    "Rank": "97",
    "Points": "169.0",
    "Risk": "6.3",
    "Upside": "7.3",
    "ADP": "9.03",
    "Outlook": "The 3WR set for Buffalo is projected to be Coleman, Khalil Shakir, and Curtis Samuel. Because of that, it’s not exactly difficult to squint and see a big year for Keon Coleman as a rookie in this Bills offense. A true boundary WR, there really isn’t another guy on this roster who fits his archetype, so we feel good about his opportunity to see the field right away. There are a wide range of outcomes for a guy like Coleman, but he’s got the upside to break out as the year goes on.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Jerome Ford",
    "Team": "CLE",
    "Bye Week": "10",
    "Rank": "98",
    "Points": "168.1",
    "Risk": "3.7",
    "Upside": "4.7",
    "ADP": "11.05",
    "Outlook": "Ford was a steady force for fantasy in 2023, finishing as a top-24 RB eleven times! He averaged 16.3 opportunities per game and also was more involved in the passing game than you might realize with 60 targets. The Browns ranked #1 in the NFL in rushing plays per game (34.3) in non-Joe Flacco games. Expect a heavy reliance on the run with Deshaun Watson with Ford leading the group for now. He is shaping up again to be a depth piece in your drafts with FLEX-worthy appeal right away if Nick Chubb is brought along slowly.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Jerry Jeudy",
    "Team": "CLE",
    "Bye Week": "10",
    "Rank": "99",
    "Points": "167.6",
    "Risk": "4.3",
    "Upside": "4.0",
    "ADP": "12.03",
    "Outlook": "The Broncos have been trying to trade Jeudy for the better part of two years if that tells you anything. They got their deal done, and now Jeudy lands in Cleveland as the WR2 behind Mr. Cooper. Perhaps the change of scenery is what he needs? Honestly, he feels like the type of player you take in your fantasy draft then stash on your bench until Week 6 when you eventually drop him for a backup RB. Here is a list of WRs who had more top-24 WR weeks than Jeudy last season: Kendrick Bourne, Demarcus Robinson, Josh Reynolds, and Noah Brown. Enough already.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Rashid Shaheed",
    "Team": "NO",
    "Bye Week": "12",
    "Rank": "100",
    "Points": "167.3",
    "Risk": "3.3",
    "Upside": "5.2",
    "ADP": "12.05",
    "Outlook": "Through two years in the league, Shaheed has been an efficiency monster, averaging 16.3 yards per catch and 11.1 yards per target. No longer just a deep threat, it was nice to see Shaheed develop a bit as a more complete NFL WR in year two. All the signs are there that Shaheed could enjoy a nice little breakout in year three - Michael Thomas is finally out of the way, Shaheed has flashed big play ability early and this Saints offense will finally look like a 21st century offense under new OC Klint Kubiak. As long as the ADP is manageable, adding Shaheed late in your draft could pay dividends.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Quentin Johnston",
    "Team": "LAC",
    "Bye Week": "5",
    "Rank": "101",
    "Points": "165.5",
    "Risk": "7.3",
    "Upside": "7.0",
    "ADP": "15.03",
    "Outlook": "What a Quge mistake that season was…and it’s not like this guy didn’t have an opportunity. Mike Williams tore his ACL in Week 3, and Keenan Allen missed the last few weeks of the year with a heel injury. Obviously, there are not many positives to take away from Johnston’s rookie year, and now the offense is set to be one of the most run-heavy schemes in the league under Greg Roman and Jim Harbaugh. In theory, he should have a chance to run some routes given the state of the depth chart, but we’re just not sure how talented he is after what we saw last year. Is he a flier at the end of your drafts? Sure. Why not.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Joshua Palmer",
    "Team": "LAC",
    "Bye Week": "5",
    "Rank": "102",
    "Points": "165.2",
    "Risk": "3.0",
    "Upside": "4.7",
    "ADP": "12.09",
    "Outlook": "Palmer’s always been a viable WR3 type of play in fantasy whenever he’s gotten the opportunity. In 21 career games with Justin Herbert where he’s seen 5+ targets in a game, he’s averaged 12.8 PPR points per game. Considering the state of the depth chart, Palmer could play in 2WR sets, and he’s already got some chemistry with Herbert. No, he won’t win you your league, but he could be a valuable bench player for your team.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Curtis Samuel",
    "Team": "BUF",
    "Bye Week": "12",
    "Rank": "103",
    "Points": "164.8",
    "Risk": "4.0",
    "Upside": "4.8",
    "ADP": "10.12",
    "Outlook": "Samuel quietly led the Washington trio last year in targets per route run and now he gets a QB upgrade and a reunion with OC Joe Brady, whom he played for back in his Carolina days. His fit in the offense is TBD, especially with Dalton Kincaid getting a lot of snaps in the slot where Samuel primarily runs his routes. Regardless, he will have a role in one of the league’s best offenses making him a sneaky late-round target in drafts.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Pat Freiermuth",
    "Team": "PIT",
    "Bye Week": "9",
    "Rank": "104",
    "Points": "164.7",
    "Risk": "3.7",
    "Upside": "6.2",
    "ADP": "11.05",
    "Outlook": "For the sake of this company, we need the Muth to get Luth! After flashing as a rookie two years ago then posting over 700 yards in 2022 when he was the TE8, it was a forgettable 2023. He only played in 12 games last season, battling a hamstring injury, but the Muth is still only 25 years old, and we know Arthur Smith’s offense loves to feature the TE. Honestly, there are worse late round punt TE options. 600-800 yards and 5-7 TDs is a realistic outcome.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Courtland Sutton",
    "Team": "DEN",
    "Bye Week": "14",
    "Rank": "105",
    "Points": "164.6",
    "Risk": "4.0",
    "Upside": "5.3",
    "ADP": "10.07",
    "Outlook": "There may not be a bigger regression candidate in fantasy football than Courtland Sutton, who caught 10 TD passes despite catching just 59 passes in 2023. Factoring in that regression plus playing with a rookie QB, Sutton is a guy who’s a potential bust relative to expectations as the WR1 for Denver.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Xavier Worthy",
    "Team": "KC",
    "Bye Week": "6",
    "Rank": "106",
    "Points": "164.2",
    "Risk": "5.7",
    "Upside": "7.2",
    "ADP": "7.04",
    "Outlook": "Andy Reid has historically slow-played his rookie WRs, but he may not have a choice this time thanks to Rashee Rice’s off-the-field antics. Worthy was a Round 1 selection who should play right away across from Marquise Brown. We’re not sure he’ll get out to a super fast start as a rookie with Mahomes, but the upside is immense if he does. The Chiefs have openly talked about managing Kelce’s reps during the regular season, and if they do that and Rice misses several games because of suspension, Worthy will have an opportunity to crush his ADP.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Cole Kmet",
    "Team": "CHI",
    "Bye Week": "7",
    "Rank": "107",
    "Points": "161.2",
    "Risk": "2.8",
    "Upside": "5.6",
    "ADP": "11.05",
    "Outlook": "Kmet has quietly finished as the TE7 in back-to-back seasons, but now he’s set to play alongside three stud muffin WRs. Still only 25 years old and an ascending talent, we like Kmet as a player, but it’s going to be tough for him to replicate the 90 targets he saw last year as long as Moore, Allen, and Odunze are healthy. Expect some TE1 weeks from Kmet throughout the year, but we don’t view him as a guy you can trust in your lineup on a week-to-week basis.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "T.J. Hockenson",
    "Team": "MIN",
    "Bye Week": "6",
    "Rank": "108",
    "Points": "160.4",
    "Risk": "7.5",
    "Upside": "6.0",
    "ADP": "9.10",
    "Outlook": "Hockenson has been great ever since he got to Minnesota, piling up volume as the number two option for the Vikings. He led all TEs with 8.5 targets per game in 2023, and while some of those numbers were inflated due to the Jefferson hamstring injury, it just goes to show how valuable he is to their offense. In 2024, unfortunately, we’re not sure he’ll be the same player coming off that late-season ACL injury. On top of the injury concerns, Hockenson will now have to compete with emerging talent in Jordan Addison for targets behind JJetts with a rookie QB in JJ McCarthy. Perhaps he’s an interesting trade target after a month or so, assuming he gets off to a slow start.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Jameson Williams",
    "Team": "DET",
    "Bye Week": "5",
    "Rank": "109",
    "Points": "160.1",
    "Risk": "6.0",
    "Upside": "6.5",
    "ADP": "10.03",
    "Outlook": "Are you tracking how weird the start of Williams’ NFL career is? He spent his rookie season recovering from the torn ACL then a gambling suspension and hamstring injury forced him to get off to a slow start in 2023 as a sophomore. Even still, the fantasy community seems to have talked themselves into taking a shot on Williams entering Year 3 in the league. We get the excitement for a player who was the former 12th overall pick, but buyer beware. This is a guy who barely averaged over 4(!) fantasy points per game in two seasons, and if the ADP on him gets out of control this summer, just realize there is downside to a player like this. Williams is a wildcard in the double-digit rounds.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Demario Douglas",
    "Team": "NE",
    "Bye Week": "14",
    "Rank": "110",
    "Points": "159.4",
    "Risk": "4.3",
    "Upside": "4.0",
    "ADP": "15.12",
    "Outlook": "Douglas was a big beneficiary of the Bourne injury last year, earning a full-time role in the middle part of the season. Unfortunately, he missed three games with a concussion, but he did have a handful of weeks as a top-36 option. There’s virtually no ceiling with a player like this, but he could be a starter in deep leagues or a bye week fill-in if he can earn enough targets as the starting slot WR.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Dallas Goedert",
    "Team": "PHI",
    "Bye Week": "5",
    "Rank": "111",
    "Points": "159.0",
    "Risk": "5.3",
    "Upside": "5.3",
    "ADP": "9.08",
    "Outlook": "After Zach Ertz left Philly years ago, we all thought Goedert would be the next great fantasy TE. To his credit, he has had a handful of top-12 seasons, but he hasn’t taken a step forward and become a top-five option the way we had hoped. By now, you know what you’re likely to get from Goedert - something in the TE10-15 range. As long as Brown and Smith are healthy, there isn't a ton of opportunity available for Goedert, especially considering the Jalen Hurts tush push is probably here to stay.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Adonai Mitchell",
    "Team": "IND",
    "Bye Week": "14",
    "Rank": "112",
    "Points": "157.2",
    "Risk": "5.3",
    "Upside": "5.5",
    "ADP": "11.03",
    "Outlook": "Mitchell slipped a little bit in the draft to the middle of the second round after many expected him to go in the top-32. On paper, it’s a decent spot for him to get on the field right away after Alec Pierce spent all of last season running wind sprints opposite Michael Pittman Jr. We expect Mitchell to grab that WR2 job immediately out of the gate. In this offense, that could lead to a few big games, but we’d be surprised if Mitchell becomes a mainstay in your fantasy lineup right away. Pittman is an elite target earner, Josh Downs is a capable slot WR, and we know the offense will flow through Jonathan Taylor and Anthony Richardson’s legs. That said, stashing a talented rookie on your bench is never a bad idea to see if he can emerge in the second half of the year.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Ja'Lynn Polk",
    "Team": "NE",
    "Bye Week": "14",
    "Rank": "113",
    "Points": "155.2",
    "Risk": "6.0",
    "Upside": "5.8",
    "ADP": "13.12",
    "Outlook": "Rome Odunze is the top-tier WR out of Washington, but don’t forget about Polk. The Pats used the 37th overall pick on him, and he should have the opportunity to get on the field right away. Being tied to what projects to be a terrible offense with a rookie QB obviously doesn’t scream fantasy league winner, but we’ve seen rookie WRs come on late in the year. Polk could have a similar archetype, especially if this Drake Maye led Pats team is better than projected.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Marquise Brown",
    "Team": "KC",
    "Bye Week": "6",
    "Rank": "114",
    "Points": "154.9",
    "Risk": "3.7",
    "Upside": "5.8",
    "ADP": "7.08",
    "Outlook": "Brown had all the opportunity in the world last season as the only real option in the Cardinals’ WR room. However, he dealt with a heel injury and/or poor QB play for most of the year. On paper, the season from Brown was quite bad - he averaged just 1.25 yards per route run and was 76th in fantasy points per route run. Was it the heel? The QB play? Is Brown just not as good as he once was? A combination? There’s a ton of moving parts here. Obviously, the Rashee Rice potential suspension has opened up an opportunity for Brown to play a meaningful role out of the gate. We’ll see if he can capitalize with Mahomes.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Tyler Conklin",
    "Team": "NYJ",
    "Bye Week": "12",
    "Rank": "115",
    "Points": "154.5",
    "Risk": "3.7",
    "Upside": "4.7",
    "ADP": "16.07",
    "Outlook": "Death, taxes, and 87 targets for Tyler Conklin. No, seriously…Conk Conk has seen exactly 87 targets in three straight years, so obviously write it in pen for 2024. All kidding aside, Conklin is an interesting late-round punt option who is likely to have a handful of top-10 weeks thanks to TD upside in what projects to be a good offense assuming Aaron Rodgers can stay healthy.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Dalton Schultz",
    "Team": "HOU",
    "Bye Week": "14",
    "Rank": "116",
    "Points": "153.8",
    "Risk": "3.7",
    "Upside": "5.3",
    "ADP": "9.12",
    "Outlook": "The doctor! Schultz is tied to a great offense with CJ Stroud, so there are some reasons to be excited about his TD upside if things break right. That said, he’s now competing with three studs in Nico, Tank, and Diggs. If those guys stay healthy, it’s going to be difficult for him to be a huge hit at ADP.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Josh Downs",
    "Team": "IND",
    "Bye Week": "14",
    "Rank": "117",
    "Points": "153.3",
    "Risk": "3.3",
    "Upside": "4.7",
    "ADP": "12.08",
    "Outlook": "Downs ran 81% of his routes from the slot last season and after the team selected AD Mitchell in Round 2, we shouldn’t expect that to change. Unfortunately, this is an offense set up to consistently support just one WR on a week-in and week-out basis and that guy is obviously Pitty City. Without a high-volume role, Downs is likely to struggle to be a consistent fantasy producer. If something happens to Pittman, however, we’ve at least seen him prove he is a capable NFL WR who can give you WR3 production.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Romeo Doubs",
    "Team": "GB",
    "Bye Week": "10",
    "Rank": "118",
    "Points": "150.8",
    "Risk": "3.3",
    "Upside": "5.3",
    "ADP": "10.10",
    "Outlook": "The dude just gets it done. No, he won’t win you your league but Doubs has shown us through two years in the league that he can play. He had a very solid year two jump last season with almost 700 yards and eight TDs, and he is more than capable of providing WR3-type numbers when given the opportunity. Of course, there are a lot of players in this Packers receiving corps who could earn some snaps, so that will keep his ADP way down. We like him as a bench option for your squad.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Gabe Davis",
    "Team": "JAX",
    "Bye Week": "12",
    "Rank": "119",
    "Points": "149.1",
    "Risk": "5.3",
    "Upside": "4.7",
    "ADP": "13.03",
    "Outlook": "Look, you know what you’re getting with “Gabe The Babe”. If you click the button in your draft, get ready for the best and worst weeks of your life. Davis’ yards per route run and targets per route run have dropped in three straight seasons, and now he’s leaving Josh Allen and the Bills’ potent offense. Will he have a couple of massive games? Probably. Will he also completely disappear for weeks on end? Definitely.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Demarcus Robinson",
    "Team": "LAR",
    "Bye Week": "6",
    "Rank": "120",
    "Points": "148.6",
    "Risk": "3.7",
    "Upside": "4.7",
    "ADP": "19.08",
    "Outlook": "Robinson was quietly pretty good for the Rams last year as the WR3, especially down the stretch. In fact, he led the team in end zone targets from Week 12 on after he overtook Tutu Atwell for the WR3 job while adding a 17.5% target share. With Tyler Higbee coming off a late-season torn ACL, Robinson could be involved yet again behind Puka and Kupp. It’s going to be tough for him to be a consistent producer as long as both guys are healthy, but if either Kupp or Puka miss time, D Rob would be an immediate plug-and-play option off the waiver wire.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Roman Wilson",
    "Team": "PIT",
    "Bye Week": "9",
    "Rank": "121",
    "Points": "146.3",
    "Risk": "4.7",
    "Upside": "5.0",
    "ADP": "15.07",
    "Outlook": "Wilson’s competition for playing time out of the gate as a rookie: Van Jefferson, Denzel Mims, Calvin Austin, and Quez Watkins. Ya know, the boys! Sure, the passing volume will be low, but Wilson can win with efficiency as he did in college. At Michigan, he was second in this year’s WR class in EPA per target. We love him as a late-round target given the path for playing time as early as Week 1.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Wan'Dale Robinson",
    "Team": "NYG",
    "Bye Week": "11",
    "Rank": "122",
    "Points": "145.5",
    "Risk": "3.0",
    "Upside": "4.2",
    "ADP": "16.12",
    "Outlook": "Robinson’s rookie year was cut short due to a torn ACL, and in his second pro season, he went for just over 500 yards with everything close to the line of scrimmage. His 5.5-yard aDOT won’t produce fantasy numbers unless he is seeing a boatload of targets. The addition of Malik Nabers sixth overall says it is probably not going to happen.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Jermaine Burton",
    "Team": "CIN",
    "Bye Week": "12",
    "Rank": "123",
    "Points": "143.5",
    "Risk": "4.7",
    "Upside": "5.0",
    "ADP": "16.06",
    "Outlook": "Burton comes from two stud schools - Georgia and Alabama. He’s got the pedigree that says he could work out for fantasy if things click. There’s a wide range of outcomes here given his downfield role (over a 20-yard aDOT last season at Alabama!), and he is playing behind two studs in Chase and Higgins, so we’re not thrilled about his early season outlook. However, if Chase or Higgins happens to pick up an injury, Burton would be a really interesting add off the waiver wire.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Xavier Legette",
    "Team": "CAR",
    "Bye Week": "11",
    "Rank": "124",
    "Points": "141.7",
    "Risk": "6.0",
    "Upside": "6.3",
    "ADP": "11.11",
    "Outlook": "A fifth-year breakout out at South Carolina, the Panthers traded up to keep him close to home. It’s a really fun story and we’re rooting for things to work out. That said, this production profile combined with what Bryce Young did as a rookie gives you zero confidence. It would not be surprising at all to see Legette pop up for some massive games and finish as a top-36 option. It would also not be surprising to see him do almost nothing as a rookie while competing with Diontae Johnson and Adam Thielen for targets. If you’re looking for a late-round target with a massive range of outcomes, Legette is your dude.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Zach Charbonnet",
    "Team": "SEA",
    "Bye Week": "10",
    "Rank": "125",
    "Points": "141.1",
    "Risk": "3.3",
    "Upside": "5.0",
    "ADP": "11.10",
    "Outlook": "Charbs had one of the quietest rookie seasons in recent memory for a player we thought would be much more involved. With Kenneth Walker III in the lineup, he averaged just 7.8 opportunities per game. He totaled just two top-24 performances and among 2nd round rookie RBs over the last decade with 100+ touches, his 6.63 PPR points per game is near the bottom. The fact that Seattle used the 52nd overall pick on him in 2023 says they've got a plan to get him touches… we think.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Jahan Dotson",
    "Team": "WAS",
    "Bye Week": "14",
    "Rank": "126",
    "Points": "141.0",
    "Risk": "5.3",
    "Upside": "4.5",
    "ADP": "13.10",
    "Outlook": "Yikes. Dotson went full first-team all cardio in 2023 with an abysmal 0.82 yards per route run rate. How bad was his year? Among 120 WRs who saw 25+ targets last season, Dotson ranked 105th. Considering the Commanders threw at one of the highest rates in football, it’s obviously concerning that Dotson was borderline irrelevant for fantasy. Perhaps he can be a post-hype sleeper in 2024, but nothing he did in 2023 gives you any confidence whatsoever.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Darius Slayton",
    "Team": "NYG",
    "Bye Week": "11",
    "Rank": "127",
    "Points": "140.1",
    "Risk": "3.3",
    "Upside": "4.7",
    "ADP": "23.09",
    "Outlook": "Slayton’s the type of guy who just always seems to have three to five very solid fantasy performances late in the year, so just know at some point this year, Slayton will probably make the waiver wire show. Plan accordingly.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Ty Chandler",
    "Team": "MIN",
    "Bye Week": "6",
    "Rank": "128",
    "Points": "139.7",
    "Risk": "3.7",
    "Upside": "5.2",
    "ADP": "13.04",
    "Outlook": "Alexander Mattison's efficiency as a runner was a major issue and down the stretch, he lost playing time to Ty Chandler, who looked more explosive with his touches. From Week 10 on, Chandler averaged 14 opportunities including a ridiculous Week 15 game where he totaled 157 yards and was the RB4 on the week. The Vikings decided to cut ties with Mattison leaving Ty Chandler as the projected backup to Aaron Jones. Chandler seems trusted by this regime, so if Jones went down, he is the next man up.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Noah Fant",
    "Team": "SEA",
    "Bye Week": "10",
    "Rank": "129",
    "Points": "138.2",
    "Risk": "3.0",
    "Upside": "4.0",
    "ADP": "18.11",
    "Outlook": "Doesn’t it feel like we’ve been on the verge of a Noah Fant breakout for years? After back-to-back TE12 seasons in Denver, Fant has underwhelmed in Seattle. Perhaps he has a surge on his second contract as we’ve seen from other TEs. We’ll see if this new staff can get the best out of him.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Dontayvion Wicks",
    "Team": "GB",
    "Bye Week": "10",
    "Rank": "130",
    "Points": "138.1",
    "Risk": "4.3",
    "Upside": "5.7",
    "ADP": "14.12",
    "Outlook": "On paper, Wicks is probably the odd man out for snaps entering Week 1, but perhaps he shouldn’t be. He matched Reed’s efficiency with a 2.04 yards per route run mark as a 5th-round rookie. Not bad! It’s tough to project playing time right now with everyone healthy, but if anyone else on this depth chart misses time, Wicks looks talented enough to capitalize on the opportunity in an offense we want exposure to in 2024.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Khalil Shakir",
    "Team": "BUF",
    "Bye Week": "12",
    "Rank": "131",
    "Points": "136.5",
    "Risk": "3.0",
    "Upside": "5.0",
    "ADP": "11.08",
    "Outlook": "Shakir didn’t do much as a rookie, but he developed into a boom-bust option with some nice moments in year two while playing 52% of the snaps. The Bills WR room is a complete overhaul after the Diggs trade, so there’s certainly an opportunity for someone to emerge. And while Shakir’s underlying metrics look strong (1.84 yards per route run last season), the fact that he only ran 28 routes per game from Week 7 on says he is more likely to be part of this WR committee than a dominant fantasy force.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Zay Jones",
    "Team": "ARI",
    "Bye Week": "11",
    "Rank": "132",
    "Points": "135.4",
    "Risk": "2.5",
    "Upside": "4.5",
    "ADP": "21.03",
    "Outlook": "“The Spot Start” as he’s known around Ballers HQ, Zay Jones finds himself in the desert to compete with Michael Wilson for the WR2 job across from Marvin Harrison Jr. He had a forgettable 2023 thanks to knee and hamstring injuries, but he is just two years removed from a WR26 finish in 2022. Talented enough to produce when given the opportunity, Jones is on the radar as a late-round pick in the event that he does get the WR2 snaps in what projects to be a much improved Cardinals offense in 2024 with Kyler now fully healthy.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Antonio Gibson",
    "Team": "NE",
    "Bye Week": "14",
    "Rank": "133",
    "Points": "135.3",
    "Risk": "4.0",
    "Upside": "5.0",
    "ADP": "13.11",
    "Outlook": "Gibson lands in New England as the RB2 behind Rhamondre Stevenson. He signed a three-year deal as a better fit for this Cleveland Browns‘ style offense under new OC Alex Van Pelt. Look, we get it; we’ve been burned before with Gibson. What’s the definition of insanity? Do something over and over again and expect different results? Well, here we are! But…what if I told you Gibson led all RBs in missed tackles forced per attempt? What if I told you he was 21st among qualified RBs in yards per route run? What if I told you he was younger than Rhamondre Stevenson? Yes, all of these things are true. Gibson’s never going to give you another top-12 fantasy season, but at this price, he doesn’t have to in order to be a late round steal considering he’s averaged 41 receptions per season.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Rico Dowdle",
    "Team": "DAL",
    "Bye Week": "7",
    "Rank": "134",
    "Points": "135.1",
    "Risk": "4.0",
    "Upside": "5.7",
    "ADP": "13.02",
    "Outlook": "Dowdle earned the RB2 job behind Tony Pollard in 2023, but he never really carved out a meaningful role for fantasy, averaging just 6.9 opportunities per game. He's back in Dallas on a one-year deal with a contract that screams \"backup RB.\" While Dowdle was penciled as RB1 following free agency and the NFL Draft, it seemed like this Dallas organization was skeptical that he could handle a full workload. So they brought back old man Ezekiel Elliott. Take a stab at a backfield for one of the best offenses in the NFL hoping Dowdle can fall into the end-zone enough to return RB2/FLEX value.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Brock Bowers",
    "Team": "LV",
    "Bye Week": "10",
    "Rank": "135",
    "Points": "132.5",
    "Risk": "5.8",
    "Upside": "6.7",
    "ADP": "7.06",
    "Outlook": "The fact that the Raiders drafted Bowers despite already having Michael Mayer on the roster says they’ve got a vision for how they’ll use him. Will it come to fruition for fantasy as a rookie? Historically, that has been a losing bet in fantasy circles, but maybe Bowers is just that good. He’s a fine later-round target to see what happens in year one, but if someone else in your league wants to chase him up the board, we’re fine passing in redraft leagues.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Trey Benson",
    "Team": "ARI",
    "Bye Week": "11",
    "Rank": "136",
    "Points": "131.6",
    "Risk": "6.0",
    "Upside": "6.3",
    "ADP": "9.10",
    "Outlook": "As a Day two pick with the size (6’1”, 223 lbs.) and speed (4.39 40-time), the raw tools are there for Benson to be a meaningful fantasy force. James Conner still carries an $8.9 million cap hit and finished 2023 on a tear. He is the team’s RB1 and Benson will have to earn more touches and playing time especially if he doesn’t pick up on pass protection assignments. We saw multiple paths for third round rookie RBs last year. Does Benson sputter behind the veteran (ala Tank Bigsby), become a meaningful compliment (Tyjae Spears), or become an outlier (De’Von Achane)? Nevertheless, we like Benson as a high upside stash for your bench.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Juwan Johnson",
    "Team": "NO",
    "Bye Week": "12",
    "Rank": "137",
    "Points": "127.6",
    "Risk": "3.7",
    "Upside": "5.3",
    "ADP": "21.02",
    "Outlook": "Juwan Johnson was a disappointment last year after he was an interesting late-round target the year prior in drafts. He missed a month due to a calf injury so that played a role in his down year, but like other non-elite TEs, Johnson is pretty TD-dependent. Unfortunately, we're not too excited to draft him in standard 10 or 12-team leagues given his foot injury, but once healthy, he could be on the radar as a streaming option off the waiver wire if he catches the right side of TD variance as he did in Weeks 15-17 last year with three top-10 weekly finishes.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Chigoziem Okonkwo",
    "Team": "TEN",
    "Bye Week": "5",
    "Rank": "138",
    "Points": "127.4",
    "Risk": "2.7",
    "Upside": "4.7",
    "ADP": "16.04",
    "Outlook": "Chig, you dirty dog. You tricked us! After leading the NFL in yards per route run in 2022 and flashing some exciting yards after the catch ability, he did next to nothing last season, finishing as the TE21. Perhaps he can be a streamer in a good matchup, but no need to use a pick on him.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Luke Musgrave",
    "Team": "GB",
    "Bye Week": "10",
    "Rank": "139",
    "Points": "126.8",
    "Risk": "3.0",
    "Upside": "5.2",
    "ADP": "12.02",
    "Outlook": "This rookie TE class from 2023 will be headlined by the likes of Sam LaPorta and Dalton Kincaid, but don’t forget about Musgrave. From Weeks 1-11 prior to his injury, he had four weeks as a top-12 option. We expect the production amongst the Green Bay pass catchers to be pretty spread out, so don’t expect Musgrave to produce a top-five season, but he will have his weeks in good matchups.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Michael Wilson",
    "Team": "ARI",
    "Bye Week": "11",
    "Rank": "140",
    "Points": "125.8",
    "Risk": "3.3",
    "Upside": "3.7",
    "ADP": "16.10",
    "Outlook": "Wilson averaged a 14% target share per game last year and just 1.36 yards per route run on a depth chart that didn’t have Marvin Harrison Jr. Those types of numbers don’t move the needle, and now his target competition got a lot tougher. We expect him to compete with Zay Jones for the WR2 across from Marv, but that doesn’t mean he’ll be very relevant for fantasy.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Marvin Mims Jr.",
    "Team": "DEN",
    "Bye Week": "14",
    "Rank": "141",
    "Points": "125.7",
    "Risk": "5.0",
    "Upside": "5.3",
    "ADP": "17.04",
    "Outlook": "Jerry Jeudy is now in Cleveland, so on paper, Mims has an inside track to playing time in year two. Unfortunately, nothing he did as a rookie gives you any confidence he can capitalize on the projected opportunity. He is worth a late round pick based on that opportunity, but don’t hesitate to move on if he doesn’t do much to start the year.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Ricky Pearsall",
    "Team": "SF",
    "Bye Week": "9",
    "Rank": "142",
    "Points": "123.7",
    "Risk": "6.0",
    "Upside": "5.0",
    "ADP": "13.10",
    "Outlook": "We’re usually excited about first round rookie WRs, even in redraft leagues. For 2024, it’s really hard to paint a positive picture for Pearsall to see enough targets to be relevant. Deebo and Aiyuk are playing at a very high level, CMC gets a ton of looks out of the backfield, and George Kittle is going to pop off for four or five huge weeks as he does every year. That said, in the event of an Aiyuk or Deebo injury, we know exactly who to pick up off waivers.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Kendre Miller",
    "Team": "NO",
    "Bye Week": "12",
    "Rank": "143",
    "Points": "122.9",
    "Risk": "3.3",
    "Upside": "5.7",
    "ADP": "12.10",
    "Outlook": "2023 was a lost cause for the rookie Miller who was injured in preseason, missed nine games, and didn’t see meaningful action until the final week of the year. Miller saw 14 opportunities and a TD against the Falcons while Alvin Kamara was absent. He enters the year as a high upside backup for New Orleans with room to grow into a more meaningful role. Miller is one of the better late round lottery ticket RBs we are interested in stockpiling at the end of our drafts.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Hunter Henry",
    "Team": "NE",
    "Bye Week": "14",
    "Rank": "144",
    "Points": "122.8",
    "Risk": "4.0",
    "Upside": "5.6",
    "ADP": "15.11",
    "Outlook": "Henry’s fantasy prospects have been the same for multiple years - a matchup-dependent, TD-or-bust option on what projects to be a bad team. While we generally don’t love pass catchers with rookie QBs, this scheme with new OC Alex Van Pelt, who comes over from Cleveland, should heavily feature the TE position. Cleveland’s offenses have been among the league leaders in TE target share (5th highest last year), and there is really not an elite WR talent on this roster. Henry is an interesting late-round flier for those who completely punt the position.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Chase Brown",
    "Team": "CIN",
    "Bye Week": "12",
    "Rank": "145",
    "Points": "118.5",
    "Risk": "3.3",
    "Upside": "4.7",
    "ADP": "11.04",
    "Outlook": "The 2023 5th round pick never quite overtook Joe Mixon last year. He saw just two total rush attempts for the first six weeks and then missed the next five weeks with a hamstring injury. From Week 13 on, he averaged nine opportunities per game behind Mixon and while he profiles as a solid pass-catcher, it was clear the team didn’t trust him in pass protection. With the Bengals offense carrying some obvious upside, Brown is a bench stash only and likely waiver wire name to monitor early in the year if Moss were to go down. Until then, know the name and file it away for later.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Cade Otton",
    "Team": "TB",
    "Bye Week": "11",
    "Rank": "146",
    "Points": "117.0",
    "Risk": "2.7",
    "Upside": "4.0",
    "ADP": "13.08",
    "Outlook": "There is just something timeless about your TE wearing #88 and playing without gloves. No one likes being on the field running more empty routes than this man. His cardio is top-notch. If Otton could add a few more TDs to his stat line, he’d likely be able to push for fringe TE1 numbers. Unfortunately, he’s just like almost every other non-elite TE - you’ll get some stream-worthy weeks, but probably not much more as long as Evans and Godwin are healthy.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Rondale Moore",
    "Team": "ATL",
    "Bye Week": "12",
    "Rank": "147",
    "Points": "116.0",
    "Risk": "3.0",
    "Upside": "3.0",
    "ADP": "23.11",
    "Outlook": "Remember when Jonathan Gannon did the “Pew Pew Pew” thing with Rondale when he met him?... Spoiler: the fireworks did not happen. It resulted in 3.6 targets per game last year. At this point, we know what we’re getting with Moore, which is not a lot of fantasy points. Low aDOT targets for fantasy are cute but not worth beans.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Rashod Bateman",
    "Team": "BAL",
    "Bye Week": "14",
    "Rank": "148",
    "Points": "114.5",
    "Risk": "4.3",
    "Upside": "4.7",
    "ADP": "18.10",
    "Outlook": "Behind Mark Andrews and Zay Flowers, there is not much left to go around when it comes to fantasy goodness - just ask anyone who was drafting Odell Beckham and Bateman last season. This staff has shown a willingness to use a WR committee at times, so just as you’re ready to believe you’ve found the WR2 to have in Baltimore, get ready for Nelson Agholor to randomly enter the game and catch a 20-yard TD. Outside of an injury to Zay Flowers in season, we’re not interested in drafting Bateman.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Taysom Hill",
    "Team": "NO",
    "Bye Week": "12",
    "Rank": "149",
    "Points": "114.4",
    "Risk": "4.0",
    "Upside": "6.0",
    "ADP": "15.05",
    "Outlook": "Taysom will  probably continue to do his thing - throwing for a couple of scores, catching a few passes and running in a handful of scores. The tough part is predicting when that's going to happen.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Elijah Moore",
    "Team": "CLE",
    "Bye Week": "10",
    "Rank": "150",
    "Points": "113.5",
    "Risk": "4.3",
    "Upside": "2.3",
    "ADP": "24.02",
    "Outlook": "Man, the Elijah Moore truthers are in shambles! He was brought in via trade last off-season after a falling out with the Jets only to somehow do nothing despite seeing over 100 targets. No need to fall into the trap for a third straight season.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Odell Beckham Jr.",
    "Team": "MIA",
    "Bye Week": "6",
    "Rank": "151",
    "Points": "113.1",
    "Risk": "4.0",
    "Upside": "2.3",
    "ADP": "20.05",
    "Outlook": "The Ravens paying OBJ $15M last year was confusing to say the least. For reference, he was paid like a top-20 WR, yet he caught just 35 passes all season and then barely played in the playoffs. Now 31 years old, OBJ’s days in our fantasy lineups are over although Miami gave him an incentive-laden deal (worth up to $8 million) to see if he has any magic left. Perhaps he’s a guy we’re picking up off waivers later this year in the event Tyreek or Waddle gets injured.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Tyler Allgeier",
    "Team": "ATL",
    "Bye Week": "12",
    "Rank": "152",
    "Points": "112.8",
    "Risk": "3.3",
    "Upside": "3.7",
    "ADP": "14.01",
    "Outlook": "Allgeier was a thorn in the side of Bijan Robinson managers last year. Despite Atlanta selecting Bijan 8th overall in the draft, Allgeier still had 209 opportunities and more carries inside the 5-yard line. As Atlanta moves away from a run-heavy approach, his fantasy stock certainly will take a hit. Aside from deeper leagues, he’s nothing more than an insurance back for 2024 with upside if Bijan were shelved for a week or more.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Jaleel McLaughlin",
    "Team": "DEN",
    "Bye Week": "14",
    "Rank": "153",
    "Points": "112.4",
    "Risk": "3.3",
    "Upside": "5.2",
    "ADP": "15.02",
    "Outlook": "The UDFA burst onto the scene as a jitterbug Sean Payton talked up in the preseason and the speed was evident. He led all RBs in targets per route run (37%) and averaged 5.4 yards per carry. He’ll likely never see more than 10-12 touches in a game but so think of McLaughlin as a Tarik Cohen-type of player. He’s electric with the ball in his hands but his size (5’7”, 187 lbs.) and the depth chart keeps him from being a weekly fantasy asset.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Jalin Hyatt",
    "Team": "NYG",
    "Bye Week": "11",
    "Rank": "154",
    "Points": "112.4",
    "Risk": "4.3",
    "Upside": "4.3",
    "ADP": "21.10",
    "Outlook": "It was not exactly the best rookie year for the former Tennessee Volunteer. Just one weekly finish inside the top-24 can’t give you any confidence heading into Year 2. Perhaps he wins the WR3 job for the Giants, but let’s be real, does it matter?",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Alexander Mattison",
    "Team": "LV",
    "Bye Week": "10",
    "Rank": "155",
    "Points": "111.9",
    "Risk": "4.0",
    "Upside": "3.0",
    "ADP": "19.12",
    "Outlook": "How bad was Mattison last year? He became one of only two RBs over the last 20 years with zero rushing TDs on 180+ carries.  He ranked 291st among 300 RBs in fantasy points per opportunity since 2018. We'd gather more stats for you just to emphasize the point of how inefficient he was as a runner in Minnesota but you get the point. He looks like he will be playing second fiddle to Zamir White in this high-T Luke Getsy offense committed to running the ball. He is not exactly on the redraft radar entering the season.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Trey Palmer",
    "Team": "TB",
    "Bye Week": "11",
    "Rank": "156",
    "Points": "110.8",
    "Risk": "3.7",
    "Upside": "3.3",
    "ADP": "24.09",
    "Outlook": "The 6th round pick had some moments in the slot as a rookie for the Buccaneers seeing 68 total targets and three scores. However, with Chris Godwin moving back into his preferred slot role and the team's selection of Jalen McMillan in the 3rd round, Palmer likely will be fighting for snaps and scraps from this team's passing pie.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Blake Corum",
    "Team": "LAR",
    "Bye Week": "6",
    "Rank": "157",
    "Points": "110.0",
    "Risk": "5.3",
    "Upside": "5.2",
    "ADP": "10.11",
    "Outlook": "The rushing TD production from college (45 the last two years) is hard to argue against and we’ve found that the stickiest of stats from college for RBs… is touchdowns. That doesn’t sound very advanced or thought-provoking but if the Rams see Corum as a bowling ball in the mold of Maurice Jones-Drew (one of the few size comps), so be it. For 2024 redraft leagues, he enters the year firmly behind Kyren Williams in our mind as an insurance policy only.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Chuba Hubbard",
    "Team": "CAR",
    "Bye Week": "11",
    "Rank": "158",
    "Points": "109.8",
    "Risk": "3.7",
    "Upside": "3.0",
    "ADP": "12.06",
    "Outlook": "Chuba came out of nowhere to wrestle away the starting job from Miles “Moneybags” Sanders and morph into a consistent fantasy RB down the stretch. From Week 12 on, he was the RB9 averaging more fantasy points per game (13.3)… than Jahmyr Gibbs (12.9) in that span. Dave Canales’ offensive approach and the team’s investment in multiple offensive guards in free agency should give you some confidence in their commitment to run the football. The 25-year-old is in the final year of his rookie contract and while he could get some early run as the veteran, the team took Jonathon Brooks 43rd overall for a reason.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "MarShawn Lloyd",
    "Team": "GB",
    "Bye Week": "10",
    "Rank": "159",
    "Points": "109.6",
    "Risk": "4.7",
    "Upside": "4.3",
    "ADP": "13.08",
    "Outlook": "Lloyd’s production profile in college was nothing special but some NFL Draft prognosticators had Lloyd as their top RB in this year’s class. He runs hard with vision and we know Matt LaFleur has preferred a two-back system since he landed in Green Bay. Consider him an insurance back to start the year with massive upside if Josh Jacobs were to miss time with injury.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Tyler Boyd",
    "Team": "TEN",
    "Bye Week": "5",
    "Rank": "160",
    "Points": "106.3",
    "Risk": "3.0",
    "Upside": "2.3",
    "ADP": "20.11",
    "Outlook": "Boyd reunites with his former OC in Cincy, Brian Callahan, who’s now the head coach in Tennessee. He’ll fill the slot role for the Titans, but unless Hopkins or Ridley suffers an injury, it probably won’t mean much for fantasy. For reference, he only had three top-36 fantasy weeks last season in Cincy and that was with Tee Higgins in and out of the lineup most of the year.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Roschon Johnson",
    "Team": "CHI",
    "Bye Week": "7",
    "Rank": "161",
    "Points": "106.3",
    "Risk": "3.3",
    "Upside": "3.3",
    "ADP": "17.01",
    "Outlook": "Roschon never really broke through in his rookie year. He was the team’s least efficient rusher yet still led the team in snaps on third down and snaps in pass protection. At this point, he’s competing with Khalil Herbert for touches on an offense that seems to have moved on without him in mind. In redraft leagues, he’s not on the radar to start the year.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Nick Chubb",
    "Team": "CLE",
    "Bye Week": "10",
    "Rank": "162",
    "Points": "102.5",
    "Risk": "8.7",
    "Upside": "5.7",
    "ADP": "8.05",
    "Outlook": "Imagine betting against Nick Chubb. He’s averaged a robust 5.3 yards per carry, the second highest ever for a RB with 1000+ carries in their career. He was a top-12 RB for four straight years before dislocating his knee in Week 2 last year. He is an outlier of a human being and yet, fantasy football is a game of probabilities. Can Chubb return from two off-season surgeries and firmly plant himself as RB1 for a Cleveland offense that desperately wants to run the ball? Yes. However, the timetable might be slower than you want for him to return to meaningful fantasy football action. The name recognition in your draft likely won’t match his early production.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Ray Davis",
    "Team": "BUF",
    "Bye Week": "12",
    "Rank": "163",
    "Points": "102.0",
    "Risk": "3.3",
    "Upside": "4.2",
    "ADP": "16.03",
    "Outlook": "While his age is unparalleled and history says you should bet against RBs this old, Davis is the type of hard-nosed runner who could steal some goal-line looks early on. This Buffalo team was running 33-year-old Latavius Murray out there last year so someone 10 years younger can certainly make a dent in fantasy rosters. Know the name, and file it away if James Cook were to go down.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Zach Ertz",
    "Team": "WAS",
    "Bye Week": "14",
    "Rank": "164",
    "Points": "101.1",
    "Risk": "7.7",
    "Upside": "4.7",
    "ADP": "22.03",
    "Outlook": "Ertz was a fantasy fixture for years…like seven years ago. He’s now 33 years old and hasn’t had a yard after the catch since Carson Wentz was his QB. No for real, look it up. In all seriousness, Ertz is a nice veteran presence for a young team and a rookie QB. He reunites with Kliff Kingsbury, who he played for in Arizona. He’s mostly there to mentor Ben Sinnott and play in a part-time role. Nothing to see here for fantasy.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "DJ Chark",
    "Team": "LAC",
    "Bye Week": "5",
    "Rank": "165",
    "Points": "100.4",
    "Risk": "3.3",
    "Upside": "3.3",
    "ADP": "21.11",
    "Outlook": "That WR16 season back in 2019 feels like years ago…because it was. Since then, Chark’s fantasy points per game has declined in five straight seasons, and now he’ll be on his fourth NFL franchise in four years. He goes to one of the most run-heavy schemes in football with the Chargers and Greg Roman. Chark's contract says he's not a lock to make the roster. If he does, he'll probably catch a couple of long bombs from Justin Herbert. Good luck trying to predict when those will happen.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Jonnu Smith",
    "Team": "MIA",
    "Bye Week": "6",
    "Rank": "166",
    "Points": "100.4",
    "Risk": "3.7",
    "Upside": "3.0",
    "ADP": "20.02",
    "Outlook": "Jonnu owes his boy Arthur Smith a great Christmas present this year. If it weren’t for Arthur bringing him to Atlanta last year to ruin Kyle Pitts’ fantasy managers lives, it’s possible he wouldn’t get this deal in free agency. Miami signed him to a two-year deal, and considering they were trotting out Durham Smythe last year, it’s certainly an upgrade for them offensively. Unfortunately for Jonnu, he has to compete with two elites in Tyreek and Waddle as well as multiple explosive options out of the backfield. Like the other non-elite TEs, Jonnu will have a handful of weeks where he can be a streamer in a good matchup, but as long as their big two are healthy, it’s tough to see targets going his way. For reference, the Dolphins were dead last in the NFL last year in target share to the TE position.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Kendrick Bourne",
    "Team": "NE",
    "Bye Week": "14",
    "Rank": "167",
    "Points": "99.8",
    "Risk": "5.3",
    "Upside": "3.3",
    "ADP": "23.11",
    "Outlook": "New England simply cannot help themselves when it comes to three-year contracts for veteran WRs…for exactly $33 million. They gave the exact same contract to Bourne, JuJu, and DeVante Parker in recent seasons. To Bourne’s credit, at least he was actually good on the field before tearing his ACL. Quietly fantasy’s WR27 on the back of 55(!) targets prior to his injury last season, Bourne is on the radar as a sleeper for super deep leagues.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Michael Mayer",
    "Team": "LV",
    "Bye Week": "10",
    "Rank": "168",
    "Points": "98.2",
    "Risk": "4.0",
    "Upside": "4.3",
    "ADP": "22.02",
    "Outlook": "Mayer was a highly coveted prospect coming out of school then, like most rookies not named Sam LaPorta, did jack squat in year one. His outlook for fantasy after Bowers was added to the squad is well…non-existent. Perhaps if Bowers were to go down Mayer could be a waiver streamer.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Kalif Raymond",
    "Team": "DET",
    "Bye Week": "5",
    "Rank": "169",
    "Points": "97.9",
    "Risk": "3.3",
    "Upside": "3.0",
    "ADP": "57.11",
    "Outlook": "Josh Reynolds is now in Denver, so in theory, Raymond has a path to snaps in this Lions offense. At best, though, Raymond will operate as the WR3, which usually doesn’t mean much in an offense that heavily features their TE and one of the best pass-catching backs in the league in Jahmyr Gibbs. We’re not expecting much.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Troy Franklin",
    "Team": "DEN",
    "Bye Week": "14",
    "Rank": "170",
    "Points": "96.6",
    "Risk": "6.7",
    "Upside": "4.7",
    "ADP": "13.01",
    "Outlook": "The competition for playing time in year one: Courtland Sutton, Marvin Mims, Josh Reynolds, Fireball Jones (Tim Patrick) off a torn Achilles. It’s really not hard to see the path here for a talented prospect who produced at a high level in college. He slid a bit in the NFL Draft, but there’s a good chance that keeps his ADP in check. He is a really fun late-round flier in fantasy this year. As long as the opportunity cost is low, we’re fine adding Franklin to your bench with the hopes that he emerges in an ambiguous WR room.  Be willing to cut him and move on if he duds early and wave your arms saying, “Move along! Nothing to see here!”",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Jalen McMillan",
    "Team": "TB",
    "Bye Week": "11",
    "Rank": "171",
    "Points": "95.9",
    "Risk": "5.3",
    "Upside": "3.3",
    "ADP": "20.05",
    "Outlook": "We know it’ll be the Evans and Godwin show in Tampa, but that WR3 role is up for grabs. After the team used a third-round pick on the former Husky, we think he’s got a good chance to beat out Trey Palmer for that job. If he does, he could have a few weeks as a streaming candidate off the waiver wire.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "J.K. Dobbins",
    "Team": "LAC",
    "Bye Week": "5",
    "Rank": "172",
    "Points": "95.9",
    "Risk": "9.3",
    "Upside": "5.2",
    "ADP": "12.11",
    "Outlook": "It’s a painful process remembering the ups-and-downs of Dobbins’ career thus far. Last year he looked on track early in Week 1 before a devastating Achilles injury. He reunites with OC Greg Roman on a Chargers team that has made it quite clear they want to run the ball until they’re blue in the face. Gus Edwards was never viewed as the only RB in town with Roman in Baltimore and with Austin Ekeler and Joshua Kelley vacating a combined 360 carries in this backfield, Dobbins can slowly work his way into double-digit touches. Given his injury history, it's unlikely Dobbins returns to the form we saw early in his career.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Tyrone Tracy Jr.",
    "Team": "NYG",
    "Bye Week": "11",
    "Rank": "173",
    "Points": "94.2",
    "Risk": "6.0",
    "Upside": "5.5",
    "ADP": "16.01",
    "Outlook": "There is some intrigue here as the former college WR at Iowa converted to RB at Purdue. Before you have visions of Antonio Gibson, Tracy is extremely old (24) playing 6(!) total seasons in college and his day three draft capital says he will have a hard time carving out a valuable role for fantasy.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Josh Reynolds",
    "Team": "DEN",
    "Bye Week": "14",
    "Rank": "174",
    "Points": "94.0",
    "Risk": "3.7",
    "Upside": "2.7",
    "ADP": "24.06",
    "Outlook": "Reynolds has been able to stick around the NFL as a WR3/4 for NFL teams for years. In fact, he is entering Year 8 in the NFL, which means we know what he is by now - a potential waiver wire pickup in the event of an injury on the depth chart and probably nothing more.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Malachi Corley",
    "Team": "NYJ",
    "Bye Week": "12",
    "Rank": "175",
    "Points": "93.5",
    "Risk": "5.3",
    "Upside": "4.7",
    "ADP": "16.06",
    "Outlook": "Corley was taken in the third round by Gang Green, and he profiles as the starting slot WR right away. For fantasy, that will probably cap his upside if he’s not out there in 2WR sets. Expect somewhat of a slow start for the rookie, but there’s room to grow if things click.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Mike Gesicki",
    "Team": "CIN",
    "Bye Week": "12",
    "Rank": "176",
    "Points": "93.0",
    "Risk": "3.7",
    "Upside": "4.0",
    "ADP": "20.03",
    "Outlook": "Thank goodness Gesicki landed in Cincy with Ja’Marr Chase. Have you seen this dude’s griddy?! It is…not great. Gesicki flashed some upside in Miami early in his career, but now he’s bouncing around the league on one-year contracts. Sure, he could pop up for a few streamable weeks throughout the year, but this feels like Irv Smith Jr. all over again. Gesicki is coming off his lowest target count, yardage total, and fantasy points since his rookie year.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "D'Onta Foreman",
    "Team": "CLE",
    "Bye Week": "10",
    "Rank": "177",
    "Points": "92.2",
    "Risk": "3.3",
    "Upside": "3.7",
    "ADP": "21.08",
    "Outlook": "Every year Foreman creeps into the fantasy scene as a one-man wrecking crew… for about two games. He has seven games of 15+ fantasy points over the last three years which also happens to be as many as Javonte Williams. Foreman needs the seas to part for a bigger workload in Cleveland but he’s always lurking to take over a game or two.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Greg Dulcich",
    "Team": "DEN",
    "Bye Week": "14",
    "Rank": "178",
    "Points": "91.1",
    "Risk": "6.3",
    "Upside": "6.3",
    "ADP": "21.05",
    "Outlook": "With just two games played last year, you probably forgot Greg D existed in 2023. Welp, the Broncos decided to not address the position in the NFL Draft (despite strong Brock Bowers vibes) and instead are rolling with blocking TE Adam Trautman and Greg Dulcich aka the Mustache ManiYAC. He can create after the catch on an offense that desperately needs playmakers. He’s not draft-worthy with a rookie QB under center but keep an eye out for Dulcich to potentially become a streamer.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Khalil Herbert",
    "Team": "CHI",
    "Bye Week": "7",
    "Rank": "179",
    "Points": "90.8",
    "Risk": "3.3",
    "Upside": "2.7",
    "ADP": "17.03",
    "Outlook": "It was a good little run for the former 5th round pick. Over the last three years, he ranks seventh among all running backs in yards per carry (4.9 YPC) and 10th in 15+ yard rush rate (12.0%). However, the Bears made it clear with their actions they wanted an upgrade bringing in D’Andre Swift with a multi-year deal. Herbert is a late round flier at the RB position who likely will still be competing with Roschon Johnson for touches if something were to happen to Swift.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Kenneth Gainwell",
    "Team": "PHI",
    "Bye Week": "5",
    "Rank": "180",
    "Points": "90.8",
    "Risk": "3.0",
    "Upside": "2.7",
    "ADP": "24.01",
    "Outlook": "The latest and greatest hits from Kenny G are as unpredictable as they come in year four. One week he can give you FLEX worthy production and the next he’s just chilling on the sidelines. He takes a major backseat with Saquon Barkley in town.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Daniel Bellinger",
    "Team": "NYG",
    "Bye Week": "11",
    "Rank": "181",
    "Points": "89.7",
    "Risk": "3.7",
    "Upside": "2.5",
    "ADP": "23.08",
    "Outlook": "With Darren Waller contemplating retirement, Daniel Bellinger looks to be the Giants starting TE for 2024. Unfortunately, that likely won't equate to much fantasy production beyond a matchup dependent streamer.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Jalen Tolbert",
    "Team": "DAL",
    "Bye Week": "7",
    "Rank": "182",
    "Points": "88.8",
    "Risk": "4.7",
    "Upside": "2.3",
    "ADP": "23.02",
    "Outlook": "On paper, Tolbert projects as the WR3 in Dallas to start the year. Unfortunately, we’re not really sure how good he is at football. He was selected in the third round of the NFL Draft back in 2022, and in two years gathered just 39 total targets. He is not really a guy we’re drafting, but worth monitoring given that Cooks is turning 31 later this year, and no one behind him on the depth chart scares you.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Devontez Walker",
    "Team": "BAL",
    "Bye Week": "14",
    "Rank": "183",
    "Points": "84.0",
    "Risk": "5.0",
    "Upside": "4.7",
    "ADP": "20.09",
    "Outlook": "Not worth drafting in redraft leagues, Walker is likely to start the season as the WR4/5 on the Baltimore depth chart. With Lamar’s rushing ability and Derrick Henry pounding the rock at the goal line, call us crazy, but we’re not really targeting depth pieces in this Ravens passing game.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Clyde Edwards-Helaire",
    "Team": "KC",
    "Bye Week": "6",
    "Rank": "184",
    "Points": "82.2",
    "Risk": "3.7",
    "Upside": "2.7",
    "ADP": "19.05",
    "Outlook": "Once the hand-picked 1st round pick of Mahomes, the team did bring CEH back for another year for what feels like pity. He had only three relevant fantasy weeks where he saw more than seven opportunities and you can expect much of the same behind Isiah Pacheco this year.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Jonathan Mingo",
    "Team": "CAR",
    "Bye Week": "11",
    "Rank": "185",
    "Points": "81.9",
    "Risk": "5.3",
    "Upside": "4.0",
    "ADP": "26.09",
    "Outlook": "Mingo averaged an abysmal 0.78 yards per route run as a rookie. Buzz, your girlfriend…WOOF! Anything below 1 YPRR is a recipe for failure at the NFL level. This current Carolina regime didn’t draft him, and immediately after the season was over, they traded for Diontae Johnson then drafted Xavier Legette in round one. That tells you all you need to know.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "A.T. Perry",
    "Team": "NO",
    "Bye Week": "12",
    "Rank": "186",
    "Points": "80.3",
    "Risk": "3.3",
    "Upside": "2.3",
    "ADP": "24.03",
    "Outlook": "Here’s a fun fact for you to share with your league-mates at your upcoming draft:  According to NextGenStats, AT Perry led all WRs in QB passer rating when targeted. While that little factoid with an incredibly small sample size is technically true, it does not mean he’ll be relevant for fantasy moving forward. Perry is at best the WR3 in New Orleans to enter the year and was not a highly coveted prospect coming out of school.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Tyler Higbee",
    "Team": "LAR",
    "Bye Week": "6",
    "Rank": "187",
    "Points": "79.5",
    "Risk": "6.0",
    "Upside": "4.0",
    "ADP": "25.12",
    "Outlook": "Higbee took a brutal hit to his knee in the playoffs, tearing his ACL in the process. Because of the timeline, we’re not expecting him to be 100% until late in the year, so it makes sense to look elsewhere in fantasy drafts. He’s a PUP candidate.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Kimani Vidal",
    "Team": "LAC",
    "Bye Week": "5",
    "Rank": "188",
    "Points": "79.4",
    "Risk": "5.5",
    "Upside": "4.3",
    "ADP": "15.05",
    "Outlook": "Vidal is gaining steam this off-season as a threat to gain touches in the Chargers backfield. At the NFL Combine, he ran 4.46, which gives him the size/speed combo we’re looking for if we’re going to throw some darts at later-round RBs. 6th round guys rarely pay off but the scheme is what we mostly are keying in on. Know the name and listen to the camp reports this summer to see if Vidal moves up the depth chart.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Dameon Pierce",
    "Team": "HOU",
    "Bye Week": "14",
    "Rank": "189",
    "Points": "78.5",
    "Risk": "3.3",
    "Upside": "3.3",
    "ADP": "19.01",
    "Outlook": "If you are bored, ask AI to make sense of Dameon Pierce. From heralded rookie to hyped sophomore, he now is a name at your draft you’ll wholeheartedly laugh about. The Texans moved on from him during the 2023 season, passing the rock to Devin Singletary before emphatically dunking on Pierce in the off-season by trading for veteran Joe Mixon and signing him to a three-year deal. His involvement in the game plan should be minimal as the meetings for Pierce truthers are currently on hiatus.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Isaiah Likely",
    "Team": "BAL",
    "Bye Week": "14",
    "Rank": "190",
    "Points": "77.9",
    "Risk": "4.7",
    "Upside": "5.7",
    "ADP": "15.09",
    "Outlook": "There is probably not a better “TE insurance policy” out there than Mr. Likely. You can’t really draft him with Andrews healthy, but he’s shown he can be a TE1 for fantasy whenever Andrews misses time. In nine career games without Andrews, Likely has averaged 12.5 PPR points per game. If Andrews gets injured this season, run, don't walk to your waiver wire.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Jelani Woods",
    "Team": "IND",
    "Bye Week": "14",
    "Rank": "191",
    "Points": "77.6",
    "Risk": "4.0",
    "Upside": "4.0",
    "ADP": "20.08",
    "Outlook": "Woods missed the entire 2023 season due to recurring hamstring injuries, but he was an intriguing prospect after his rookie year. At 6’7” and over 250 lbs., this guy is a monster…dare we say Gigantor 2.0? He’s got the athletic profile (4.61 in the forty) that says it could work for fantasy in the right situation. Unfortunately, this does not look like that situation, especially with Kylen Granson still sticking around. This is likely a TE competition in camp.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Miles Sanders",
    "Team": "CAR",
    "Bye Week": "11",
    "Rank": "192",
    "Points": "75.7",
    "Risk": "5.0",
    "Upside": "3.0",
    "ADP": "24.09",
    "Outlook": "Hold the bag… you might be reaching for a barf bag but let’s talk about the bag of cash the Carolina Panthers gave Sanders just one year ago. The 4-year deal with $13 million guaranteed was supposed to dictate them handing him the rock, but after just one TD through the first month and a shoulder injury in Week 5, he sat behind Chuba Hubbard and averaged less than 30 total yards per game for the rest of the year. The 27-year-old RB finds himself buried on the depth chart and out of favor with a new coaching regime.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Davis Allen",
    "Team": "LAR",
    "Bye Week": "6",
    "Rank": "193",
    "Points": "74.9",
    "Risk": "3.3",
    "Upside": "4.3",
    "ADP": "43.06",
    "Outlook": "The 5th round pick filled in for injured Tyler Higbee down the stretch including a 4/50/1 week against Baltimore. With Higbee likely out for the first half of the season, Allen will be competing with free agent acquisition Colby Parkinson for playing time. Allen is the more explosive player although Parkinson did secure the most guaranteed money of any free agent TE this off-season.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Treylon Burks",
    "Team": "TEN",
    "Bye Week": "5",
    "Rank": "194",
    "Points": "73.0",
    "Risk": "3.5",
    "Upside": "2.0",
    "ADP": "24.07",
    "Outlook": "This current coaching staff and regime did not draft Treylon. So, if they believed he could be a starter, they probably wouldn’t have paid through the roof for Ridley and brought in Tyler Boyd to man the slot. Pour one out….",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Luke McCaffrey",
    "Team": "WAS",
    "Bye Week": "14",
    "Rank": "195",
    "Points": "71.3",
    "Risk": "5.3",
    "Upside": "3.7",
    "ADP": "17.05",
    "Outlook": "Does that last name look familiar? It should! CMC’s younger brother, Luke, is still developing as a WR. He began his college career at Nebraska as a QB then transferred to Rice and made the switch to WR in 2022. So in reality, this guy has only been playing WR for two years, and he was still drafted in the third round - impressive!. He played over 70% of his snaps from the slot in college, which works out nicely after Washington lost Curtis Samuel this offseason. Unfortunately, Jayden Daniels should run a lot leading to a less than fortunate outlook in Year 1. McCaffrey is a name worth monitoring to see if he’s earning starter reps.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Ben Sinnott",
    "Team": "WAS",
    "Bye Week": "14",
    "Rank": "196",
    "Points": "71.2",
    "Risk": "7.0",
    "Upside": "5.0",
    "ADP": "13.05",
    "Outlook": "If you’ve tuned into the Dynasty Podcast, you know the Senator is one of our favorite prospects this season. As for redraft leagues, however, we do need to be mindful that Sam LaPorta just set some unreal standards. No, rookie TEs won’t automatically start producing elite seasons, but the opportunity is absolutely there. In theory, his only competition for playing time in year one is 33-year-old Zach Ertz. We like his overall profile and the draft capital is there. We wouldn’t recommend drafting him to be your starter in 12-team leagues, but he’s a really interesting name to monitor in camp to see if he’s running with the ones.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Samaje Perine",
    "Team": "DEN",
    "Bye Week": "14",
    "Rank": "197",
    "Points": "71.0",
    "Risk": "4.3",
    "Upside": "1.7",
    "ADP": "25.12",
    "Outlook": "You wouldn’t know it but Perine caught 50 passes last year as the do-it-all back for the Broncos. He was mostly utilized on third downs, spelling Javonte Williams and mixing in with Jaleel McLaughlin. This is a crowded backfield with 5th rounder Audric Estimé now in town. He holds no stand alone fantasy value yet it wouldn’t be surprising if he steals 7+ touches per game.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Tank Bigsby",
    "Team": "JAX",
    "Bye Week": "12",
    "Rank": "198",
    "Points": "69.9",
    "Risk": "5.0",
    "Upside": "2.3",
    "ADP": "20.11",
    "Outlook": "The Jags used a third round pick on Tank Bigsby last year...to only give him 50 total carries on the year. He had the lowest rush success rate among qualifying RBs and caught exactly one more pass than your grandmother. Perhaps he pops up as a waiver add at some point if Etienne misses time but it was an abysmal rookie year for a player we thought would have a bigger impact.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Dawson Knox",
    "Team": "BUF",
    "Bye Week": "12",
    "Rank": "199",
    "Points": "69.2",
    "Risk": "3.7",
    "Upside": "2.3",
    "ADP": "21.12",
    "Outlook": "Knox popped off for a career year in 2021 when he finished as the TE8. His volume and yardage remained stable in 2022, but he caught three fewer TDs, finishing as the TE14. It just shows how little difference there is between the TE8 and TE15 in fantasy. With the presence of rookie Dalton Kincaid, Knox won’t be a difference-maker in 2023 fantasy circles. In fact, both could cannibalize each other’s usable weeks thanks to how often Buffalo should find themselves in the red zone.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Braelon Allen",
    "Team": "NYJ",
    "Bye Week": "12",
    "Rank": "200",
    "Points": "68.4",
    "Risk": "4.0",
    "Upside": "3.7",
    "ADP": "16.09",
    "Outlook": "If you played in college fantasy football (also known as devy), Allen looked like the next big thing. The mammoth man child (6’1”, 235 lbs.) crushed at Wisconsin as a freshman and now will be the first RB ever to play his entire rookie season before 21. Oh, but there’s just one small problem: he’ll be stuck behind Breece Hall. With a slingshot and a stone plucked from the river, Allen’s day three draft capital struck down any giant-sized dreams fantasy managers might’ve had for the rookie.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Hayden Hurst",
    "Team": "LAC",
    "Bye Week": "5",
    "Rank": "201",
    "Points": "68.1",
    "Risk": "3.0",
    "Upside": "3.0",
    "ADP": "23.04",
    "Outlook": "Hurst couldn’t get anything going last year in Carolina (I mean, who did right?). He unfortunately had a scary concussion that lasted several weeks and ended his year early. We’re just happy he’s cleared and healthy entering 2024. On paper, he profiles as the better pass-catching TE option in this offense, but that still doesn’t mean he’s fantasy viable.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Kylen Granson",
    "Team": "IND",
    "Bye Week": "14",
    "Rank": "202",
    "Points": "62.6",
    "Risk": "3.3",
    "Upside": "3.0",
    "ADP": "46.02",
    "Outlook": "Ever since Jack “Baby Hands” Doyle was the TE in Indy, it feels like we’ve been trying to find the one that can crack our fantasy lineups. Unfortunately, outside of a random Gigantor (Mo Alie-Cox if you’re new here) TD, it’s been a complete crapshoot. Granson is entering year four in the league and coming off a season where he never played more than 65% of the snaps in a game. With this talented WR room and an elite rushing QB, there is just not much left here in terms of opportunity for the Indy TEs.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Tucker Kraft",
    "Team": "GB",
    "Bye Week": "10",
    "Rank": "203",
    "Points": "59.3",
    "Risk": "3.3",
    "Upside": "3.3",
    "ADP": "21.03",
    "Outlook": "When Musgrave went down due to injury later in the year, the offense didn’t skip a beat as they seem to have hit on both rookie TEs from a year ago. Kraft earned a 14.5% target share in his starts and flashed some run after the catch ability with a solid 7.1 YAC/reception. Those numbers at least signal Kraft will earn playing time, but unfortunately, this offense is quite crowded with playmakers. He probably needs a Musgrave injury to really have a fantasy-relevant role. No need to draft him right now.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Theo Johnson",
    "Team": "NYG",
    "Bye Week": "11",
    "Rank": "204",
    "Points": "58.9",
    "Risk": "4.0",
    "Upside": "4.0",
    "ADP": "19.11",
    "Outlook": "The Giants could have a hole to fill at TE if the Wallerus decides to hang ‘em up. However, he doesn't have much of a college production profile that says he’ll capitalize on the opportunity in what projects to be a bottom-ten offense. In college, he averaged just 1.26 yards per route run. In our database, the only TEs to go on to have a top-10 fantasy season in their career with a YPRR rate in college that was less than 1.40 were Dawson Knox and Dalton Schultz. So yeah, keep your expectations in check.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Tommy Tremble",
    "Team": "CAR",
    "Bye Week": "11",
    "Rank": "205",
    "Points": "54.4",
    "Risk": "3.5",
    "Upside": "2.0",
    "ADP": "58.09",
    "Outlook": "Tommy Tremble has been in the NFL for three years. He’s averaged a game-breaking 2.6 fantasy points per game. Nah dawg…",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Ja'Tavion Sanders",
    "Team": "CAR",
    "Bye Week": "11",
    "Rank": "206",
    "Points": "53.5",
    "Risk": "3.0",
    "Upside": "4.0",
    "ADP": "17.04",
    "Outlook": "Sanders landed on a wide-open depth chart in Carolina. He could easily earn the TE1 job right away in Week 1, but it may not matter for fantasy. We know rookie TEs generally don’t get off to a fast start, and Bryce Young didn’t put a lot of good moments on tape last year. He’s probably not worth drafting, but perhaps he can turn into a streaming candidate late in the year as he develops.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Evan Hull",
    "Team": "IND",
    "Bye Week": "14",
    "Rank": "207",
    "Points": "52.9",
    "Risk": "4.3",
    "Upside": "3.0",
    "ADP": "26.12",
    "Outlook": "Do you remember Evan Hull’s rookie year? He saw two opportunities in Week 1 before suffering a season-ending meniscus injury. He is an able pass-catcher and could mix in some third downs while backing up Jonathan Taylor. Regardless, he is not roster worthy in redraft leagues to start the year.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Elijah Mitchell",
    "Team": "SF",
    "Bye Week": "9",
    "Rank": "208",
    "Points": "52.2",
    "Risk": "4.7",
    "Upside": "5.3",
    "ADP": "16.09",
    "Outlook": "The “Missile” finished the year out for a banged-up Christian McCaffrey with two rushing TDs in the final two weeks as the team prepared for their playoff run. He surpassed four opportunities just four times previously and remains just another 49ers RB in Kyle Shanahan’s armory. The drafting of Isaac Guerendo in the 4th round brings more competition to a depth chart that is truly hidden behind CMC.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Chase Edmonds",
    "Team": "TB",
    "Bye Week": "11",
    "Rank": "209",
    "Points": "51.4",
    "Risk": "3.7",
    "Upside": "1.7",
    "ADP": "48.07",
    "Outlook": "The 28 year old signed a one-year deal with $825,000 guaranteed to simply take up space and wear an NFL jersey. Sitting firmly behind Rachaad White and competing with rookie Bucky Irving, Edmonds is a depth piece who missed his window of opportunity years ago on Miami. Remember that fun off-season?",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Bucky Irving",
    "Team": "TB",
    "Bye Week": "11",
    "Rank": "210",
    "Points": "51.1",
    "Risk": "4.0",
    "Upside": "2.7",
    "ADP": "16.11",
    "Outlook": "Pass-catching whiz Bucky Irving was selected in Round 4 as one of only two RBs in FBS to collect 50+ passes last year. He is tiny (5’9”, 192) so expecting him to take over the entire backfield if Rachaad White were injured is a bit of a leap. In full PPR leagues, take note but he still should not be on the redraft radar.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Javon Baker",
    "Team": "NE",
    "Bye Week": "14",
    "Rank": "211",
    "Points": "47.7",
    "Risk": "7.0",
    "Upside": "4.2",
    "ADP": "19.11",
    "Outlook": "The Pats are in the middle of a full rebuild, so they doubled up in the NFL Draft at wide receiver, pairing Baker with Polk. In theory, he could have a path to a starting job on the perimeter, but a lot will have to go right for that to mean anything in fantasy. For now, he’s a name to monitor this summer. He could be a guy who pops late in the year.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "JuJu Smith-Schuster",
    "Team": "NE",
    "Bye Week": "14",
    "Rank": "212",
    "Points": "43.2",
    "Risk": "6.0",
    "Upside": "2.0",
    "ADP": "57.05",
    "Outlook": "The drop-off in play from Smith-Schuster over the last three years has been quite sad. Does this guy even find the field in 2WR sets? And if he does, does it even matter? Probably not. Hey, we’ll always have those Pittsburgh days!",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Jamaal Williams",
    "Team": "NO",
    "Bye Week": "12",
    "Rank": "213",
    "Points": "41.9",
    "Risk": "3.3",
    "Upside": "2.0",
    "ADP": "26.07",
    "Outlook": "Jamaal is off the redraft radar for most leagues in 2024.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Jaylen Wright",
    "Team": "MIA",
    "Bye Week": "6",
    "Rank": "214",
    "Points": "41.6",
    "Risk": "5.0",
    "Upside": "4.3",
    "ADP": "12.03",
    "Outlook": "Wright was the fifth RB taken in the NFL Draft as HC Mike McDaniel made it abundantly clear what this team wants: speed, speed, speed. It is a crowded backfield behind Raheem Mostert and De’Von Achane but as we’ve seen with this team, they are willing to hand the rock to whoever is able bodied. Wright showed out at the NFL Combine, solidifying what we saw on his college tape: a RB who can create big plays thanks to his explosiveness and speed. He will have to earn his stripes as he begins the year as nothing more than a speculative dart throw in redraft leagues.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Eric Gray",
    "Team": "NYG",
    "Bye Week": "11",
    "Rank": "215",
    "Points": "41.3",
    "Risk": "3.0",
    "Upside": "2.0",
    "ADP": "25.09",
    "Outlook": "Gray will be competing with rookie Tyrone Tracy Jr. for backfield touches behind free agent signee Devin Singletary. Gray does have the size to make some noise in the red zone but this Giants team also might never make it to that point of the field. He saw just 17 carries as a rookie last year so there isn't much to go off of at this point.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Will Dissly",
    "Team": "LAC",
    "Bye Week": "5",
    "Rank": "216",
    "Points": "40.7",
    "Risk": "3.0",
    "Upside": "1.7",
    "ADP": "54.06",
    "Outlook": "Big Montana lives! This guy just keeps getting paid, which honestly is great for our show. I mean who doesn’t love the Big Montana drop?! For fantasy, Dissly could catch a couple of TDs but let’s be real, he’s in LA to block.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Keaton Mitchell",
    "Team": "BAL",
    "Bye Week": "14",
    "Rank": "217",
    "Points": "36.7",
    "Risk": "6.0",
    "Upside": "3.7",
    "ADP": "19.09",
    "Outlook": "He burned too bright! Mitchell led all NFL RBs in yards after contact per attempt and ranked 2nd in fantasy points per opportunity. He did not register a carry until Week 9 and had a season-ending knee injury in Week 14… YET, he has more total 20+ yard runs over the last three years than Alvin Kamara. However, the combination of him being undrafted + his ACL injury is not a good forecast for his future. He will likely start the 2024 season on the PUP and isn't worth rostering with Derrick Henry in town.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Isaac Guerendo",
    "Team": "SF",
    "Bye Week": "9",
    "Rank": "218",
    "Points": "13.1",
    "Risk": "3.0",
    "Upside": "6.0",
    "ADP": "21.05",
    "Outlook": "Guerendo's production profile leaves a lot to be desired, but he turned heads at the Combine. In case you forgot, Guerendo ran the fastest 40-yard dash of any 220+ pound RB since 2003. Know the name and the situation but apart from a CMC injury (dear God no!), he likely should be hanging out on waiver wires.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  }
]