[
  {
    "Name": "Josh Allen",
    "Team": "BUF",
    "Bye Week": "12",
    "Rank": "1",
    "Points": "351.7",
    "Risk": "2.7",
    "Upside": "9.7",
    "ADP": "2.10",
    "Tier": "1",
    "Outlook": "He is a fantasy force ranking #1 in fantasy points per game among QBs for four years in a row. His 15 rushing scores tied Jalen Hurts for the most ever by a QB in a season and in just 94 career games, he sits second all-time behind only Cam Newton. Despite his lowest passing yards per game (253.3) since 2019 and highest INT rate since his rookie year, Allen still combined for 44 total TDs. He’s a machine and in SuperFlex leagues, call us crazy…but he’s our 1.01. In 1QB leagues, it’s tough paying that early price unless you want to set-it and forget-it.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Jalen Hurts",
    "Team": "PHI",
    "Bye Week": "5",
    "Rank": "2",
    "Points": "346.9",
    "Risk": "2.3",
    "Upside": "9.7",
    "ADP": "3.09",
    "Tier": "1",
    "Outlook": "While the Eagles end of season result was a dumpster fire, Hurts was as good as advertised for fantasy. His 14 top-12 finishes led all QBs and the rushing TDs are nothing short of automatic. He already ranks fifth all-time in rushing TDs in just 62 career games thanks to 87(!) red zone rush attempts over the last two years. As a passer, he regressed in a few areas highlighted by a career-high 15 INTs. New OC Kellen Moore is a breath of fresh air and you could see a return to Hurts’ passing efficiency numbers. He is the man and his tush will still be pushed even if Jason Kelce is no longer in the huddle.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Patrick Mahomes",
    "Team": "KC",
    "Bye Week": "6",
    "Rank": "3",
    "Points": "334.0",
    "Risk": "4.3",
    "Upside": "9.3",
    "ADP": "3.12",
    "Tier": "2",
    "Outlook": "It doesn’t get much better than back-to-back Super Bowl MVPs. Ok, actually for fantasy, we do have a few concerns Mr. Mahomes. It was a tale of two seasons as he was the QB3 through nine weeks before adding just one more top-12 weekly finish the rest of the season. He averaged just 1.4 passing TDs per game in that second half span as the Chiefs morphed into a team leaning on their defense and the KC ground attack. He completed just one passing TD of 20+ air yards all season long as Andy Reid beat heavy zone schemes with underneath and mesh concepts. His TD rates have always been a red light/green light situation so 2024 could give us a return to the league-winning fantasy QB if he hits 6+ percent. The addition of rookie speedster Xavier Worthy neutralizes the impending suspension of Rashee Rice, but the Mahomes magic still comes down to the mind meld he has with Travis Kelce. If Kelce remains the same, Mahomes can dink-and-dunk his way to countless red zone TDs and return top-five numbers yet again. His draft cost isn’t nearly as expensive as previous years, making a KC stack at least more palatable a price to pay than in years before.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Lamar Jackson",
    "Team": "BAL",
    "Bye Week": "14",
    "Rank": "4",
    "Points": "333.3",
    "Risk": "4.2",
    "Upside": "8.3",
    "ADP": "4.04",
    "Tier": "2",
    "Outlook": "Lamar responded to critics and put up his second MVP season, setting career-highs in starts (16), completion percentage (67%), yards per attempt (8.0), and ranking #1 in fantasy points per dropback among all QBs. While he didn’t see as many designed runs in this Todd Monken offensive system, it was an all-around impressive season despite the Ravens succumbing to yet another AFC playoff exit. He’s a bit more volatile week-to-week as a fantasy QB than you might think but when you run like he does, he’s still elite in our minds.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Anthony Richardson",
    "Team": "IND",
    "Bye Week": "14",
    "Rank": "5",
    "Points": "320.7",
    "Risk": "7.0",
    "Upside": "9.3",
    "ADP": "5.11",
    "Tier": "3",
    "Outlook": "It was only four games and he technically couldn’t finish three of them, but Richardson showcased the kind of fantasy upside we dream of, leading all QBs in fantasy points per dropback before going down with a season-ending injury. In two of those starts, he was the QB4 & QB2, rushing 10 times in each of those. That is essentially a Jalen Hurts-esque impact as a runner. The combination of Richardson's raw athletic tools and HC Shane Steichen’s up-tempo pace is a match made in fantasy heaven. We had similar small sample size windows for recent rookie QBs (Lamar Jackson & Hurts) who struggled as passers but broke fantasy scoring the following year.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Kyler Murray",
    "Team": "ARI",
    "Bye Week": "11",
    "Rank": "6",
    "Points": "316.2",
    "Risk": "4.3",
    "Upside": "7.8",
    "ADP": "7.11",
    "Tier": "3",
    "Outlook": "After returning from injury in Week 10, Kyler was the QB9 in fantasy points per game as a solid contributor on an offense that lacked any elite pass-catchers besides Trey McBride. Add in No. 4 overall pick Marvin Harrison Jr. and you can outline the makings of an elite fantasy season albeit at a cheaper draft price than other QBs. Say what you want about Kyler, but when he is on an NFL field as the starter, he's averaging 20.3 fantasy points per game and 38 rushing yards.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Dak Prescott",
    "Team": "DAL",
    "Bye Week": "7",
    "Rank": "7",
    "Points": "313.9",
    "Risk": "4.3",
    "Upside": "7.7",
    "ADP": "7.03",
    "Tier": "3",
    "Outlook": "Someone gave Dak a pep talk after Week 5 as the Cowboys passing game turned on the nitro boost. He averaged 288 passing yards and 2.6 passing TDs as the QB1 the rest of the way, including seven finishes inside the top-three. All the fears of Mike McCarthy turning this team into a ground-and-pound menace proved untrue as the Dak/CeeDee combo won managers fantasy championships. While his splits against bottom-16 defenses (+6.66 fantasy points) is not a good sign on both biblical and regressional levels, he remains undervalued in drafts in 2024. Believe in this team’s success in the passing game and your ability to wait on QB to snag Dak after loading up at RB & WR early in your drafts.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Joe Burrow",
    "Team": "CIN",
    "Bye Week": "12",
    "Rank": "8",
    "Points": "308.2",
    "Risk": "5.0",
    "Upside": "7.8",
    "ADP": "6.05",
    "Tier": "3",
    "Outlook": "Burrow started the first month of the season slowly with just two passing passing TDs and limited mobility (calf) before catching fire with 12 passing TDs over the next five games and a league-leading 74% completion rate. He failed to finish out the season with a wrist injury in Week 11, and the Bengals plummeted to 4th place in the AFC North. He should benefit from a cupcake schedule and the team’s renewed investment in the offensive line. Burrow lives and dies by his TD rate as his rushing production will never quite match the other elites. Expect 4200+ passing yards but if he fails to hit 30 passing TDs, you might consider him not worthy of his 7th round draft cost in 1QB leagues.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "C.J. Stroud",
    "Team": "HOU",
    "Bye Week": "14",
    "Rank": "9",
    "Points": "306.7",
    "Risk": "4.3",
    "Upside": "7.5",
    "ADP": "4.07",
    "Tier": "3",
    "Outlook": "How good was Stroud last year?  He averaged the highest yards per attempt (8.2) ever for a rookie QB and became the first one ever to support multiple top-15 WRs (Nico Collins & Tank Dell) in points per game. Texans fever was palpable last year, and the hype has carried over into the off-season with the additions of veterans Stefon Diggs and Joe Mixon. This also inflated Stroud’s ADP to the point where you need him to have another outlier season especially in the TD department. We love Stroud the player but fantasy football is a game about opportunity cost. In SuperFlex leagues, we have him ranked a tier below other QBs who are being drafted after him.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Jordan Love",
    "Team": "GB",
    "Bye Week": "10",
    "Rank": "10",
    "Points": "303.2",
    "Risk": "4.7",
    "Upside": "7.7",
    "ADP": "8.02",
    "Tier": "4",
    "Outlook": "Green Bay, by golly you’ve done it again! Love was a revelation last year as a high floor fantasy option with 11 weeks inside the top-12 (3rd among all QBs) while coming in second in passing TDs, red zone pass attempts, and air yards. The second half of the season showed his ceiling with an insane 68% completion rate while he was on pace for 4,600 yards, 38 touchdowns, and only five INTs. The young Green Bay offense has a bevy of weapons, and we trust Matt LaFleur as a creative play-caller. While TD rates often fluctuate year-to-year, we’re talking about a potential league winner who is being drafted at his floor.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Jayden Daniels",
    "Team": "WAS",
    "Bye Week": "14",
    "Rank": "11",
    "Points": "293.6",
    "Risk": "5.7",
    "Upside": "7.5",
    "ADP": "10.05",
    "Tier": "4",
    "Outlook": "It was a meteoric rise for Daniels winning the 2023 Heisman, re-writing a number of NCAA records, and vaulting up draft boards to No. 2 overall to the Commanders. New OC Kliff Kingsbury has experience with mobile QBs and he will have his work cut out for him with a Washington offense that led the NFL in pass attempts, yet failed to contribute high-end fantasy options across the board. The headlines for Daniels’ fantasy football outlook is the deep ball accuracy along with the video game rushing numbers. He had 43% of LSU’s rushing yards in 2023, which was the 3rd highest percentage ever for a 1st round QB. That kind of rushing production is rare and provides a wild boost to his fantasy contributions even in year one. If you want to swing away in your drafts thinking you get some RG3-type lightning in a bottle right from the get-go, we understand.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Brock Purdy",
    "Team": "SF",
    "Bye Week": "9",
    "Rank": "12",
    "Points": "291.6",
    "Risk": "3.3",
    "Upside": "6.7",
    "ADP": "9.04",
    "Tier": "4",
    "Outlook": "He had the MVP award in his hands averaging 23.3 FPPG and 2.8 passing TDs in the six weeks leading up to the Baltimore game. Regardless of that debacle, he finished third in passing TDs, third in fantasy points per dropback and produced nine games of 20+ fantasy points, one more than Dak Prescott. The efficiency levels are historic and while there is some worry regression is coming, don’t fault Purdy as simply the “sum of his parts” and discredit what he’s done. The weapons are elite, Purdy fits perfectly in the Shanahan system, and it works for fantasy as a low-end QB1.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Justin Herbert",
    "Team": "LAC",
    "Bye Week": "5",
    "Rank": "13",
    "Points": "290.0",
    "Risk": "5.3",
    "Upside": "6.8",
    "ADP": "10.12",
    "Tier": "4",
    "Outlook": "You may have deleted 2023 from your memory, but through Week 6, Justin Herbert was the QB1 in fantasy averaging 23.3 fantasy points per game and a 69% completion rate. Things went south for the Chargers as Herbert was shut down after a finger injury in Week 14 and all the off-season did was sink him further in the minds of fantasy managers. The run-first approach from new OC Greg Roman will certainly erase Herbert as a volume play, but he can still win with efficiency. He’s being disrespected in drafts and we don’t mind starting out the gate (LV & CAR) with Big Herbs in plus matchups. He likely can replace some of the passing yardage with his own rushing production and still end up as a top-12 QB.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Tua Tagovailoa",
    "Team": "MIA",
    "Bye Week": "6",
    "Rank": "14",
    "Points": "286.6",
    "Risk": "3.3",
    "Upside": "7.0",
    "ADP": "9.11",
    "Tier": "4",
    "Outlook": "Through the first two months of the season, Tua looked like a true MVP candidate including three monster games as a top-3 QB while the Dolphins started 5-1. He was the QB17 the rest of the way including a dreadful stretch over the final five weeks where he failed to score more than 16 fantasy points in a single game. Miami has a fun, quick-strike offense but Tua is a bit more volatile week-to-week considering his lack of production on the ground. He is settling in again as a solid late round target for 1QB leagues. With a generous schedule (JAX, BUF, @ SEA, TEN) to open the season, completing a MIA stack in your draft is something we don’t mind at all.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Jared Goff",
    "Team": "DET",
    "Bye Week": "5",
    "Rank": "15",
    "Points": "277.3",
    "Risk": "2.7",
    "Upside": "5.6",
    "ADP": "10.04",
    "Tier": "4",
    "Outlook": "The QB10 & QB7 the last two seasons in Detroit seems to be beloved by Lions fans and management. For fantasy purposes, there is a simple formula for Goff: start him at home and pivot if you can on the road. He’s played 17 games at Ford Field the last two years, totaling 4,712 passing yards & 43 passing TDs! It is a formula for success and a high floor for Goff following a Kirk Cousins, perennial top-10 QB career path. The only point of caution is his splits against the blitz, throwing a league-leading six INTs and ranking 29th in completion rate. Goff under pressure is a thing but for 2024, expect him to be another solid late-round pick considering 14 of the Lions 17 games will be played indoors!",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Trevor Lawrence",
    "Team": "JAX",
    "Bye Week": "12",
    "Rank": "16",
    "Points": "275.1",
    "Risk": "5.0",
    "Upside": "5.8",
    "ADP": "11.08",
    "Tier": "5",
    "Outlook": "Coming off a QB8 season in 2022, Lawrence certainly had the opportunity to produce for fantasy with the fifth-most dropbacks among QBs. His 21 passing TDs ranked 104th out of 108 QBs with 4,000+ passing yards over the last decade. It was inefficient and you could see the team’s second-half nosedive, losing five of their last six and missing out on the playoffs. The skill position players are plentiful with the addition of 1st round pick Brian Thomas Jr. and the enigmatic Gabe Davis to pair with Travis Etienne Jr. and dependable possession receivers, Christian Kirk and Evan Engram. The ingredients are there for this Jacksonville recipe to work for fantasy, but the cooking through three years suggests TLaw can’t handle the heat. His draft cost is deflated so perhaps he surprises when the expectations are lower and becomes a weekly fantasy starter.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Deshaun Watson",
    "Team": "CLE",
    "Bye Week": "10",
    "Rank": "17",
    "Points": "270.9",
    "Risk": "7.7",
    "Upside": "6.0",
    "ADP": "15.04",
    "Tier": "5",
    "Outlook": "Welp, this is awkward. After serving an 11-game suspension in 2022 and underwhelming as a starter in 2023 before a season-ending injury, Watson seems like the poster boy of money not being able to buy happiness. He finished as a top-12 QB in three of his six starts but the Browns offense was noticeably worse in almost every major offensive category compared to when Joe Flacco was the starter. The Browns still owe this man a lot of money and he enters 2024 with a solid group of pass-catchers, including the addition of Jerry Jeudy. The days of being a top-five fantasy finisher are long gone thanks to a 60% completion rate in Cleveland (compared to 68% in Houston) and a reduced role as a scrambler. Watson is living in the middle of QB2-ville but it's a lonely place to be in.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Matthew Stafford",
    "Team": "LAR",
    "Bye Week": "6",
    "Rank": "18",
    "Points": "263.3",
    "Risk": "5.3",
    "Upside": "5.8",
    "ADP": "12.07",
    "Tier": "5",
    "Outlook": "Stafford had a good run down the stretch for fantasy managers willing to pivot to his services late in the year. When Kyren Williams returned from IR in Week 12, the Rams started rolling, averaging 31 points per game, coinciding with Stafford posting five straight top-12 performances. He still can have streamable moments but father time is catching up. Since 2011, only five quarterbacks finished in top-10 during their age 36 season, so he’d need an outlier TD season to make it happen with Puka Nacua, Cooper Kupp, and the gang. Week 1’s reunion in Detroit sounds like a fantasy bonanza waiting to happen and Week 2 in Arizona is another plus matchup. After that, the road gets much tougher so make sure you comb through Stafford’s season, counting on him only in plus matchups.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Kirk Cousins",
    "Team": "ATL",
    "Bye Week": "12",
    "Rank": "19",
    "Points": "259.9",
    "Risk": "6.3",
    "Upside": "5.7",
    "ADP": "12.04",
    "Tier": "5",
    "Outlook": "Welcome to Kirk Cousins’ life, which reads like a true Shakespearan play. Last year in Minnesota, he was the QB6 before his Week 8 Achilles injury, averaging 291 yards, 2.3 passing TDs and completing 69.5% of his passes, which would have been on pace to be his best season since 2018. He is lured to Atlanta by an organization that promised the final act of his career would be played out before family and friends (with a boatload of cash). However, Atlanta decided chaos was the only avenue to turn this story into a true soap opera, taking QB Michael Penix Jr. 8th overall in the Draft. Cousins should flourish in an offensive system with solid offensive skill position players, although you have to have some worry in the first month coming off his injury. His opening schedule (PIT, @ PHI, KC, NO) is no cake walk.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Caleb Williams",
    "Team": "CHI",
    "Bye Week": "7",
    "Rank": "20",
    "Points": "258.4",
    "Risk": "5.7",
    "Upside": "6.5",
    "ADP": "9.06",
    "Tier": "5",
    "Outlook": "It’s not often the hype meets actual on field performance. The 2022 Heisman winner became the 1.01 in the NFL Draft, and the Bears did the unthinkable: outfit him with weapons on the football field! Williams enters arguably the best situation ever for a QB taken first overall with established WR1 D.J. Moore, slot maven Keenan Allen, and an explosive rookie in #9 overall pick Rome Odunze. OC Shane Waldron brings a pass-heavy approach which should give Williams weekly streaming consideration and perhaps a ceiling to finish as a top-12 guy by the end of season. If you want to call your shot early in hopes you have dynamite in hand, taking Williams late in 1QB leagues to pair with your starter makes sense.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Geno Smith",
    "Team": "SEA",
    "Bye Week": "10",
    "Rank": "21",
    "Points": "255.6",
    "Risk": "4.3",
    "Upside": "5.5",
    "ADP": "18.09",
    "Tier": "5",
    "Outlook": "A year after breaking out and signing a three-year extension, Geno and the Seahawks offense returned to Earth in 2023. They ranked dead last in average time of possession and the big plays weren’t repeatable. After throwing a league-leading 15 TDs of 20+ air yards, he regressed to only five and the high ceiling outcomes were few and far behind. New OC Ryan Grubb emphasized the need to run the ball and balance the offense but the success will hinge on Geno and his connection with his three WRs. We like the weapons in Seattle and believe Geno can have some streamable weeks midway through the year if you need to pivot.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Aaron Rodgers",
    "Team": "NYJ",
    "Bye Week": "12",
    "Rank": "22",
    "Points": "255.4",
    "Risk": "7.2",
    "Upside": "5.3",
    "ADP": "12.11",
    "Tier": "5",
    "Outlook": "We can’t say we saw four total plays as part of the range of outcomes for Aaron Rodgers and the New York Jets. His Achilles injury immediately sunk all Jets fans back into their lifelong bouts of questioning their sanity. Hey, but it’s 2024! All indications from Rodgers, his injury timeline, and his “methods of recovery” say he should be good to go for Week 1. This Jets offense ranked dead last in points per drive and expected points per pass attempt. It was rough although we should be reminded that Aaron Rodgers hasn’t posted 25+ fantasy points in a game since Week 14…of the 2021 season. As a pocket passer playing in his age-40 season, we aren’t bullish on Rodgers as anything more than an occasional streamer in 1QB leagues.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Russell Wilson",
    "Team": "PIT",
    "Bye Week": "9",
    "Rank": "23",
    "Points": "254.2",
    "Risk": "8.0",
    "Upside": "4.8",
    "ADP": "19.04",
    "Tier": "6",
    "Outlook": "Welp! That didn't go according to plan, did it? The Broncos traded a ton to get Russ, gave him a 5-year extension, and then he was punted to Pittsburgh. He still accounts for 19% of Denver’s cap this year so maybe this is more of a sick, sick joke by the Steelers as they call the Broncos once a week cackling. He should start the year over Justin Fields, but there are no guarantees at all for a player being paid essentially the same as the team’s long snapper. He’s morphed into a different QB, checking it down on a league-leading 18.6% of his pass attempts last year. This low-volume, high-T, Arthur Smith-influenced offense is not the time or place for Russ to recreate his fantasy magic. How dare you even consider such a possibility. Shame on you.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Baker Mayfield",
    "Team": "TB",
    "Bye Week": "11",
    "Rank": "24",
    "Points": "250.2",
    "Risk": "3.0",
    "Upside": "4.0",
    "ADP": "14.11",
    "Tier": "6",
    "Outlook": "Who is Baker Mayfield? What is Baker Mayfield? We’re not quite sure but he limited his turnovers while posting the highest completion rate and most passing TDs of his career in a contract year for a Buccaneers team that surprised everyone. He was willing to chuck it deep with the most 20+ yard attempts in the NFL and helped Mike Evans secure another contract. For fantasy purposes, Baker was more steady than great. We do have some concerns that it was a one-year wonder with the offensive coordinator change from the dynamic Dave Canales to the less likable Liam Coen. Put him more in the streaming category rather than someone you leave your draft feeling confident as a weekly starter.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Daniel Jones",
    "Team": "NYG",
    "Bye Week": "11",
    "Rank": "25",
    "Points": "247.7",
    "Risk": "8.3",
    "Upside": "5.2",
    "ADP": "20.05",
    "Tier": "6",
    "Outlook": "There was much debate last year if Jones was not only worth the contract shelled out to him by the Giants but if he is even franchise QB material. 2023 was a lost year missing three weeks with a neck injury and eventually an ACL tear in Week 9. The Giants offense resembled the famed “Little Giants” as Jones averaged just 5.7 yards per attempt, besting only Bryce Young among starters. We expect Jones to be limited as a runner early in the season in his recovery nerfing the one secret sauce he had for fantasy. “Janiel Dones” as Malik Nabers affectionately called him, will have his work cut out for him winning over the locker room, recovering from a major injury, and re-emerging as a streamable fantasy option.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Will Levis",
    "Team": "TEN",
    "Bye Week": "5",
    "Rank": "26",
    "Points": "232.0",
    "Risk": "5.3",
    "Upside": "6.2",
    "ADP": "15.12",
    "Tier": "6",
    "Outlook": "“Bananarama” as he’s affectionately known on the podcast debuted in the NFL like a rocket ship throwing four TDs against Atlanta before crashing to earth with just four TDs over his final eight starts. He was wildly inaccurate especially under pressure but his penchant for pushing the ball down the field was evidenced by the highest aDOT (10.8) in the league. Jokes aside, his strong arm plus ultra-aggressiveness as a runner is a strong fantasy formula if the veteran weapons added this off-season (Tony Pollard & Calvin Ridley) can mesh with his playing style. Levis is not for the faint of heart but if you want to roll the dice in a 2QB league, we see a range of outcomes where he can be a fantasy force. We also could see him flaming out.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Derek Carr",
    "Team": "NO",
    "Bye Week": "12",
    "Rank": "27",
    "Points": "231.7",
    "Risk": "3.3",
    "Upside": "3.2",
    "ADP": "19.05",
    "Tier": "6",
    "Outlook": "Look through Derek Carr’s career fantasy logs and the takeaway is clear: he’s going to finish somewhere between QB13-QB20. Like death and taxes, Carr is like clockwork through his 10 seasons.  His incessant willingness to check the ball down and grimace on live TV drives fantasy managers bonkers. He did have a league-leading 12 passing TDs in his final four games and new OC Klint Kubiak hopefully could bring a more up-to-date offensive scheme in 2024. In a 2QB league, you can count on Carr to be exactly what he is: mediocre for fantasy with moments in dome games.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Bryce Young",
    "Team": "CAR",
    "Bye Week": "11",
    "Rank": "28",
    "Points": "211.6",
    "Risk": "6.7",
    "Upside": "4.3",
    "ADP": "19.02",
    "Tier": "7",
    "Outlook": "That odor you’re wafting in right now is one of the worst rookie seasons all-time. He looked overmatched against zone coverages and failed to throw a TD pass longer than 18 yards. Speaking of that number, a whopping 18% of his dropbacks ended in a sack or throwaway, and the Carolina offense finished at a vomit-worthy 4.7 yards per pass attempt. But there is hope! New head coach Dave Canales was a miracle worker with Geno Smith in Seattle and Baker Mayfield last year in Tampa Bay. The team invested heavily in the offensive line, brought in dependable Diontae Johnson, and took three offensive skill position players in the draft to outfit Young with something way better than the ragtag crew led by Adam Thielen last year. Are we still nervous? You bet! Very few QBs return from this poor of a debut, but you can certainly see a path where Young rebounds to QB15 territory if things break right.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Gardner Minshew II",
    "Team": "LV",
    "Bye Week": "10",
    "Rank": "29",
    "Points": "205.3",
    "Risk": "6.3",
    "Upside": "3.3",
    "ADP": "23.06",
    "Tier": "8",
    "Outlook": "It’s kinda nice we get more Minshew in our lives. Apparently the Raiders were willing to give our free-spirited guy another shot at a starting job despite sporting the exact same numbers as Aidan O’Connell. Seriously, check the completion rate, QB Rating, aDOT, and sack rate. Minshew can deliver some low-end QB1 weeks but the identity of this team will be OC Luke Getsy choosing “HB Dive” with his video game controller again and again. Don’t count out Minshew. Oh, but also don’t count on him at all. Who knows how long he has the starting job.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Bo Nix",
    "Team": "DEN",
    "Bye Week": "14",
    "Rank": "30",
    "Points": "196.9",
    "Risk": "6.0",
    "Upside": "2.7",
    "ADP": "19.06",
    "Tier": "8",
    "Outlook": "Sean Payton came out saying Bo Nix was the QB they wanted all along. Is it coach rhetoric or can Nix execute this system the way it was intended? (Or at least NOT the way Russell Wilson did.) The 24-year-old started more games in college (60) than anyone in history and broke the FBS record for single-season completion percentage (77.4%) this past year at Oregon. You can see how it can work with some sneaky rushing ability and yet you also cower in fear trusting a rookie QB for fantasy with one of the worst offensive skill position groups in the NFL. We’re rooting for Nix, but we can only recommend drafting Nix to people we hate: our fellow leaguemates.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Drake Maye",
    "Team": "NE",
    "Bye Week": "14",
    "Rank": "31",
    "Points": "195.9",
    "Risk": "6.8",
    "Upside": "4.8",
    "ADP": "18.12",
    "Tier": "8",
    "Outlook": "Maye checks almost every single box you could want for an NFL QB. He has the size and play-making ability along with underrated rushing numbers that could eventually transform into being both an effective franchise and fantasy QB. But will these Patriots stink? They are tied with the lowest win total (4.5) in the NFL after ranking dead last in time of possession last year, unable to sustain drives and the pass catchers were the main issue. New England had three total games of a receiver posting 80+ receiving yards, the fewest of any NFL team in 2023. Maye will be up against it with one of the toughest opening schedules (@ CIN, SEA, @ NYJ, @ SF) in the NFL along with a brutal AFC East division. He has the raw tools akin to go full-on Josh Allen but remember that rookie year was an abysmal turnover fest for Allen.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Sam Darnold",
    "Team": "MIN",
    "Bye Week": "6",
    "Rank": "32",
    "Points": "152.0",
    "Risk": "6.3",
    "Upside": "3.0",
    "ADP": "23.01",
    "Tier": "8",
    "Outlook": "The Vikings are entering post-Kirk Cousins territory so Darnold will have a chance to compete with 10th overall pick J.J. McCarthy for a starting role on his 4th NFL team. Minnesota is a pass-happy offense finishing top-5 in pass rate each of Kevin O’Connell’s first two years coaching. Expect Darnold to be the bridge to McCarthy and slowly fade back to where he feels most comfortable: on the sideline.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Jacoby Brissett",
    "Team": "NE",
    "Bye Week": "14",
    "Rank": "33",
    "Points": "142.9",
    "Risk": "6.0",
    "Upside": "3.8",
    "ADP": "54.08",
    "Tier": "8",
    "Outlook": "Where’s the Beef? Brissett somehow finds himself in the conversation again as a bridge QB for 3rd overall pick Drake Maye. From Indianapolis to Cleveland to Washington and now New England, Brissett has played this part before. We could see Brissett starting 4+ games before the reins are given over to the youngster. Even in SuperFlex leagues, the Patriots opening schedule is so gross that we don’t recommend casting your lot with the Beef.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "J.J. McCarthy",
    "Team": "MIN",
    "Bye Week": "6",
    "Rank": "34",
    "Points": "110.7",
    "Risk": "6.5",
    "Upside": "5.5",
    "ADP": "15.05",
    "Tier": "9",
    "Outlook": "Coming off an undefeated National Championship season at Michigan, there was a steady drumbeat during the off-season McCarthy was highly regarded by the NFL and the Vikings confirmed that selecting him 10th overall. This is a dream scenario for his development with HC Kevin O’Connell, a chance to be eased in behind Sam Darnold, and established elite weapons at WR. Minnesota ranked fourth in pass rate and fifth in pace and that was while throwing Joshua Dobbs, Jaren Hall, and Nick Mullens out there for almost half the year with Kirk Cousins injured. McCarthy will have his rookie moments and likely sit for the first month of the season, but he’s an intriguing name to monitor, especially as the Vikings continue to lean into passing volume.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Justin Fields",
    "Team": "PIT",
    "Bye Week": "9",
    "Rank": "35",
    "Points": "17.3",
    "Risk": "9.0",
    "Upside": "6.0",
    "ADP": "20.08",
    "Tier": "9",
    "Outlook": "The headline for Fields remains the same: it works for fantasy football. Through three seasons, Fields averaged a very Footballers-esque 55.5 rushing yards per game as 43% of his fantasy points in his career have come via the ground. However, he won just 10 of his 38 starts and the Bears got tired of believing in a signal-caller with a 12.4% career sack rate. The raw tools are there for him to take over the starting job in Pittsburgh and we’ll end up having the same conversation for fantasy. This Steelers team is going to run the ball and if Fields is behind center, expect the same.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Drew Lock",
    "Team": "NYG",
    "Bye Week": "11",
    "Rank": "36",
    "Points": "0.0",
    "Risk": "6.0",
    "Upside": "5.0",
    "ADP": "46.11",
    "Tier": "9",
    "Outlook": "Lock joined the Giants on a one-year deal to compete for the starting job alongside Daniel Jones and ya boi Tommy “Cutlets” DeVito. It’s a funny trio to compare and while you might be rooting for Lock in a “let’s see how this reality TV plays out” kind of way, Malik Nabers has to be rolling his eyes. After being selected in the 2nd round by Denver in 2019, Lock’s 59% completion rate and 2.9% INT rate both are screaming what we already know: he’s not an NFL starter. He’s called “Mr. Irresponsible” for a reason.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  }
]