[
  {
    "Name": "Christian McCaffrey",
    "Team": "SF",
    "Bye Week": "9",
    "Rank": "1",
    "Points": "355.0",
    "Risk": "1.7",
    "Upside": "9.7",
    "ADP": "1.01",
    "Tier": "1",
    "Outlook": "This man is not from this planet. CMC set career-highs in rushing yards, yards per carry, and total TDs at the age of 27 and there is little reason to believe he is finished. He belongs in the Fantasy Hall of Fame after tying Priest Holmes and LaDainian Tomlinson as the only RBs with three seasons averaging 24+ PPR points per game. McCaffrey is under contract for two more years and with the NFL's best work ethic, he should be able to churn out another top-5 season in 2024 barring an injury. Oh, you should take him at 1.01. Do it.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Bijan Robinson",
    "Team": "ATL",
    "Bye Week": "12",
    "Rank": "2",
    "Points": "291.2",
    "Risk": "2.7",
    "Upside": "9.7",
    "ADP": "1.08",
    "Tier": "2",
    "Outlook": "It wasn’t exactly all peaches in Bijan’s first year in the Peach State but he still finished as the RB9 for fantasy becoming the eighth rookie RB over the last decade with 270+ touches. He was prolific in the passing game with the second-most routes run and fourth-most receiving yards among all RBs. With Arthur Smith now in Pittsburgh, expect a more balanced offensive approach with tons of 11-personnel looks. In sets with three or more WRs on the field, Bijan averaged 5.8 yards per carry as a rookie. He’s a locked-in 1st round pick and a true foundational piece for a fantasy roster.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Breece Hall",
    "Team": "NYJ",
    "Bye Week": "12",
    "Rank": "3",
    "Points": "287.0",
    "Risk": "3.0",
    "Upside": "9.3",
    "ADP": "1.09",
    "Tier": "2",
    "Outlook": "Breece Hall stiff-armed all of the offensive line woes and the lack of an actual NFL QB under center to finish as a top-5 fantasy RB in his sophomore year. He is essentially this team's WR2 as his 95 targets led the RB position and 48% of his fantasy points came via the air, the highest rate of any top-5 RB over the last five years. Expect some of those checkdowns to regress with the return of Aaron Rodgers but the red zone opportunities could also finally be in his favor. The J-E-T-S ranked L-A-S-T in plays inside the five yard line in 2023. Hall is a 1st round stud and someone to anchor your fantasy team around.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Jahmyr Gibbs",
    "Team": "DET",
    "Bye Week": "5",
    "Rank": "4",
    "Points": "274.2",
    "Risk": "3.0",
    "Upside": "9.3",
    "ADP": "1.11",
    "Tier": "2",
    "Outlook": "Who is laughing now? The Lions drew the ire of tons of pundits after selecting Gibbs 12th overall in the 2023 NFL Draft. After being brought along slowly the first month of the season, Gibbs caught fire as the RB3 in fantasy from Week 7 on. He tied Clinton Portis for the third-highest fantasy points per touch rookie season ever and the versatility in the passing game was showcased every week. David Montgomery will still be a thorn in the side of Gibbs managers in the red zone but Gibbs’ trajectory as an impact fantasy RB is approaching the moon. We have him locked-in as a top-five RB and a building block piece near the 1-2 turn of redraft leagues.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Kyren Williams",
    "Team": "LAR",
    "Bye Week": "6",
    "Rank": "5",
    "Points": "257.2",
    "Risk": "5.7",
    "Upside": "9.0",
    "ADP": "2.04",
    "Tier": "3",
    "Outlook": "Kyren was incredible for fantasy, and he completely capitalized on his opportunity, leading the NFL in rushing yards per game last season. He joined Priest Holmes as the only other RB to score 15+ total TDs in 12 or fewer games over the last 40 years. It was truly a miracle season if you had Kyren last year (or felt the pain of facing him). However, there are warning signs for regression in 2024 with an astounding 37% of his fantasy points coming via TDs and the selection of TD-machine Blake Corum in the third round certainly being a punch in the gut. Despite some off-season injuries, we still view Kyren as an RB1 heading into drafts.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Travis Etienne Jr.",
    "Team": "JAX",
    "Bye Week": "12",
    "Rank": "6",
    "Points": "253.8",
    "Risk": "4.0",
    "Upside": "8.7",
    "ADP": "2.11",
    "Tier": "3",
    "Outlook": "We speculated about Etienne’s workload before the season and the Jaguars gave him all he could handle. He saw the third-most opportunities (340) among RBs and led the league in forced missed tackles. Before the team’s bye, he had four straight top-5 finishes, averaging 123 total yards. Things fell off afterwards and if there was a reason for concern, he was asked to pass-block at an alarming rate and now this team restocked with other pass-catchers in Gabe Davis and Brian Thomas Jr. We still view Etienne as a top-10 RB with a chance to repeat in the top-5 if Trevor Lawrence and the offense improves in sustaining drives.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Jonathan Taylor",
    "Team": "IND",
    "Bye Week": "14",
    "Rank": "7",
    "Points": "253.7",
    "Risk": "5.0",
    "Upside": "9.0",
    "ADP": "2.01",
    "Tier": "3",
    "Outlook": "There aren't many RBs in the NFL more talented than Taylor when he's healthy. Last year, in games with 50+ % snaps, he averaged 21.4 opportunities per game. He was the RB6 in points per game from Week 6 on, showcasing that he should be viewed as a top tier fantasy RB. Anthony Richardson’s return certainly lowers some of his ceiling with the rushing around the goal-line. Regardless, JTT should see a monster workload on an up-tempo and up-and-coming offense. He is a strong RB1 in our book.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Alvin Kamara",
    "Team": "NO",
    "Bye Week": "12",
    "Rank": "8",
    "Points": "244.2",
    "Risk": "5.7",
    "Upside": "6.8",
    "ADP": "5.04",
    "Tier": "3",
    "Outlook": "After missing the first month of the season due to suspension, Kamara’s fantasy production followed a very simple formula: check it down Derek Carr! Kamara led all RBs in targets per game (6.6) and receptions per game (5.7) while being targeted on an insane 32% of his routes. He was this team’s 1B wide receiver alongside Chris Olave, and yet as a runner, it was rough. His yards per touch (4.5) was the lowest of his career highlighting some warning signs that the decline may be coming quite quickly. In full PPR leagues, his floor remains high knowing targets are so much more valuable than carries for fantasy football.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Saquon Barkley",
    "Team": "PHI",
    "Bye Week": "5",
    "Rank": "9",
    "Points": "242.1",
    "Risk": "5.0",
    "Upside": "8.3",
    "ADP": "2.03",
    "Tier": "3",
    "Outlook": "After losing Miles Sanders the previous year and D'Andre Swift to the Bears, the Eagles opened up their checkbook for hometown guy Saquon Barkley. He was the RB8 and RB5 against Philly last year so maybe those wounds loomed large. As a fluid pass-catcher and an athletic freak, he remains an elite option but you have to expect some of those goal-line looks to be pushed via Jalen Hurts' tush. The offensive line upgrade is night-and-day, giving Barkley a high floor on a great offense and top-10 RB status for 2023.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Isiah Pacheco",
    "Team": "KC",
    "Bye Week": "6",
    "Rank": "10",
    "Points": "239.4",
    "Risk": "4.2",
    "Upside": "7.3",
    "ADP": "3.07",
    "Tier": "3",
    "Outlook": "Pacheco (and his cartoonish running style) firmly solidified himself as one of the most valuable RBs in fantasy last season, going from a role player as a rookie in 2022 to a true workhorse in 2023. From Weeks 1-17, Pacheco was 11th among all RBs in total opportunities per game, and he was a key piece of their Super Bowl run as well. A fantasy value in 2023 drafts, there's no more guessing when it comes to the Chiefs backfield. The price is much higher this year but you can leave your drafts with a volume-based RB2 who can easily finish as a top-10 guy.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Rachaad White",
    "Team": "TB",
    "Bye Week": "11",
    "Rank": "11",
    "Points": "238.0",
    "Risk": "5.7",
    "Upside": "8.0",
    "ADP": "4.04",
    "Tier": "4",
    "Outlook": "After catching 50 passes as a rookie behind Leonard Fournette, Rachaad White followed up with an impressive sophomore campaign... from a fantasy standpoint. The opportunities (336) were glorious and from Week 7 on, he was the RB2 in total fantasy points. However, the efficiency numbers are somewhat concerning as his yards per carry (3.64) is the lowest for a top-15 RB over the last five years. He should be the locked-in starter for 2024 but there are some red flags that he might not be able to repeat that ceiling performance again. Treat him more as a high-end, volume-based RB2 moving forward. The added variable of a changing offensive coordinator to Liam Coan should also be taken into account.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "James Cook",
    "Team": "BUF",
    "Bye Week": "12",
    "Rank": "12",
    "Points": "235.5",
    "Risk": "3.7",
    "Upside": "7.3",
    "ADP": "4.10",
    "Tier": "4",
    "Outlook": "Cook was a fantasy enigma in 2023. Was he good? Or did he merely compile by not missing a game? His 1,567 yards from scrimmage were third-most in the NFL behind only CMC and Breece Hall, and he ranked #1 in yards before contact thanks to the Buffalo offensive line. However, he also became one of five RBs since 2000 to finish as an RB1 for fantasy with two or fewer rushing TDs. The shift in offensive coordinator approaches from Ken Dorsey to Joe Brady resulted in a massive spike in Cook’s opportunity as he went from 14.8 opportunities per game to 20.4 from Week 11 on. With a lack of goal-line opportunities (thanks Josh Allen!) and a heavy reliance on efficiency, Cook is best treated as an RB2 in redraft.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Derrick Henry",
    "Team": "BAL",
    "Bye Week": "14",
    "Rank": "13",
    "Points": "227.5",
    "Risk": "4.7",
    "Upside": "7.5",
    "ADP": "3.03",
    "Tier": "4",
    "Outlook": "Get out of the Big Dog’s way! After leading the NFL in yards after contact four of the last five years and carrying the Titans on his massive back, King Henry finds a new nest to call home in Baltimore. He has double-digit rushing TDs in six straight years and while father time is catching up to the 30 year old, we do have some precedent of players at this age still getting in the end zone. Since 2010, nine different RBs age 30+ scored 10 or more total TDs including Raheem Mostert’s absurd 21 last year. Henry’s splits have always followed closely to team wins and losses so Baltimore is a perfect blend for him at this stage in his career. We still see him as a back-end RB1 for fantasy regardless of the lack of receiving work.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "De'Von Achane",
    "Team": "MIA",
    "Bye Week": "6",
    "Rank": "14",
    "Points": "225.5",
    "Risk": "6.2",
    "Upside": "9.5",
    "ADP": "2.11",
    "Tier": "4",
    "Outlook": "The efficiency numbers were off-the-charts and not repeatable. Right? He ranked second among all RBs in yards after contact per attempt and led all NFL RBs in yards per touch (7.7) while seemingly hitting a 40+ yard score every healthy week. He almost breaks our “upside meter” metric in our rankings but we’re split on how his season could shake out. Counting on him as your fantasy team’s dependable, consistent RB1 is exhilarating and yet the contract extension of Raheem Mostert plus the addition of speedster Jaylen Wright certainly adds more risk.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Joe Mixon",
    "Team": "HOU",
    "Bye Week": "14",
    "Rank": "15",
    "Points": "225.2",
    "Risk": "5.0",
    "Upside": "7.5",
    "ADP": "4.12",
    "Tier": "4",
    "Outlook": "Maybe you forgot but Joe Mixon finished the year as the… RB5! Yeah, we blanked out too, but it seems like the Texans took notice pivoting early in free agency to strike a deal with the Bengals for Mixon and extending him for three years. The soon-to-be 28 year old is a workhorse back and the only RB to finish top-12 each of the last three years. He should gobble up all the backfield opportunities (sorry Dameon Pierce) on a great Houston Texans offense. His age and C.J. Stroud’s lack of targeting the RB position are the main red flags keeping Mixon from churning out another top-12 season.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "James Conner",
    "Team": "ARI",
    "Bye Week": "11",
    "Rank": "16",
    "Points": "215.6",
    "Risk": "6.7",
    "Upside": "6.5",
    "ADP": "6.03",
    "Tier": "5",
    "Outlook": "Coming off his first 1,000 rushing yard season of his career, Conner dispelled concerns that he was “too old” with an insane final five game stretch where he averaged 22.6 fantasy points and a whopping 23.8 opportunities per game. Like clockwork, he remains a value in drafts due to his perceived elder status, but this Arizona offense should be even more competitive in 2024. The lingering worries are rookie Trey Benson eventually cutting in and the fact Conner is guaranteed to miss a few games thanks to his playing style. Sometimes a solid, not sexy RB2 is what your fantasy team needs.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Raheem Mostert",
    "Team": "MIA",
    "Bye Week": "6",
    "Rank": "17",
    "Points": "213.6",
    "Risk": "6.5",
    "Upside": "8.2",
    "ADP": "7.12",
    "Tier": "5",
    "Outlook": "Raheem Mostert, who led the NFL in rushing TDs with 18, may have been the steal of the draft last year considering where he was taken. He was a big play waiting to happen and hilariously lowered his career average to 5.2 yards per carry thanks to his 20 carries inside the five-yard line. The 32-year-old’s career path doesn’t make logical sense but then again, have you ever played fantasy football? Mostert is one of the better values in the draft as his age, and the presence of De’Von Achane and rookie Jaylen Wright is driving down his draft cost. He might not repeat 21 total TDs but at his ADP, he doesn’t need to despite being on one of the best offenses in the NFL.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Kenneth Walker III",
    "Team": "SEA",
    "Bye Week": "10",
    "Rank": "18",
    "Points": "213.4",
    "Risk": "4.7",
    "Upside": "8.0",
    "ADP": "5.05",
    "Tier": "5",
    "Outlook": "Walker’s first two seasons were nearly identical in fantasy points per game, total touchdowns, and yards per touch. He saw 73% of the team’s rush attempts (10th best among RBs) in 15 games played and his elite red zone role remained unchallenged despite Zach Charbonnet’s presence and in spite of the Seahawks’ ineptitude in sustaining drives in 2023. Walker seems very game script dependent (ala Derrick Henry) as he averaged 14.8 fantasy points per game in Seattle wins versus a pedestrian 8.6 in losses. We can expect those trends to continue but he remains a valuable RB2 for fantasy.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Josh Jacobs",
    "Team": "GB",
    "Bye Week": "10",
    "Rank": "19",
    "Points": "211.6",
    "Risk": "6.0",
    "Upside": "7.3",
    "ADP": "3.03",
    "Tier": "5",
    "Outlook": "After leading the league in rushing the previous year, Jacobs bottomed-out in 2023 regressing in a number of important efficiency areas including ranking 47th out of 50 qualifying RBs in fantasy points per opportunity. His landing spot in Green Bay is a boost to his stock fueled by this Jordan Love-led offense. The volume should be there early in the year although it shouldn’t be surprising if rookie MarShawn Lloyd gains more trust. Jacobs feels like a player you ask Siri to remind you about in Week 5. Is he the same old workhorse RB1 or were his struggles in Las Vegas last year a warning sign to stay far, far away?",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Aaron Jones",
    "Team": "MIN",
    "Bye Week": "6",
    "Rank": "20",
    "Points": "204.4",
    "Risk": "5.3",
    "Upside": "7.0",
    "ADP": "5.12",
    "Tier": "6",
    "Outlook": "Jones tore through the final month of the season and NFC playoffs with five straight 100+ rushing performances as the team's best offensive weapon in the playoffs. Unfortunately, the Packers parted ways and signed Josh Jacobs. Jones is 29, but it's clear he still has something left in the tank as a multi-faceted RB. He stays in the NFC North on a one-year deal to play for the rival Vikings and should have some sort of time share with Ty Chandler, who looked explosive in his opportunities last season. We still view him as a capable RB2 albeit behind a worse offensive line and downgrade at QB.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Rhamondre Stevenson",
    "Team": "NE",
    "Bye Week": "14",
    "Rank": "21",
    "Points": "200.4",
    "Risk": "5.3",
    "Upside": "5.5",
    "ADP": "6.10",
    "Tier": "6",
    "Outlook": "2022 was a banner year for Rhamondre as he gobbled up 88 targets and was on pace for 72 last year. Unfortunately, an ankle injury cut his season short, but he lowered his yards per carry by a full yard: 5.0 to 4.0. New England’s new look offense with Drake Maye and new OC Alex Van Pelt represents a complete facelift - with an emphasis on an outside zone blocking scheme as a new wrinkle for Rhamondre to learn. Expect 16+ touches per game as the team showed renewed confidence signing him to a multi-year extension although free agent acquisition Antonio Gibson should steal some of the passing downs work. We are Rhamondre fans and love him as a low-end RB2 but also don’t assume we’ll ever get back to that 2022 season.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Tony Pollard",
    "Team": "TEN",
    "Bye Week": "5",
    "Rank": "22",
    "Points": "193.5",
    "Risk": "5.0",
    "Upside": "5.8",
    "ADP": "7.09",
    "Tier": "6",
    "Outlook": "That sound you just heard was a gentle flush of the toilet… because that’s where Pollard’s efficiency went in 2023. After fantasy managers pleaded with Dallas for years to give Tony P the rock, he was given a massive opportunity on the league’s best offense and promptly responded by converting just three of his 16 carries inside the five yard line into TDs. The Titans signed the veteran to a three-year deal in hopes the offensive weapons around Will Levis can jump start this team. Pollard is the presumed starter but we are worried this might end up being a 1A & 1B tandem with Tyjae Spears.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Jaylen Warren",
    "Team": "PIT",
    "Bye Week": "9",
    "Rank": "23",
    "Points": "189.3",
    "Risk": "4.7",
    "Upside": "5.8",
    "ADP": "9.02",
    "Tier": "6",
    "Outlook": "Simply put, Warren was one of the most effective backs in the NFL last year. Among 69 RBs with 50+ rush attempts, Warren ranked third in yards after contact per attempt, fourth in breakaway rush rate, and second in missed tackles forced per attempt. He also was targeted on 28% of his routes making him an efficiency monster. New OC Arthur Smith sold his soul for an unrelenting commitment to run the ball so an emphasis on the running game is a foregone conclusion. We have Warren as a startable FLEX option with upside if Najee Harris were to miss time.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Zamir White",
    "Team": "LV",
    "Bye Week": "10",
    "Rank": "24",
    "Points": "186.3",
    "Risk": "5.7",
    "Upside": "6.3",
    "ADP": "7.10",
    "Tier": "6",
    "Outlook": "The hard-nosed runner had a solid final four game stretch to close the 2023 season, averaging 24.3 opportunities per game. That is the sample size we have to go off of after Josh Jacobs took the cheese in Green Bay, giving White a massive opportunity entering 2024. New OC Luke Getsy ranked top-two in rush rate each of his two seasons in Chicago and we can expect a ground-and-pound approach again in Las Vegas. Do we think White is super talented? Is he this year’s Alexander Mattison as a backup thrust into a starting role? Maybe yes to both (he can ask his teammate Mattison about the latter) but the main focus is the opportunities at hand as Jacobs vacates 56% of the carries and 10% of the team’s targets.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "David Montgomery",
    "Team": "DET",
    "Bye Week": "5",
    "Rank": "25",
    "Points": "185.1",
    "Risk": "4.0",
    "Upside": "6.2",
    "ADP": "6.05",
    "Tier": "6",
    "Outlook": "Montgomery was a red zone monster last year despite sharing the backfield with Jahmyr Gibbs. He had the fifth-most red zone touches and converted 19 of his attempts inside the five yard line to nine rushing TDs. 90% of Montgomery’s fantasy points came via the ground which does raise some red flags with the lack of passing work and a history of regression from fantasy RBs with that much reliance on rushing. While Gibbs might see a bigger workload in 2024, the scoring opportunities will be plentiful for David “Mopportunity” on an offense that averaged the fifth-most points and second-most plays per game in the NFL. Consider him a high floor RB2.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Najee Harris",
    "Team": "PIT",
    "Bye Week": "9",
    "Rank": "26",
    "Points": "185.0",
    "Risk": "6.3",
    "Upside": "5.5",
    "ADP": "7.05",
    "Tier": "6",
    "Outlook": "Najee is the guy who shows up late to the party but man, the fashionably late usually have the best time. He was the RB8 from Week 7 and on, repeating his second half performance from the previous year. The end of season numbers look fine with 1,000+ rushing yards each of his first three seasons in the league. However, he’s been usurped as a pass-catcher by Jaylen Warren and the efficiency numbers are declining. His snap rate, opportunities, and fantasy points per game have all trended downward these last two years and the team declined his 5th-year option. It’s rare to find a starting RB on a run-first team this late in your drafts so we aren’t totally out on Najee if you get him late enough.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Gus Edwards",
    "Team": "LAC",
    "Bye Week": "5",
    "Rank": "27",
    "Points": "182.1",
    "Risk": "5.7",
    "Upside": "6.8",
    "ADP": "10.05",
    "Tier": "7",
    "Outlook": "Beep Beep! The Gus Bus stepped out when J.K. Dobbins went out including a ridiculous run from Weeks 7-11 where he totaled eight rushing TDs in that span. Despite the onslaught of TDs, Edwards’ RB20 finish is the fourth-worst among 80 RBs to hit the 13+ rushing TD mark since 2000. The soon-to-be 29-year-old looked like he would be on his last legs as an early down grinder until his former OC (Greg Roman) hand-picked him to join his high-T approach in Los Angeles. His no-nonsense running style is exactly what gets Roman going in the morning, but for fantasy, his lack of pass-catching will always hold him back from a true ceiling.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "D'Andre Swift",
    "Team": "CHI",
    "Bye Week": "7",
    "Rank": "28",
    "Points": "181.1",
    "Risk": "4.7",
    "Upside": "6.3",
    "ADP": "6.06",
    "Tier": "7",
    "Outlook": "Swifties out there are hoopin’ and hollerin’ that he received the first reported RB free agent contract of 2024. He signed a 3-year, $15 million guaranteed deal as the RB1 for a completely remade Bears offense. Keep in mind that 47% of Swift’s rushing yardage last year came before contact, the highest rate in the NFL and a testament to the Philly offensive line. Since 2011, lead RBs playing alongside rookie QBs have averaged 250+ opportunities and low-end RB2 fantasy point production. That is probably Swift’s floor with room to finish as an RB1 if the Chicago offense hums with Caleb Williams.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Tyjae Spears",
    "Team": "TEN",
    "Bye Week": "5",
    "Rank": "29",
    "Points": "180.9",
    "Risk": "4.3",
    "Upside": "4.8",
    "ADP": "10.02",
    "Tier": "7",
    "Outlook": "The 3rd round RB saw 50+ % of snaps in 12 of 17 games as Derrick Henry’s change-of-pace backfield. He became the 14th rookie RB over the last decade to gather 50 receptions and often functioned as this team’s No. 2 pass catcher behind DeAndre Hopkins. He should share touches with Tony Pollard making this a frustrating backfield to buy into for fantasy. We like some of Spears’ efficiency numbers but this Titans offense is also a complete wildcard with Will Levis. Think of Spears at the beginning of the year as a FLEX with benefits.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Zack Moss",
    "Team": "CIN",
    "Bye Week": "12",
    "Rank": "30",
    "Points": "179.1",
    "Risk": "5.0",
    "Upside": "6.3",
    "ADP": "8.11",
    "Tier": "7",
    "Outlook": "There was a moment when Zack Moss was one of THE stories of fantasy football in 2023. When Jonathan Taylor was out, he was a usage monster, averaging 17.2 fantasy points per game and 22.2 opportunities from Weeks 2-7. He was eventually phased out once JTT returned. Moss is only 26, and he now gets rewarded for his play last season with a two-year deal to play with Joe Burrow and the Bengals, while Joe Mixon is off to Houston. Expect Moss to be the team's primary early down back with last year's 5th round rookie, Chase Brown, mixing in as a change of pace option. Moss is nothing special talent-wise but sometimes all your fantasy roster needs is a RB with opportunities to fill out a FLEX spot.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Javonte Williams",
    "Team": "DEN",
    "Bye Week": "14",
    "Rank": "31",
    "Points": "177.7",
    "Risk": "6.2",
    "Upside": "6.0",
    "ADP": "8.09",
    "Tier": "7",
    "Outlook": "Javonte was by no means an inferno with a predictably down year in 2023. He had just three total rushing TDs, and averaged 3.6 yards per carry, 3.8 yards per touch. Sean Payton still loaded him up with 275 opportunities despite his inefficiency coming off a major injury. This Denver backfield was peppered with targets from Russell Wilson and Bo Nix does excel in the short area passing game. The hope is he is a usage monster in a contract year and gives your team top-15 type numbers. However, the reality is (to quote the great philosopher Jason Moore) this Denver team projects to be one of the worst in the NFL so scoring opportunities might be few and far between. He is more in the low-end RB2 camp to start the year.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Austin Ekeler",
    "Team": "WAS",
    "Bye Week": "14",
    "Rank": "32",
    "Points": "177.3",
    "Risk": "6.7",
    "Upside": "5.5",
    "ADP": "8.12",
    "Tier": "7",
    "Outlook": "Apologies if you inhaled the fantasy football stink bomb known as Austin Ekeler in 2023. His yards per carry plummeted to 3.5 as 61% of his rush attempts went for three yards or fewer. In fact from Thanksgiving on, he had just one gain of 10+ yards on 77 attempts… oh, and it went for 10 yards. Time to take out the SNES cartridge, blow on it, and fire this thing back up! Ekeler reunites with RB coach Anthony Lynn (his HC in Los Angeles) and finds himself in a backfield where he could make some noise as a PPR option. Brian Robinson Jr. is the early down grinder but Ekeler can make his bones on passing downs and reinvent himself as a low-end RB2. You can’t hold onto what he once was for fantasy but maybe we can find room for him for a little bit more Awesome Excellence.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Devin Singletary",
    "Team": "NYG",
    "Bye Week": "11",
    "Rank": "33",
    "Points": "176.7",
    "Risk": "3.3",
    "Upside": "6.3",
    "ADP": "9.08",
    "Tier": "7",
    "Outlook": "“Singlecarry” morphed into the Texans’ workhorse back, averaging 19.6 opportunities per game from Week 9 on, making Houston’s one-year $3 million investment look like a steal and Dameon Pierce an afterthought. He leaves one of the best young offenses in the NFL and lands in New York with $9.5 million guaranteed in hand to try to replace Saquon Barkley, who accounted for 30% of the team’s total yardage in his 14 games played, the highest rate in the NFL.  Add in an offensive line that is… well, downright offensive and it could be a “close your eyes” situation where you ignore the jersey (sorry Giants fans) and lean into his volume in fantasy as a startable FLEX option.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Ezekiel Elliott",
    "Team": "DAL",
    "Bye Week": "7",
    "Rank": "34",
    "Points": "172.6",
    "Risk": "6.0",
    "Upside": "4.5",
    "ADP": "10.09",
    "Tier": "7",
    "Outlook": "Well, well, well. Look who’s back! Elliott returns to Dallas after a year in New England where he was quietly effective for fantasy down the stretch as the RB9 from Week 13 on. Shield your gaze from the efficiency numbers as he averaged just three yards per carry in that span with the RB age cliff certainly working against him. This Dallas offense ranked #1 in red zone plays per game last year and Tony Pollard woefully converted just three of his 16 carries inside the five into TDs. The opportunity is there for Zeke to fall into the end zone and be a FLEX-worthy play on a weekly basis.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Brian Robinson Jr.",
    "Team": "WAS",
    "Bye Week": "14",
    "Rank": "35",
    "Points": "172.4",
    "Risk": "3.3",
    "Upside": "4.8",
    "ADP": "10.04",
    "Tier": "7",
    "Outlook": "BRob had the same amount of touches (214) as his rookie year but out produced in both the yardage and TD department big time. It feels like a dream but for the first 11 weeks of the season, he was the RB4(!) in fantasy averaging 13.5 fantasy points per game and 15.5 opportunities. The surprising part was he showed out as a pass-catcher after totaling just 60 receiving yards as a rookie. This Washington offense has a major offensive scheme change from Eric Bienemy to Kliff Kingsbury and with the added variable of a rookie QB, you can kiss the memories of BRob’s early season breakout good-bye. We have Austin Ekeler ranked ahead of him and can’t endorse him as much more than a depth piece to your roster.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Jonathon Brooks",
    "Team": "CAR",
    "Bye Week": "11",
    "Rank": "36",
    "Points": "172.4",
    "Risk": "6.3",
    "Upside": "7.0",
    "ADP": "8.07",
    "Tier": "7",
    "Outlook": "While the Panthers offense does give us some paws (see what we did there), Brooks was selected as the RB1 and only RB taken in the first two rounds of the NFL Draft. The competition (Chuba Hubbard and Miles Sanders) is not concerning and new HC Dave Canales' run-heavy scheme should do wonders for Bryce Young and the entire offense. A rebuilt interior of the offensive line and a decade-long streak of rookie RBs contributing top-24 fantasy seasons says Brooks has a path to continue that trend. Consider him in FLEX territory to begin the season, but he should work his way to RB2 status as the weather turns colder.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Jerome Ford",
    "Team": "CLE",
    "Bye Week": "10",
    "Rank": "37",
    "Points": "168.1",
    "Risk": "3.7",
    "Upside": "4.7",
    "ADP": "11.05",
    "Tier": "7",
    "Outlook": "Ford was a steady force for fantasy in 2023, finishing as a top-24 RB eleven times! He averaged 16.3 opportunities per game and also was more involved in the passing game than you might realize with 60 targets. The Browns ranked #1 in the NFL in rushing plays per game (34.3) in non-Joe Flacco games. Expect a heavy reliance on the run with Deshaun Watson with Ford leading the group for now. He is shaping up again to be a depth piece in your drafts with FLEX-worthy appeal right away if Nick Chubb is brought along slowly.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Zach Charbonnet",
    "Team": "SEA",
    "Bye Week": "10",
    "Rank": "38",
    "Points": "141.1",
    "Risk": "3.3",
    "Upside": "5.0",
    "ADP": "11.10",
    "Tier": "8",
    "Outlook": "Charbs had one of the quietest rookie seasons in recent memory for a player we thought would be much more involved. With Kenneth Walker III in the lineup, he averaged just 7.8 opportunities per game. He totaled just two top-24 performances and among 2nd round rookie RBs over the last decade with 100+ touches, his 6.63 PPR points per game is near the bottom. The fact that Seattle used the 52nd overall pick on him in 2023 says they've got a plan to get him touches… we think.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Ty Chandler",
    "Team": "MIN",
    "Bye Week": "6",
    "Rank": "39",
    "Points": "139.7",
    "Risk": "3.7",
    "Upside": "5.2",
    "ADP": "13.04",
    "Tier": "8",
    "Outlook": "Alexander Mattison's efficiency as a runner was a major issue and down the stretch, he lost playing time to Ty Chandler, who looked more explosive with his touches. From Week 10 on, Chandler averaged 14 opportunities including a ridiculous Week 15 game where he totaled 157 yards and was the RB4 on the week. The Vikings decided to cut ties with Mattison leaving Ty Chandler as the projected backup to Aaron Jones. Chandler seems trusted by this regime, so if Jones went down, he is the next man up.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Antonio Gibson",
    "Team": "NE",
    "Bye Week": "14",
    "Rank": "40",
    "Points": "135.3",
    "Risk": "4.0",
    "Upside": "5.0",
    "ADP": "13.11",
    "Tier": "8",
    "Outlook": "Gibson lands in New England as the RB2 behind Rhamondre Stevenson. He signed a three-year deal as a better fit for this Cleveland Browns‘ style offense under new OC Alex Van Pelt. Look, we get it; we’ve been burned before with Gibson. What’s the definition of insanity? Do something over and over again and expect different results? Well, here we are! But…what if I told you Gibson led all RBs in missed tackles forced per attempt? What if I told you he was 21st among qualified RBs in yards per route run? What if I told you he was younger than Rhamondre Stevenson? Yes, all of these things are true. Gibson’s never going to give you another top-12 fantasy season, but at this price, he doesn’t have to in order to be a late round steal considering he’s averaged 41 receptions per season.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Rico Dowdle",
    "Team": "DAL",
    "Bye Week": "7",
    "Rank": "41",
    "Points": "135.1",
    "Risk": "4.0",
    "Upside": "5.7",
    "ADP": "13.02",
    "Tier": "8",
    "Outlook": "Dowdle earned the RB2 job behind Tony Pollard in 2023, but he never really carved out a meaningful role for fantasy, averaging just 6.9 opportunities per game. He's back in Dallas on a one-year deal with a contract that screams \"backup RB.\" While Dowdle was penciled as RB1 following free agency and the NFL Draft, it seemed like this Dallas organization was skeptical that he could handle a full workload. So they brought back old man Ezekiel Elliott. Take a stab at a backfield for one of the best offenses in the NFL hoping Dowdle can fall into the end-zone enough to return RB2/FLEX value.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Trey Benson",
    "Team": "ARI",
    "Bye Week": "11",
    "Rank": "42",
    "Points": "131.6",
    "Risk": "6.0",
    "Upside": "6.3",
    "ADP": "9.10",
    "Tier": "8",
    "Outlook": "As a Day two pick with the size (6’1”, 223 lbs.) and speed (4.39 40-time), the raw tools are there for Benson to be a meaningful fantasy force. James Conner still carries an $8.9 million cap hit and finished 2023 on a tear. He is the team’s RB1 and Benson will have to earn more touches and playing time especially if he doesn’t pick up on pass protection assignments. We saw multiple paths for third round rookie RBs last year. Does Benson sputter behind the veteran (ala Tank Bigsby), become a meaningful compliment (Tyjae Spears), or become an outlier (De’Von Achane)? Nevertheless, we like Benson as a high upside stash for your bench.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Kendre Miller",
    "Team": "NO",
    "Bye Week": "12",
    "Rank": "43",
    "Points": "122.9",
    "Risk": "3.3",
    "Upside": "5.7",
    "ADP": "12.10",
    "Tier": "8",
    "Outlook": "2023 was a lost cause for the rookie Miller who was injured in preseason, missed nine games, and didn’t see meaningful action until the final week of the year. Miller saw 14 opportunities and a TD against the Falcons while Alvin Kamara was absent. He enters the year as a high upside backup for New Orleans with room to grow into a more meaningful role. Miller is one of the better late round lottery ticket RBs we are interested in stockpiling at the end of our drafts.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Chase Brown",
    "Team": "CIN",
    "Bye Week": "12",
    "Rank": "44",
    "Points": "118.5",
    "Risk": "3.3",
    "Upside": "4.7",
    "ADP": "11.04",
    "Tier": "8",
    "Outlook": "The 2023 5th round pick never quite overtook Joe Mixon last year. He saw just two total rush attempts for the first six weeks and then missed the next five weeks with a hamstring injury. From Week 13 on, he averaged nine opportunities per game behind Mixon and while he profiles as a solid pass-catcher, it was clear the team didn’t trust him in pass protection. With the Bengals offense carrying some obvious upside, Brown is a bench stash only and likely waiver wire name to monitor early in the year if Moss were to go down. Until then, know the name and file it away for later.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Tyler Allgeier",
    "Team": "ATL",
    "Bye Week": "12",
    "Rank": "45",
    "Points": "112.8",
    "Risk": "3.3",
    "Upside": "3.7",
    "ADP": "14.01",
    "Tier": "8",
    "Outlook": "Allgeier was a thorn in the side of Bijan Robinson managers last year. Despite Atlanta selecting Bijan 8th overall in the draft, Allgeier still had 209 opportunities and more carries inside the 5-yard line. As Atlanta moves away from a run-heavy approach, his fantasy stock certainly will take a hit. Aside from deeper leagues, he’s nothing more than an insurance back for 2024 with upside if Bijan were shelved for a week or more.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Jaleel McLaughlin",
    "Team": "DEN",
    "Bye Week": "14",
    "Rank": "46",
    "Points": "112.4",
    "Risk": "3.3",
    "Upside": "5.2",
    "ADP": "15.02",
    "Tier": "8",
    "Outlook": "The UDFA burst onto the scene as a jitterbug Sean Payton talked up in the preseason and the speed was evident. He led all RBs in targets per route run (37%) and averaged 5.4 yards per carry. He’ll likely never see more than 10-12 touches in a game but so think of McLaughlin as a Tarik Cohen-type of player. He’s electric with the ball in his hands but his size (5’7”, 187 lbs.) and the depth chart keeps him from being a weekly fantasy asset.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Alexander Mattison",
    "Team": "LV",
    "Bye Week": "10",
    "Rank": "47",
    "Points": "111.9",
    "Risk": "4.0",
    "Upside": "3.0",
    "ADP": "19.12",
    "Tier": "8",
    "Outlook": "How bad was Mattison last year? He became one of only two RBs over the last 20 years with zero rushing TDs on 180+ carries.  He ranked 291st among 300 RBs in fantasy points per opportunity since 2018. We'd gather more stats for you just to emphasize the point of how inefficient he was as a runner in Minnesota but you get the point. He looks like he will be playing second fiddle to Zamir White in this high-T Luke Getsy offense committed to running the ball. He is not exactly on the redraft radar entering the season.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Blake Corum",
    "Team": "LAR",
    "Bye Week": "6",
    "Rank": "48",
    "Points": "110.0",
    "Risk": "5.3",
    "Upside": "5.2",
    "ADP": "10.11",
    "Tier": "8",
    "Outlook": "The rushing TD production from college (45 the last two years) is hard to argue against and we’ve found that the stickiest of stats from college for RBs… is touchdowns. That doesn’t sound very advanced or thought-provoking but if the Rams see Corum as a bowling ball in the mold of Maurice Jones-Drew (one of the few size comps), so be it. For 2024 redraft leagues, he enters the year firmly behind Kyren Williams in our mind as an insurance policy only.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Chuba Hubbard",
    "Team": "CAR",
    "Bye Week": "11",
    "Rank": "49",
    "Points": "109.8",
    "Risk": "3.7",
    "Upside": "3.0",
    "ADP": "12.06",
    "Tier": "8",
    "Outlook": "Chuba came out of nowhere to wrestle away the starting job from Miles “Moneybags” Sanders and morph into a consistent fantasy RB down the stretch. From Week 12 on, he was the RB9 averaging more fantasy points per game (13.3)… than Jahmyr Gibbs (12.9) in that span. Dave Canales’ offensive approach and the team’s investment in multiple offensive guards in free agency should give you some confidence in their commitment to run the football. The 25-year-old is in the final year of his rookie contract and while he could get some early run as the veteran, the team took Jonathon Brooks 43rd overall for a reason.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "MarShawn Lloyd",
    "Team": "GB",
    "Bye Week": "10",
    "Rank": "50",
    "Points": "109.6",
    "Risk": "4.7",
    "Upside": "4.3",
    "ADP": "13.08",
    "Tier": "8",
    "Outlook": "Lloyd’s production profile in college was nothing special but some NFL Draft prognosticators had Lloyd as their top RB in this year’s class. He runs hard with vision and we know Matt LaFleur has preferred a two-back system since he landed in Green Bay. Consider him an insurance back to start the year with massive upside if Josh Jacobs were to miss time with injury.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Roschon Johnson",
    "Team": "CHI",
    "Bye Week": "7",
    "Rank": "51",
    "Points": "106.3",
    "Risk": "3.3",
    "Upside": "3.3",
    "ADP": "17.01",
    "Tier": "8",
    "Outlook": "Roschon never really broke through in his rookie year. He was the team’s least efficient rusher yet still led the team in snaps on third down and snaps in pass protection. At this point, he’s competing with Khalil Herbert for touches on an offense that seems to have moved on without him in mind. In redraft leagues, he’s not on the radar to start the year.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Nick Chubb",
    "Team": "CLE",
    "Bye Week": "10",
    "Rank": "52",
    "Points": "102.5",
    "Risk": "8.7",
    "Upside": "5.7",
    "ADP": "8.05",
    "Tier": "8",
    "Outlook": "Imagine betting against Nick Chubb. He’s averaged a robust 5.3 yards per carry, the second highest ever for a RB with 1000+ carries in their career. He was a top-12 RB for four straight years before dislocating his knee in Week 2 last year. He is an outlier of a human being and yet, fantasy football is a game of probabilities. Can Chubb return from two off-season surgeries and firmly plant himself as RB1 for a Cleveland offense that desperately wants to run the ball? Yes. However, the timetable might be slower than you want for him to return to meaningful fantasy football action. The name recognition in your draft likely won’t match his early production.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Ray Davis",
    "Team": "BUF",
    "Bye Week": "12",
    "Rank": "53",
    "Points": "102.0",
    "Risk": "3.3",
    "Upside": "4.2",
    "ADP": "16.03",
    "Tier": "8",
    "Outlook": "While his age is unparalleled and history says you should bet against RBs this old, Davis is the type of hard-nosed runner who could steal some goal-line looks early on. This Buffalo team was running 33-year-old Latavius Murray out there last year so someone 10 years younger can certainly make a dent in fantasy rosters. Know the name, and file it away if James Cook were to go down.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "J.K. Dobbins",
    "Team": "LAC",
    "Bye Week": "5",
    "Rank": "54",
    "Points": "95.9",
    "Risk": "9.3",
    "Upside": "5.2",
    "ADP": "12.11",
    "Tier": "8",
    "Outlook": "It’s a painful process remembering the ups-and-downs of Dobbins’ career thus far. Last year he looked on track early in Week 1 before a devastating Achilles injury. He reunites with OC Greg Roman on a Chargers team that has made it quite clear they want to run the ball until they’re blue in the face. Gus Edwards was never viewed as the only RB in town with Roman in Baltimore and with Austin Ekeler and Joshua Kelley vacating a combined 360 carries in this backfield, Dobbins can slowly work his way into double-digit touches. Given his injury history, it's unlikely Dobbins returns to the form we saw early in his career.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Tyrone Tracy Jr.",
    "Team": "NYG",
    "Bye Week": "11",
    "Rank": "55",
    "Points": "94.2",
    "Risk": "6.0",
    "Upside": "5.5",
    "ADP": "16.01",
    "Tier": "8",
    "Outlook": "There is some intrigue here as the former college WR at Iowa converted to RB at Purdue. Before you have visions of Antonio Gibson, Tracy is extremely old (24) playing 6(!) total seasons in college and his day three draft capital says he will have a hard time carving out a valuable role for fantasy.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "D'Onta Foreman",
    "Team": "CLE",
    "Bye Week": "10",
    "Rank": "56",
    "Points": "92.2",
    "Risk": "3.3",
    "Upside": "3.7",
    "ADP": "21.08",
    "Tier": "8",
    "Outlook": "Every year Foreman creeps into the fantasy scene as a one-man wrecking crew… for about two games. He has seven games of 15+ fantasy points over the last three years which also happens to be as many as Javonte Williams. Foreman needs the seas to part for a bigger workload in Cleveland but he’s always lurking to take over a game or two.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Khalil Herbert",
    "Team": "CHI",
    "Bye Week": "7",
    "Rank": "57",
    "Points": "90.8",
    "Risk": "3.3",
    "Upside": "2.7",
    "ADP": "17.03",
    "Tier": "8",
    "Outlook": "It was a good little run for the former 5th round pick. Over the last three years, he ranks seventh among all running backs in yards per carry (4.9 YPC) and 10th in 15+ yard rush rate (12.0%). However, the Bears made it clear with their actions they wanted an upgrade bringing in D’Andre Swift with a multi-year deal. Herbert is a late round flier at the RB position who likely will still be competing with Roschon Johnson for touches if something were to happen to Swift.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Kenneth Gainwell",
    "Team": "PHI",
    "Bye Week": "5",
    "Rank": "58",
    "Points": "90.8",
    "Risk": "3.0",
    "Upside": "2.7",
    "ADP": "24.01",
    "Tier": "8",
    "Outlook": "The latest and greatest hits from Kenny G are as unpredictable as they come in year four. One week he can give you FLEX worthy production and the next he’s just chilling on the sidelines. He takes a major backseat with Saquon Barkley in town.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Clyde Edwards-Helaire",
    "Team": "KC",
    "Bye Week": "6",
    "Rank": "59",
    "Points": "82.2",
    "Risk": "3.7",
    "Upside": "2.7",
    "ADP": "19.05",
    "Tier": "8",
    "Outlook": "Once the hand-picked 1st round pick of Mahomes, the team did bring CEH back for another year for what feels like pity. He had only three relevant fantasy weeks where he saw more than seven opportunities and you can expect much of the same behind Isiah Pacheco this year.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Kimani Vidal",
    "Team": "LAC",
    "Bye Week": "5",
    "Rank": "60",
    "Points": "79.4",
    "Risk": "5.5",
    "Upside": "4.3",
    "ADP": "15.05",
    "Tier": "9",
    "Outlook": "Vidal is gaining steam this off-season as a threat to gain touches in the Chargers backfield. At the NFL Combine, he ran 4.46, which gives him the size/speed combo we’re looking for if we’re going to throw some darts at later-round RBs. 6th round guys rarely pay off but the scheme is what we mostly are keying in on. Know the name and listen to the camp reports this summer to see if Vidal moves up the depth chart.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Dameon Pierce",
    "Team": "HOU",
    "Bye Week": "14",
    "Rank": "61",
    "Points": "78.5",
    "Risk": "3.3",
    "Upside": "3.3",
    "ADP": "19.01",
    "Tier": "9",
    "Outlook": "If you are bored, ask AI to make sense of Dameon Pierce. From heralded rookie to hyped sophomore, he now is a name at your draft you’ll wholeheartedly laugh about. The Texans moved on from him during the 2023 season, passing the rock to Devin Singletary before emphatically dunking on Pierce in the off-season by trading for veteran Joe Mixon and signing him to a three-year deal. His involvement in the game plan should be minimal as the meetings for Pierce truthers are currently on hiatus.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Miles Sanders",
    "Team": "CAR",
    "Bye Week": "11",
    "Rank": "62",
    "Points": "75.7",
    "Risk": "5.0",
    "Upside": "3.0",
    "ADP": "24.09",
    "Tier": "9",
    "Outlook": "Hold the bag… you might be reaching for a barf bag but let’s talk about the bag of cash the Carolina Panthers gave Sanders just one year ago. The 4-year deal with $13 million guaranteed was supposed to dictate them handing him the rock, but after just one TD through the first month and a shoulder injury in Week 5, he sat behind Chuba Hubbard and averaged less than 30 total yards per game for the rest of the year. The 27-year-old RB finds himself buried on the depth chart and out of favor with a new coaching regime.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Samaje Perine",
    "Team": "DEN",
    "Bye Week": "14",
    "Rank": "63",
    "Points": "71.0",
    "Risk": "4.3",
    "Upside": "1.7",
    "ADP": "25.12",
    "Tier": "9",
    "Outlook": "You wouldn’t know it but Perine caught 50 passes last year as the do-it-all back for the Broncos. He was mostly utilized on third downs, spelling Javonte Williams and mixing in with Jaleel McLaughlin. This is a crowded backfield with 5th rounder Audric Estimé now in town. He holds no stand alone fantasy value yet it wouldn’t be surprising if he steals 7+ touches per game.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Tank Bigsby",
    "Team": "JAX",
    "Bye Week": "12",
    "Rank": "64",
    "Points": "69.9",
    "Risk": "5.0",
    "Upside": "2.3",
    "ADP": "20.11",
    "Tier": "9",
    "Outlook": "The Jags used a third round pick on Tank Bigsby last year...to only give him 50 total carries on the year. He had the lowest rush success rate among qualifying RBs and caught exactly one more pass than your grandmother. Perhaps he pops up as a waiver add at some point if Etienne misses time but it was an abysmal rookie year for a player we thought would have a bigger impact.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Braelon Allen",
    "Team": "NYJ",
    "Bye Week": "12",
    "Rank": "65",
    "Points": "68.4",
    "Risk": "4.0",
    "Upside": "3.7",
    "ADP": "16.09",
    "Tier": "9",
    "Outlook": "If you played in college fantasy football (also known as devy), Allen looked like the next big thing. The mammoth man child (6’1”, 235 lbs.) crushed at Wisconsin as a freshman and now will be the first RB ever to play his entire rookie season before 21. Oh, but there’s just one small problem: he’ll be stuck behind Breece Hall. With a slingshot and a stone plucked from the river, Allen’s day three draft capital struck down any giant-sized dreams fantasy managers might’ve had for the rookie.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Evan Hull",
    "Team": "IND",
    "Bye Week": "14",
    "Rank": "66",
    "Points": "52.9",
    "Risk": "4.3",
    "Upside": "3.0",
    "ADP": "26.12",
    "Tier": "10",
    "Outlook": "Do you remember Evan Hull’s rookie year? He saw two opportunities in Week 1 before suffering a season-ending meniscus injury. He is an able pass-catcher and could mix in some third downs while backing up Jonathan Taylor. Regardless, he is not roster worthy in redraft leagues to start the year.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Elijah Mitchell",
    "Team": "SF",
    "Bye Week": "9",
    "Rank": "67",
    "Points": "52.2",
    "Risk": "4.7",
    "Upside": "5.3",
    "ADP": "16.09",
    "Tier": "10",
    "Outlook": "The “Missile” finished the year out for a banged-up Christian McCaffrey with two rushing TDs in the final two weeks as the team prepared for their playoff run. He surpassed four opportunities just four times previously and remains just another 49ers RB in Kyle Shanahan’s armory. The drafting of Isaac Guerendo in the 4th round brings more competition to a depth chart that is truly hidden behind CMC.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Chase Edmonds",
    "Team": "TB",
    "Bye Week": "11",
    "Rank": "68",
    "Points": "51.4",
    "Risk": "3.7",
    "Upside": "1.7",
    "ADP": "48.07",
    "Tier": "10",
    "Outlook": "The 28 year old signed a one-year deal with $825,000 guaranteed to simply take up space and wear an NFL jersey. Sitting firmly behind Rachaad White and competing with rookie Bucky Irving, Edmonds is a depth piece who missed his window of opportunity years ago on Miami. Remember that fun off-season?",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Bucky Irving",
    "Team": "TB",
    "Bye Week": "11",
    "Rank": "69",
    "Points": "51.1",
    "Risk": "4.0",
    "Upside": "2.7",
    "ADP": "16.11",
    "Tier": "10",
    "Outlook": "Pass-catching whiz Bucky Irving was selected in Round 4 as one of only two RBs in FBS to collect 50+ passes last year. He is tiny (5’9”, 192) so expecting him to take over the entire backfield if Rachaad White were injured is a bit of a leap. In full PPR leagues, take note but he still should not be on the redraft radar.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Jamaal Williams",
    "Team": "NO",
    "Bye Week": "12",
    "Rank": "70",
    "Points": "41.9",
    "Risk": "3.3",
    "Upside": "2.0",
    "ADP": "26.07",
    "Tier": "10",
    "Outlook": "Jamaal is off the redraft radar for most leagues in 2024.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Jaylen Wright",
    "Team": "MIA",
    "Bye Week": "6",
    "Rank": "71",
    "Points": "41.6",
    "Risk": "5.0",
    "Upside": "4.3",
    "ADP": "12.03",
    "Tier": "10",
    "Outlook": "Wright was the fifth RB taken in the NFL Draft as HC Mike McDaniel made it abundantly clear what this team wants: speed, speed, speed. It is a crowded backfield behind Raheem Mostert and De’Von Achane but as we’ve seen with this team, they are willing to hand the rock to whoever is able bodied. Wright showed out at the NFL Combine, solidifying what we saw on his college tape: a RB who can create big plays thanks to his explosiveness and speed. He will have to earn his stripes as he begins the year as nothing more than a speculative dart throw in redraft leagues.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Eric Gray",
    "Team": "NYG",
    "Bye Week": "11",
    "Rank": "72",
    "Points": "41.3",
    "Risk": "3.0",
    "Upside": "2.0",
    "ADP": "25.09",
    "Tier": "10",
    "Outlook": "Gray will be competing with rookie Tyrone Tracy Jr. for backfield touches behind free agent signee Devin Singletary. Gray does have the size to make some noise in the red zone but this Giants team also might never make it to that point of the field. He saw just 17 carries as a rookie last year so there isn't much to go off of at this point.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Keaton Mitchell",
    "Team": "BAL",
    "Bye Week": "14",
    "Rank": "73",
    "Points": "36.7",
    "Risk": "6.0",
    "Upside": "3.7",
    "ADP": "19.09",
    "Tier": "10",
    "Outlook": "He burned too bright! Mitchell led all NFL RBs in yards after contact per attempt and ranked 2nd in fantasy points per opportunity. He did not register a carry until Week 9 and had a season-ending knee injury in Week 14… YET, he has more total 20+ yard runs over the last three years than Alvin Kamara. However, the combination of him being undrafted + his ACL injury is not a good forecast for his future. He will likely start the 2024 season on the PUP and isn't worth rostering with Derrick Henry in town.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Isaac Guerendo",
    "Team": "SF",
    "Bye Week": "9",
    "Rank": "74",
    "Points": "13.1",
    "Risk": "3.0",
    "Upside": "6.0",
    "ADP": "21.05",
    "Tier": "10",
    "Outlook": "Guerendo's production profile leaves a lot to be desired, but he turned heads at the Combine. In case you forgot, Guerendo ran the fastest 40-yard dash of any 220+ pound RB since 2003. Know the name and the situation but apart from a CMC injury (dear God no!), he likely should be hanging out on waiver wires.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  }
]