[
  {
    "Name": "Tyreek Hill",
    "Team": "MIA",
    "Bye Week": "6",
    "Rank": "1",
    "Points": "358.4",
    "Risk": "1.3",
    "Upside": "9.3",
    "ADP": "1.04",
    "Tier": "1",
    "Outlook": "171 targets with this guy’s speed and ability…my goodness. Hill was unreal last season, posting 3.82 yards per route run en route to the WR2 overall finish. For context anything north of 2.0 yards per route run is considered great. You could argue the efficiency will come down a bit after that outlier season, but we still expect Hill to dominate once again as the central figure in Mike McDaniel’s high-flying offense. He’s an easy top-five pick in fantasy drafts once again this year.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "CeeDee Lamb",
    "Team": "DAL",
    "Bye Week": "7",
    "Rank": "2",
    "Points": "357.3",
    "Risk": "3.0",
    "Upside": "9.7",
    "ADP": "1.03",
    "Tier": "1",
    "Outlook": "Alpha. That’s what Lamb was in 2023 when he was the engine of the Dallas offense. Among all WRs, Lamb ranked #1 in both targets and catches while finishing the year as the WR2 in fantasy points per game. He is as good of a bet as anyone to lead the league in receiving in 2024 and a no-brainer top-five fantasy pick given the lack of target competition and mind-meld connection with Dak.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Amon-Ra St. Brown",
    "Team": "DET",
    "Bye Week": "5",
    "Rank": "3",
    "Points": "329.3",
    "Risk": "1.0",
    "Upside": "9.3",
    "ADP": "1.06",
    "Tier": "2",
    "Outlook": "All St. Brown has done since he entered the NFL is produce at an extremely high level. Coming off a year in which he banked the WR3 overall finish on the back of 164 targets and a career high 1,500 yards, the Sun God is here to stay as the top weapon in Detroit’s potent offensive attack. His skill set fits perfectly with today’s game, and Jared Goff looks for him over the middle of the field as the first read in the offense. We are on board with St. Brown as an obvious Round 1 fantasy pick, especially in any PPR type of format.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Ja'Marr Chase",
    "Team": "CIN",
    "Bye Week": "12",
    "Rank": "4",
    "Points": "306.4",
    "Risk": "3.0",
    "Upside": "9.7",
    "ADP": "1.06",
    "Tier": "2",
    "Outlook": "A top-three talent at the WR position in the NFL, Chase is well worth an early first-round investment in fantasy drafts and one of the few players who could finish as the WR1 come season end. Burrow is back, and we expect the team to be one of the most pass-heavy offenses in the league. After setting a career-high in receptions last year with 100 catches, Chase not only has the floor we look for in fantasy, but the ceiling to be a legit difference maker for your squad.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Justin Jefferson",
    "Team": "MIN",
    "Bye Week": "6",
    "Rank": "5",
    "Points": "303.4",
    "Risk": "3.0",
    "Upside": "9.7",
    "ADP": "1.04",
    "Tier": "3",
    "Outlook": "Jefferson was in the conversation for the 1.01 last year, but sadly, he didn’t live up to those lofty expectations due to a serious hamstring injury that cost him eight weeks. For reference of how elite this guy can be, he averaged 11.4 targets per game in the eight games where he started and finished the game. Sure, Kirk Cousins is now in Atlanta, and J.J. McCarthy is an unproven rookie QB, but this guy is one of, if not the, most talented WR in the league. We fully expect head coach Kevin O’Connell to once again absolutely pepper this guy with targets and whenever that happens with a talent like JJetts, good things usually happen.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "A.J. Brown",
    "Team": "PHI",
    "Bye Week": "5",
    "Rank": "6",
    "Points": "301.0",
    "Risk": "2.8",
    "Upside": "9.2",
    "ADP": "1.10",
    "Tier": "3",
    "Outlook": "Remember that start to the year? My goodness, A.J. Brown was looking like a league winner, a candidate to finish as the overall WR1 in fantasy, and a legit Offensive Player of the Year candidate. Unfortunately, as the Eagles’ offense looked inept over the final six weeks, Brown’s fantasy performance took a massive hit and fizzled out down the stretch. We know the talent is there, he’s still in his prime, and under new OC Kellen Moore, the Eagles should be up-tempo and throw at an elevated rate. If we get anything close to what we saw in the first half of the season, Brown is well worth his ADP.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Garrett Wilson",
    "Team": "NYJ",
    "Bye Week": "12",
    "Rank": "7",
    "Points": "278.8",
    "Risk": "5.0",
    "Upside": "8.8",
    "ADP": "1.11",
    "Tier": "4",
    "Outlook": "Wilson finishing last year with over 1,000 yards is honestly an impressive feat considering he was playing with QBs who will be crushing it in the UFL in a year or two. Please, Aaron Rodgers, stay healthy. If he does, we expect Wilson to push for top-10 numbers this year. Once again, count us in on the hype train with one of the NFL’s most talented receivers.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Puka Nacua",
    "Team": "LAR",
    "Bye Week": "6",
    "Rank": "8",
    "Points": "274.8",
    "Risk": "3.3",
    "Upside": "9.0",
    "ADP": "1.11",
    "Tier": "4",
    "Outlook": "Oh ya know, no big deal. Just the best fantasy season from a rookie WR of ALL TIME! Puka was sensational last season, especially considering he wasn’t even selected in the NFL Draft until day three and went undrafted in the majority of fantasy leagues. The secret is out now; Puka is the top option in the Rams passing game. He bested Kupp in targets per game, yards per route run, and first-read target share last season. Sure, Kupp will have his moments and have his games, but Puka looks like the alpha now. It’ll probably cost you a first-round pick, but after what we saw last year, he definitely deserves it.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Davante Adams",
    "Team": "LV",
    "Bye Week": "10",
    "Rank": "9",
    "Points": "271.6",
    "Risk": "6.3",
    "Upside": "7.5",
    "ADP": "2.06",
    "Tier": "4",
    "Outlook": "Adams has been incredible for the last decade, but it’s very fair to wonder if he's at least started to decline. After all, he turns 32 years old in December, and his peripheral efficiency metrics suggest he’s not the player he was even three years ago. His yards per route run, yards after the catch per reception and yards per target have all dropped in three straight years. Adams is still going to see a boatload of targets in this offense, but perhaps he doesn’t have the ceiling he once had.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Marvin Harrison Jr.",
    "Team": "ARI",
    "Bye Week": "11",
    "Rank": "10",
    "Points": "262.3",
    "Risk": "4.0",
    "Upside": "8.7",
    "ADP": "2.03",
    "Tier": "4",
    "Outlook": "Even as a rookie, we expect Marvin Harrison Jr. to be the alpha in this offense right away. Arizona simply doesn’t have someone capable of stealing meaningful targets away from the 4th overall pick. Sure, Trey McBride will get looks over the middle of the field, but Harrison can win at all three levels and in our eyes, a lock to finish as a top-20 fantasy option barring injury. He might be going as the highest drafted rookie WR in fantasy football history according to ADP but that isn’t stopping us from taking him there. Believe the hype.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Chris Olave",
    "Team": "NO",
    "Bye Week": "12",
    "Rank": "11",
    "Points": "260.0",
    "Risk": "3.7",
    "Upside": "8.2",
    "ADP": "2.07",
    "Tier": "4",
    "Outlook": "Olave quietly has some of the softest target competition in the league entering 2024, and we know the talent and pedigree are there for him to capitalize. Prayers up for the Saints offense as they finally transition from the stone age and incorporate more pre-snap motion with new OC Klint Kubiak. If he can take that Year 3 leap and truly become an alpha WR1 in the league, he’s a sneaky candidate to finish as a top-10 fantasy WR if things break right.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Jaylen Waddle",
    "Team": "MIA",
    "Bye Week": "6",
    "Rank": "12",
    "Points": "252.1",
    "Risk": "3.8",
    "Upside": "7.3",
    "ADP": "3.12",
    "Tier": "5",
    "Outlook": "It was the Tyreek Hill show in 2023 as Waddle took a bit of a back seat. For reference, Hill saw a 32.7% target share compared to Waddle’s 24% market share. We do expect Hill to once again be the top option, but Waddle’s cheaper this year than he was in drafts a year ago, yet we know the talent and upside is immense. There aren’t a lot of players going around him in drafts who can win you a matchup, and if Tyreek were to miss any time, Waddle would be a top-10 play every single week.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Mike Evans",
    "Team": "TB",
    "Bye Week": "11",
    "Rank": "13",
    "Points": "250.7",
    "Risk": "4.7",
    "Upside": "7.7",
    "ADP": "3.05",
    "Tier": "6",
    "Outlook": "Andy’s “My Guy” last year! Evans was a smash and a real difference-maker for fantasy as one of the best values in all of football last season. Now entering his age 31 season, Evans might not repeat what he did last year (over 1,200 yards and 13 TD). But, this target tree should be condensed to Evans and Godwin and we expect him to once again finish the year with over 1,000 yards, something he’s done in 10 straight years!",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Drake London",
    "Team": "ATL",
    "Bye Week": "12",
    "Rank": "14",
    "Points": "250.5",
    "Risk": "4.7",
    "Upside": "8.2",
    "ADP": "2.06",
    "Tier": "6",
    "Outlook": "All aboard! The hype train is officially out of control with London now that he has an actual QB under center, but we get it. The archaic Arthur Smith offense is gone, Desmond Ridder is holding a clipboard elsewhere and London is entering year three when we see some massive breakouts from elite young prospects. Under this new regime with Kirk Cousins, we should see a massive spike in pass rate for the Falcons, which means London is set to log career highs in targets, yards and TDs.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Deebo Samuel Sr.",
    "Team": "SF",
    "Bye Week": "9",
    "Rank": "15",
    "Points": "249.2",
    "Risk": "6.0",
    "Upside": "8.5",
    "ADP": "3.09",
    "Tier": "6",
    "Outlook": "Deebo missed Weeks 7-8 with a shoulder injury but after the Week 9 bye, he went on an absolute tear and helped fantasy managers make a push for the playoffs. From Weeks 10-17, Samuel was fantasy’s WR2 behind only CeeDee Lamb. For context, only four WRs averaged 18+ fantasy points per game in that sample - Lamb, Deebo, Keenan Allen, and Tyreek Hill. We know the skill guys will have their ups and downs week-to-week with so many mouths to feed, but there aren’t many offenses who can score 30+ real-life points every week. We’re comfortable living with the down weeks knowing Deebo can win you your week any time he steps on the field.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "DK Metcalf",
    "Team": "SEA",
    "Bye Week": "10",
    "Rank": "16",
    "Points": "248.4",
    "Risk": "3.8",
    "Upside": "7.5",
    "ADP": "4.08",
    "Tier": "6",
    "Outlook": "At this stage of their respective careers, Metcalf is the obvious target over Lockett. He’s in his prime at 26 years old and could really take a big step forward in earning a hefty target share with Lockett at the tail end of his career. Even after a 1,100-yard season with eight scores, Metcalf left a lot of meat on the bone so to speak last season with his lowest catch rate of his career. If he and Geno can connect on a few more deep targets, he has top-12 upside.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Nico Collins",
    "Team": "HOU",
    "Bye Week": "14",
    "Rank": "17",
    "Points": "247.4",
    "Risk": "5.0",
    "Upside": "7.7",
    "ADP": "3.05",
    "Tier": "6",
    "Outlook": "What a year three breakout it was for Nico Collins. How good? Only three WRs logged a yards per route run rate of 3+ during the regular season - Tyreek Hill, Brandon Aiyuk and Nico Collins. Yup, that’ll work! Collins exploded down the stretch after Tank Dell’s injury and he was a key cog in their playoff run. We expect him to have a great season, but it is fair to wonder if the target count comes down a little bit with Diggs in town and Tank Dell now healthy.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Michael Pittman Jr.",
    "Team": "IND",
    "Bye Week": "14",
    "Rank": "18",
    "Points": "246.0",
    "Risk": "3.7",
    "Upside": "7.3",
    "ADP": "4.02",
    "Tier": "6",
    "Outlook": "Pitty City…so back, baby! A PPR machine last season, Pittman averaged just under seven catches per game as the first-read in Shane Steichen’s RPO offense. We expect him to yet again be the alpha here and command a healthy target share. Playing in an offense with a great RB in Jonathan Taylor and one of the most electric runners at the position in Anthony Richardson, it might be tough for Pittman to find his way to 8+ TDs in a season. That could cap the upside a bit, but he’s a solid and consistent WR2 for your squad.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "DeVonta Smith",
    "Team": "PHI",
    "Bye Week": "5",
    "Rank": "19",
    "Points": "245.7",
    "Risk": "3.0",
    "Upside": "7.8",
    "ADP": "4.09",
    "Tier": "6",
    "Outlook": "Smith’s 2023 season felt like a bit of a disappointment relative to expectations following the WR10 finish in 2022. It certainly didn’t help that watching this Eagles offense in November and December made you want to vomit every Sunday. With a full offseason to take a step back and evaluate Smith, he probably was a bit overvalued in ADP last season. Now, his cost in drafts is down after failing to live up to the hype of 2023, making him a fantastic target as a rock-solid WR2 who could explode in the event of an A.J. Brown injury.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Brandon Aiyuk",
    "Team": "SF",
    "Bye Week": "9",
    "Rank": "20",
    "Points": "244.8",
    "Risk": "4.7",
    "Upside": "7.3",
    "ADP": "2.11",
    "Tier": "7",
    "Outlook": "Aiyuuuuuuken! Brandon Aiyuk was one of the best values in fantasy drafts last year, finishing the season as the WR14 on the back of a career high 1300 yards. How good was Aiyuk last year? His 3.01 yards per route run was one of the best YPRR seasons of all time. On top of that, he led all wideouts in fantasy points per target and over 80% of his catches went for a first down or a TD, which was the highest rate for any WR over the last five seasons. This offense is one of the most efficient in the league, but there are some warning signs here that Aiyuk could regress a little bit after a historic efficiency year.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Tank Dell",
    "Team": "HOU",
    "Bye Week": "14",
    "Rank": "21",
    "Points": "244.6",
    "Risk": "5.3",
    "Upside": "7.7",
    "ADP": "5.06",
    "Tier": "7",
    "Outlook": "Entering the league, Dell was a prospect who was knocked due to his slight frame. This dude proved everyone wrong and was fantastic as a rookie, running routes at all three levels of the field from both the perimeter and the slot. The yards per route run numbers (2.22) say Dell is a legit talent, and we love betting on middle-round WRs entering year two in the league. The hit rate on this cohort has been really strong over the years, so even though it doesn’t exactly feel clean given the target competition with Nico and Diggs, Dell is a really talented WR who could outperform his ADP if things break right. Call us crazy, but we want pieces of this Texans offense, and Tank could be the cheapest way to get your Houston exposure.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "DJ Moore",
    "Team": "CHI",
    "Bye Week": "7",
    "Rank": "22",
    "Points": "244.2",
    "Risk": "4.3",
    "Upside": "7.0",
    "ADP": "3.11",
    "Tier": "7",
    "Outlook": "Moore was sensational in his first season in Chicago, posting career highs in targets, yards, and receiving TDs en route to the WR6 finish, but things look a little different this season. Not only does his target competition go from Darnell Mooney and Equanimeous St. Brown to Keenan Allen and 9th overall pick, Rome Odunze, he’s also set to play with a rookie QB in Caleb Williams. While we like Williams and think he’s a good bet to succeed, there is a lot more volatility to Moore’s outlook in 2024 playing next to an unproven QB with more talented teammates. He slides into WR2 territory.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "George Pickens",
    "Team": "PIT",
    "Bye Week": "9",
    "Rank": "23",
    "Points": "241.2",
    "Risk": "5.0",
    "Upside": "7.7",
    "ADP": "5.06",
    "Tier": "7",
    "Outlook": "Pickens played four games last year without Diontae Johnson. In those contests, Pickens averaged a 28% target share with 3.0 yards per route run and just over 16 fantasy points per game. Sure, it’s an incredibly small sample size, but it just shows he can produce as the WR1 if the opportunity is there. Expect Pickens to be a boom-bust WR this year with the QB concerns and the low-volume passing offense. We like him more as your WR3 who can provide those boom weeks for your squad.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Cooper Kupp",
    "Team": "LAR",
    "Bye Week": "6",
    "Rank": "24",
    "Points": "237.8",
    "Risk": "5.3",
    "Upside": "7.5",
    "ADP": "4.06",
    "Tier": "7",
    "Outlook": "Kupp’s 2023 season went off the rails thanks to a hamstring injury suffered during training camp. He missed Weeks 1-4 then had an up-and-down year for his standards. With Puka emerging as the top option, Kupp doesn’t have the same ceiling he once had entering his age 31 season, but look no further than his 8/115/1 and 8/111/1 stat lines in Weeks 14 and 15 as an example of the type of weekly upside he still has in this offense. For as bad of a season as it was for his standards, Kupp still averaged north of 2.0 yards per route run, proving he still has something left in the tank. He could be a value if the targets end up being more evenly distributed between Puka and Kupp.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Amari Cooper",
    "Team": "CLE",
    "Bye Week": "10",
    "Rank": "25",
    "Points": "235.9",
    "Risk": "4.3",
    "Upside": "7.8",
    "ADP": "5.10",
    "Tier": "7",
    "Outlook": "Is Amari Cooper a value in drafts? It feels like once again, no one is excited to draft Cooper despite the fact that he’s coming off a year in which he went for over 1,200 yards. All the dude has done over the last two years in Cleveland is finish as the WR9 and WR18. Expect him to slip a bit in drafts this year, and when he does, scoop him up as your WR3. We know he can still put up monstrous weeks - just ask the guy in your league who faced him in Week 16 last year.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Malik Nabers",
    "Team": "NYG",
    "Bye Week": "11",
    "Rank": "26",
    "Points": "232.8",
    "Risk": "6.3",
    "Upside": "7.5",
    "ADP": "4.02",
    "Tier": "7",
    "Outlook": "The Giants’ WR room is a mess behind Nabers, and Danny Dimes is coming off a torn ACL. It could certainly be a bit of a bumpy ride for him as a rookie with so many moving parts, but the target competition here is virtually non-existent and Nabers is an extremely talented prospect. He could really emerge down the stretch and give you big-time PPR stat lines if he’s as talented as the NFL Draft capital and production profile suggest.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Tee Higgins",
    "Team": "CIN",
    "Bye Week": "12",
    "Rank": "27",
    "Points": "231.8",
    "Risk": "6.0",
    "Upside": "7.5",
    "ADP": "5.09",
    "Tier": "8",
    "Outlook": "The Bengals offense was broken last year, so it may be difficult to remember how good Higgins was early in his career. After playing just 12 games last season while battling a hamstring injury, Tee was a complete bust in fantasy. Yes, Ja’Marr is the alpha here, but Tee was the WR17 and WR22 in 2021 and 2022 prior to this lost season. We’re still believers in his talent, and we know the Bengals want to chuck it all over the yard. Look for Higgins to put up WR2 numbers with the upside to post top-12 numbers should anything happen to Chase.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Christian Kirk",
    "Team": "JAX",
    "Bye Week": "12",
    "Rank": "28",
    "Points": "227.5",
    "Risk": "3.0",
    "Upside": "6.5",
    "ADP": "6.03",
    "Tier": "8",
    "Outlook": "Prior to suffering a groin injury (ACK!) in Week 13, Kirk was the WR23 in fantasy. He sort of feels like the new Tyler Lockett - an undervalued veteran WR who’s a strong bet to beat his ADP most seasons. With Calvin Ridley out the door and Zay Jones now in Arizona, this offense vacates the league’s fifth-highest WR target share and the second-highest air yards share. In other words, if Gabe Davis does Gabe Davis things and disappears at times and Brian Thomas Jr. doesn’t hit in year one as a rookie, Kirk could see a ton of volume in this offense. Among the WRs currently on the squad, his 21.5% targets per route run rate is easily the highest on this team. He’s not a sexy pick, but he’s a high floor WR2/3 for your squad.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Calvin Ridley",
    "Team": "TEN",
    "Bye Week": "5",
    "Rank": "29",
    "Points": "216.7",
    "Risk": "6.2",
    "Upside": "7.2",
    "ADP": "7.07",
    "Tier": "8",
    "Outlook": "Everyone in the NFL thought Ridley would be back in Jacksonville, but the Titans swooped in at the last minute and backed up the Brinks truck for him, giving him a 4-year deal worth $92 million. He’s obviously not the player he was back in his prime in Atlanta, but it’s clear the team still valued him as a true WR1. He’s 29 years old and coming off a solid 1,000-yard season with 8 TDs. Anything close to that with Will Levis would be a win for fantasy, but we don’t see a huge ceiling for a player like this given the QB situation and career arc trajectory.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Keenan Allen",
    "Team": "CHI",
    "Bye Week": "7",
    "Rank": "30",
    "Points": "214.2",
    "Risk": "4.8",
    "Upside": "6.5",
    "ADP": "5.11",
    "Tier": "8",
    "Outlook": "Eat it, Father Time! Allen is 32 years old and entering Year 12 in the NFL. You wouldn’t know it after watching him in 2023 when he was an absolute target hog, earning over 11 targets per game in LA. Among WRs who saw 50+ targets last year, he was 11th in the NFL in yards per route and still playing at an extremely high level. We usually don’t love targeting veteran WRs changing teams this late in their career, especially playing with a rookie QB, but it is certainly possible Keenan is a value once again this season, especially in full PPR formats. Consider him a WR3/FLEX.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Stefon Diggs",
    "Team": "HOU",
    "Bye Week": "14",
    "Rank": "31",
    "Points": "214.1",
    "Risk": "6.7",
    "Upside": "7.7",
    "ADP": "3.06",
    "Tier": "8",
    "Outlook": "Will the real Stefon Diggs please stand up? From Weeks 1-7, he looked like the same player he’s been for years - a dominant WR1 for fantasy. The back half of the year? Irrelevant for fantasy football. It’s wild given the stark difference from the first half compared to the second, but it is a reminder that even the elite players fall off eventually. We don’t think Diggs is done, but he is entering his age 31 season and he is going from a situation in Buffalo where he was the no-question alpha to a situation in Houston where he’ll compete with two studs in Nico Collins and Tank Dell for targets. There are a wide range of outcomes here.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Terry McLaurin",
    "Team": "WAS",
    "Bye Week": "14",
    "Rank": "32",
    "Points": "213.2",
    "Risk": "4.7",
    "Upside": "6.5",
    "ADP": "6.10",
    "Tier": "8",
    "Outlook": "Scary Terry has always been a talented WR, but he’s now entering his age 29 season and has finished on average as the WR23. At this point in a player’s career, you sort of know what you’re going to get - fringe WR2/3 fantasy production and probably not much more, especially with a mobile rookie QB under center. Unless Jayden Daniels is the next rookie QB phenom, don’t expect McLaurin to all of a sudden start producing big numbers.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Zay Flowers",
    "Team": "BAL",
    "Bye Week": "14",
    "Rank": "33",
    "Points": "210.5",
    "Risk": "3.7",
    "Upside": "6.2",
    "ADP": "5.02",
    "Tier": "8",
    "Outlook": "Flowers’ usage last year was a bit all over the map, but he definitely showed he can play in this league and produce for fantasy. To start the year, a lot of his targets were coming close to the line of scrimmage, but as the season went on, he started to see more downfield looks. A versatile weapon in a good offense, expect Flowers to be a popular breakout candidate in the fantasy community, and for good reason. We like him more as a WR2/3 for your fantasy squad.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Jayden Reed",
    "Team": "GB",
    "Bye Week": "10",
    "Rank": "34",
    "Points": "210.1",
    "Risk": "3.7",
    "Upside": "6.5",
    "ADP": "7.02",
    "Tier": "8",
    "Outlook": "Reed is one of the more polarizing players in fantasy entering 2024. He showed you everything you hoped you’d see in year one with 2.05 yards per route run, yet he completely disappeared in the playoffs in favor of guys like Romeo Doubs, Dontayvion Wicks and the tight ends. Our fear with Reed is that the Packers could view him as a slot-only WR, and most of his big games came with Christian Watson sidelined. That said, there is no denying the talent is there. Expect him to be a popular breakout candidate among the fantasy community entering 2024.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Diontae Johnson",
    "Team": "CAR",
    "Bye Week": "11",
    "Rank": "35",
    "Points": "207.3",
    "Risk": "4.3",
    "Upside": "5.3",
    "ADP": "8.09",
    "Tier": "8",
    "Outlook": "For years in Pittsburgh, Johnson was a target hog, averaging 10.1 targets per game with Big Ben. Unfortunately, we saw the production really fall off with Kenny Pickett under center over the last couple of years. The talent is still there, and he is only 28 years old, but we have major question marks about his new QB in Bryce Young. Given the perception around Young and the Panthers, Johnson could be a value similar to Thielen last year, but we’re not expecting him to be a league winner in 2024.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Jaxon Smith-Njigba",
    "Team": "SEA",
    "Bye Week": "10",
    "Rank": "36",
    "Points": "202.2",
    "Risk": "5.7",
    "Upside": "6.8",
    "ADP": "9.03",
    "Tier": "9",
    "Outlook": "Smith-Njigba was a first round pick for Seattle last year and the year played out kind of how we expected - he was stuck behind Metcalf and Lockett for playing time and targets, and as a result, the fantasy season wasn’t anything to write home about. The real issue was the horrendous 6.4-yard average depth of target. In fact, he led all players in percentage of targets behind the line of scrimmage and simply put, it’s really hard to score fantasy points like that. Now with a new coaching staff and scheme change, maybe they open up the playbook for JSN to win downfield. That said, as long as Metcalf and Lockett are healthy, the ceiling will probably be capped for JSN in year two.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "DeAndre Hopkins",
    "Team": "TEN",
    "Bye Week": "5",
    "Rank": "37",
    "Points": "201.1",
    "Risk": "5.3",
    "Upside": "6.0",
    "ADP": "8.06",
    "Tier": "9",
    "Outlook": "Can Will Levis support two top-36 WRs? If you don’t believe so, you should be avoiding one of, or both of Nuk and Ridley in drafts. If you believe in “Banana-Rama” and a resurgence in Tennessee's passing game with the new regime, then Nuk could be a value. Unfortunately, he’s now 32 years old, and the target competition is a lot more difficult with Ridley and Tyler Boyd in town. While he was pretty good last year from an efficiency standpoint, it’s definitely possible we look back at that 2023 season as his last good year in the NFL.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Brian Thomas Jr.",
    "Team": "JAX",
    "Bye Week": "12",
    "Rank": "38",
    "Points": "198.3",
    "Risk": "4.7",
    "Upside": "6.5",
    "ADP": "8.12",
    "Tier": "9",
    "Outlook": "With Zay Jones cut and Calvin Ridley in Tennessee, the 3WR set for the Jags should be Brian Thomas Jr. and Gabe Davis on the perimeter with Kirk in the slot. Thomas should have an opportunity to produce right away, but keep in mind that both Evan Engram and Christian Kirk are excellent target earners. It could be a bit frustrating for Thomas, especially early in the year, but there’s certainly some upside in his range of outcomes as a deep threat for Trevor Lawrence.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Chris Godwin",
    "Team": "TB",
    "Bye Week": "11",
    "Rank": "39",
    "Points": "197.6",
    "Risk": "4.7",
    "Upside": "4.3",
    "ADP": "7.03",
    "Tier": "9",
    "Outlook": "Doesn’t it feel like Godwin should be at least 30 years old by now? He’s still in his prime at the age of 28 and coming off a year where he saw 130 targets. So why does he feel like the most boring fantasy pick of all time? Touchdowns! With just 5 total TDs over the past two seasons, Godwin hasn’t really popped for fantasy. However, he’s banked 80+ catches and 1,000+ yards in four of his last five seasons. If that TD total comes up to the 5-7 range, Godwin could outperform his ADP by a wide margin.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Christian Watson",
    "Team": "GB",
    "Bye Week": "10",
    "Rank": "40",
    "Points": "191.4",
    "Risk": "7.2",
    "Upside": "6.8",
    "ADP": "9.06",
    "Tier": "9",
    "Outlook": "Will someone please get this man a new set of hamstrings? The hype on Watson entering 2023 was out of control after he exploded down the stretch in 2022. Unfortunately, recurring hamstring problems never let him get on the field consistently to do anything for fantasy. Could he be a post-hype sleeper in 2024 on one of the most exciting up-and-coming offenses in football?",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Tyler Lockett",
    "Team": "SEA",
    "Bye Week": "10",
    "Rank": "41",
    "Points": "184.5",
    "Risk": "5.7",
    "Upside": "5.3",
    "ADP": "11.01",
    "Tier": "9",
    "Outlook": "Lockett appears to be quickly approaching that age cliff…sadly. Lockett’s yards per route run and yards per target have dropped in three consecutive seasons as he enters his 10th year in the league. Could he bank a top-36 season and be serviceable? Sure. Does he have enough juice to be a league winner at this stage of his career? Sadly, probably not.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Rashee Rice",
    "Team": "KC",
    "Bye Week": "6",
    "Rank": "42",
    "Points": "182.1",
    "Risk": "7.7",
    "Upside": "6.3",
    "ADP": "6.12",
    "Tier": "9",
    "Outlook": "Well this offseason has been…something. Sadly, the headlines around Rice right now are not about his stellar on-field play as a rookie; but about his off-the-field issues. It seems almost certain that Rice will get some sort of suspension this year, it’s just a matter of how many games. Obviously, his ADP will be depressed due to the possibility of missing more than a month, and we expect it to fluctuate over the course of the summer as we get more information.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Jordan Addison",
    "Team": "MIN",
    "Bye Week": "6",
    "Rank": "43",
    "Points": "180.1",
    "Risk": "4.5",
    "Upside": "6.0",
    "ADP": "6.11",
    "Tier": "9",
    "Outlook": "Addison had a solid rookie campaign, finishing with over 900 yards and 10 scores. Of course, the Jefferson injury probably helped inflate those numbers, but we love betting on Year 2 wideouts in fantasy who flashed as rookies, and Addison is a former first-round talent. TJ Hockenson is coming off a late-season torn ACL, so the target tree here could be ultra condensed between Jefferson and Addison. Historically, rookie QBs don’t usually support multiple elite fantasy pass catchers, so we’re keeping expectations in check a bit, but Addison looks like a rock-solid target in the middle rounds.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Ladd McConkey",
    "Team": "LAC",
    "Bye Week": "5",
    "Rank": "44",
    "Points": "176.5",
    "Risk": "5.7",
    "Upside": "7.3",
    "ADP": "8.04",
    "Tier": "9",
    "Outlook": "The Bolts used the 34th overall pick on McConkey, and he landed in a dream scenario for him to produce right away. The target competition here is virtually non-existent. If he’s talented enough to capitalize on the opportunity, he could easily outperform his ADP.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Jakobi Meyers",
    "Team": "LV",
    "Bye Week": "10",
    "Rank": "45",
    "Points": "175.3",
    "Risk": "3.3",
    "Upside": "4.2",
    "ADP": "11.10",
    "Tier": "9",
    "Outlook": "Meyers with Jimmy G? Randy Moss. Meyers with Aidan O’Connell? Cardio king. The splits with and without Jimmy G last year were wild. With Garoppolo under center last year, Meyers averaged over 18 PPR points per game then disappeared down the stretch with AOC under center. The truth is probably somewhere in the middle - a talented WR who is unlikely to see a ton of volume and therefore, a low upside pick in fantasy circles. Of course, if Davante would get injured, we know Meyers is talented enough to earn volume but as far as his season-long outlook with Adams and Bowers now in town, we’re not thrilled.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Darnell Mooney",
    "Team": "ATL",
    "Bye Week": "12",
    "Rank": "46",
    "Points": "175.3",
    "Risk": "3.0",
    "Upside": "4.7",
    "ADP": "16.04",
    "Tier": "9",
    "Outlook": "The pass rate is going to be there for the Falcons, but is Mooney talented enough to capitalize on it? After logging 1,000 yards in his second year, Mooney’s numbers have fallen off a cliff over the last two years, leaving us wondering if that was just a flash in the pan back in 2021. Financially, the Falcons think there’s something there after signing him to almost $40 million. There’s a good chance Mooney cracks your lineup as a FLEX option a handful of times this year, but he is likely to be quite the boom-bust option in this offense.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Rome Odunze",
    "Team": "CHI",
    "Bye Week": "7",
    "Rank": "47",
    "Points": "171.5",
    "Risk": "6.0",
    "Upside": "6.3",
    "ADP": "6.08",
    "Tier": "9",
    "Outlook": "Chicago used the ninth overall pick in the NFL Draft on Odunze, giving Caleb Williams yet another weapon to try to help him get off to a fast start as a pro. D.J. Moore and Keenan Allen are some elite target earners, so for redraft purposes, Odunze may disappoint, especially early in the year. That said, he’s a very talented player, and rookie WRs can really peak late in the season. Should Moore or Keenan get injured, Odunze’s value would skyrocket, so we don’t mind taking a ‘wait and see’ approach with Odunze on your bench.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Brandin Cooks",
    "Team": "DAL",
    "Bye Week": "7",
    "Rank": "48",
    "Points": "170.9",
    "Risk": "3.7",
    "Upside": "5.2",
    "ADP": "13.05",
    "Tier": "10",
    "Outlook": "Cooks was basically non-existent in the first month and a half of last year, but after the bye week when Dallas cranked up their pass rate, Cooks’ 17-game pace from Week 8 on was 63 receptions, 847 yards, and 11 TD. That sort of TD production is likely not sustainable for a player entering his age 31 season, but anything close to that reception and yardage total would make Cooks a very strong value target in drafts. After Michael Gallup was released, there really isn’t anyone to threaten Cooks’ playing time as the WR2 across from Lamb.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Mike Williams",
    "Team": "NYJ",
    "Bye Week": "12",
    "Rank": "49",
    "Points": "170.4",
    "Risk": "6.7",
    "Upside": "4.3",
    "ADP": "11.12",
    "Tier": "10",
    "Outlook": "Coming off the torn ACL as a big boundary wide receiver, there’s some concern about his ability to separate and have a monster year for fantasy. That said, could he see plenty of red zone targets and put up 8-10 TDs if things go well for Rodgers and this offense? Certainly. He’s an interesting WR3/4 for your fantasy team where we’re generally inviting variance after already having a couple of locked-in studs.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Adam Thielen",
    "Team": "CAR",
    "Bye Week": "11",
    "Rank": "50",
    "Points": "169.5",
    "Risk": "5.3",
    "Upside": "4.3",
    "ADP": "15.08",
    "Tier": "10",
    "Outlook": "If you happened to draft Thielen last year, you are well aware of how much volume he earned early in the season. After shockingly looking like a league winner at the age of 48 years old last season, Thielen fizzled out down the stretch. He proved us wrong last year, but we’re not buying back into him after the team drafted Legette and brought in Diontae Johnson. Expect Thielen to help the Panthers more than your fantasy team.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Keon Coleman",
    "Team": "BUF",
    "Bye Week": "12",
    "Rank": "51",
    "Points": "169.0",
    "Risk": "6.3",
    "Upside": "7.3",
    "ADP": "9.03",
    "Tier": "10",
    "Outlook": "The 3WR set for Buffalo is projected to be Coleman, Khalil Shakir, and Curtis Samuel. Because of that, it’s not exactly difficult to squint and see a big year for Keon Coleman as a rookie in this Bills offense. A true boundary WR, there really isn’t another guy on this roster who fits his archetype, so we feel good about his opportunity to see the field right away. There are a wide range of outcomes for a guy like Coleman, but he’s got the upside to break out as the year goes on.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Jerry Jeudy",
    "Team": "CLE",
    "Bye Week": "10",
    "Rank": "52",
    "Points": "167.6",
    "Risk": "4.3",
    "Upside": "4.0",
    "ADP": "12.03",
    "Tier": "10",
    "Outlook": "The Broncos have been trying to trade Jeudy for the better part of two years if that tells you anything. They got their deal done, and now Jeudy lands in Cleveland as the WR2 behind Mr. Cooper. Perhaps the change of scenery is what he needs? Honestly, he feels like the type of player you take in your fantasy draft then stash on your bench until Week 6 when you eventually drop him for a backup RB. Here is a list of WRs who had more top-24 WR weeks than Jeudy last season: Kendrick Bourne, Demarcus Robinson, Josh Reynolds, and Noah Brown. Enough already.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Rashid Shaheed",
    "Team": "NO",
    "Bye Week": "12",
    "Rank": "53",
    "Points": "167.3",
    "Risk": "3.3",
    "Upside": "5.2",
    "ADP": "12.05",
    "Tier": "10",
    "Outlook": "Through two years in the league, Shaheed has been an efficiency monster, averaging 16.3 yards per catch and 11.1 yards per target. No longer just a deep threat, it was nice to see Shaheed develop a bit as a more complete NFL WR in year two. All the signs are there that Shaheed could enjoy a nice little breakout in year three - Michael Thomas is finally out of the way, Shaheed has flashed big play ability early and this Saints offense will finally look like a 21st century offense under new OC Klint Kubiak. As long as the ADP is manageable, adding Shaheed late in your draft could pay dividends.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Quentin Johnston",
    "Team": "LAC",
    "Bye Week": "5",
    "Rank": "54",
    "Points": "165.5",
    "Risk": "7.3",
    "Upside": "7.0",
    "ADP": "15.03",
    "Tier": "10",
    "Outlook": "What a Quge mistake that season was…and it’s not like this guy didn’t have an opportunity. Mike Williams tore his ACL in Week 3, and Keenan Allen missed the last few weeks of the year with a heel injury. Obviously, there are not many positives to take away from Johnston’s rookie year, and now the offense is set to be one of the most run-heavy schemes in the league under Greg Roman and Jim Harbaugh. In theory, he should have a chance to run some routes given the state of the depth chart, but we’re just not sure how talented he is after what we saw last year. Is he a flier at the end of your drafts? Sure. Why not.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Joshua Palmer",
    "Team": "LAC",
    "Bye Week": "5",
    "Rank": "55",
    "Points": "165.2",
    "Risk": "3.0",
    "Upside": "4.7",
    "ADP": "12.09",
    "Tier": "10",
    "Outlook": "Palmer’s always been a viable WR3 type of play in fantasy whenever he’s gotten the opportunity. In 21 career games with Justin Herbert where he’s seen 5+ targets in a game, he’s averaged 12.8 PPR points per game. Considering the state of the depth chart, Palmer could play in 2WR sets, and he’s already got some chemistry with Herbert. No, he won’t win you your league, but he could be a valuable bench player for your team.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Curtis Samuel",
    "Team": "BUF",
    "Bye Week": "12",
    "Rank": "56",
    "Points": "164.8",
    "Risk": "4.0",
    "Upside": "4.8",
    "ADP": "10.12",
    "Tier": "10",
    "Outlook": "Samuel quietly led the Washington trio last year in targets per route run and now he gets a QB upgrade and a reunion with OC Joe Brady, whom he played for back in his Carolina days. His fit in the offense is TBD, especially with Dalton Kincaid getting a lot of snaps in the slot where Samuel primarily runs his routes. Regardless, he will have a role in one of the league’s best offenses making him a sneaky late-round target in drafts.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Courtland Sutton",
    "Team": "DEN",
    "Bye Week": "14",
    "Rank": "57",
    "Points": "164.6",
    "Risk": "4.0",
    "Upside": "5.3",
    "ADP": "10.07",
    "Tier": "10",
    "Outlook": "There may not be a bigger regression candidate in fantasy football than Courtland Sutton, who caught 10 TD passes despite catching just 59 passes in 2023. Factoring in that regression plus playing with a rookie QB, Sutton is a guy who’s a potential bust relative to expectations as the WR1 for Denver.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Xavier Worthy",
    "Team": "KC",
    "Bye Week": "6",
    "Rank": "58",
    "Points": "164.2",
    "Risk": "5.7",
    "Upside": "7.2",
    "ADP": "7.04",
    "Tier": "10",
    "Outlook": "Andy Reid has historically slow-played his rookie WRs, but he may not have a choice this time thanks to Rashee Rice’s off-the-field antics. Worthy was a Round 1 selection who should play right away across from Marquise Brown. We’re not sure he’ll get out to a super fast start as a rookie with Mahomes, but the upside is immense if he does. The Chiefs have openly talked about managing Kelce’s reps during the regular season, and if they do that and Rice misses several games because of suspension, Worthy will have an opportunity to crush his ADP.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Jameson Williams",
    "Team": "DET",
    "Bye Week": "5",
    "Rank": "59",
    "Points": "160.1",
    "Risk": "6.0",
    "Upside": "6.5",
    "ADP": "10.03",
    "Tier": "10",
    "Outlook": "Are you tracking how weird the start of Williams’ NFL career is? He spent his rookie season recovering from the torn ACL then a gambling suspension and hamstring injury forced him to get off to a slow start in 2023 as a sophomore. Even still, the fantasy community seems to have talked themselves into taking a shot on Williams entering Year 3 in the league. We get the excitement for a player who was the former 12th overall pick, but buyer beware. This is a guy who barely averaged over 4(!) fantasy points per game in two seasons, and if the ADP on him gets out of control this summer, just realize there is downside to a player like this. Williams is a wildcard in the double-digit rounds.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Demario Douglas",
    "Team": "NE",
    "Bye Week": "14",
    "Rank": "60",
    "Points": "159.4",
    "Risk": "4.3",
    "Upside": "4.0",
    "ADP": "15.12",
    "Tier": "10",
    "Outlook": "Douglas was a big beneficiary of the Bourne injury last year, earning a full-time role in the middle part of the season. Unfortunately, he missed three games with a concussion, but he did have a handful of weeks as a top-36 option. There’s virtually no ceiling with a player like this, but he could be a starter in deep leagues or a bye week fill-in if he can earn enough targets as the starting slot WR.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Adonai Mitchell",
    "Team": "IND",
    "Bye Week": "14",
    "Rank": "61",
    "Points": "157.2",
    "Risk": "5.3",
    "Upside": "5.5",
    "ADP": "11.03",
    "Tier": "10",
    "Outlook": "Mitchell slipped a little bit in the draft to the middle of the second round after many expected him to go in the top-32. On paper, it’s a decent spot for him to get on the field right away after Alec Pierce spent all of last season running wind sprints opposite Michael Pittman Jr. We expect Mitchell to grab that WR2 job immediately out of the gate. In this offense, that could lead to a few big games, but we’d be surprised if Mitchell becomes a mainstay in your fantasy lineup right away. Pittman is an elite target earner, Josh Downs is a capable slot WR, and we know the offense will flow through Jonathan Taylor and Anthony Richardson’s legs. That said, stashing a talented rookie on your bench is never a bad idea to see if he can emerge in the second half of the year.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Ja'Lynn Polk",
    "Team": "NE",
    "Bye Week": "14",
    "Rank": "62",
    "Points": "155.2",
    "Risk": "6.0",
    "Upside": "5.8",
    "ADP": "13.12",
    "Tier": "10",
    "Outlook": "Rome Odunze is the top-tier WR out of Washington, but don’t forget about Polk. The Pats used the 37th overall pick on him, and he should have the opportunity to get on the field right away. Being tied to what projects to be a terrible offense with a rookie QB obviously doesn’t scream fantasy league winner, but we’ve seen rookie WRs come on late in the year. Polk could have a similar archetype, especially if this Drake Maye led Pats team is better than projected.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Marquise Brown",
    "Team": "KC",
    "Bye Week": "6",
    "Rank": "63",
    "Points": "154.9",
    "Risk": "3.7",
    "Upside": "5.8",
    "ADP": "7.08",
    "Tier": "10",
    "Outlook": "Brown had all the opportunity in the world last season as the only real option in the Cardinals’ WR room. However, he dealt with a heel injury and/or poor QB play for most of the year. On paper, the season from Brown was quite bad - he averaged just 1.25 yards per route run and was 76th in fantasy points per route run. Was it the heel? The QB play? Is Brown just not as good as he once was? A combination? There’s a ton of moving parts here. Obviously, the Rashee Rice potential suspension has opened up an opportunity for Brown to play a meaningful role out of the gate. We’ll see if he can capitalize with Mahomes.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Josh Downs",
    "Team": "IND",
    "Bye Week": "14",
    "Rank": "64",
    "Points": "153.3",
    "Risk": "3.3",
    "Upside": "4.7",
    "ADP": "12.08",
    "Tier": "10",
    "Outlook": "Downs ran 81% of his routes from the slot last season and after the team selected AD Mitchell in Round 2, we shouldn’t expect that to change. Unfortunately, this is an offense set up to consistently support just one WR on a week-in and week-out basis and that guy is obviously Pitty City. Without a high-volume role, Downs is likely to struggle to be a consistent fantasy producer. If something happens to Pittman, however, we’ve at least seen him prove he is a capable NFL WR who can give you WR3 production.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Romeo Doubs",
    "Team": "GB",
    "Bye Week": "10",
    "Rank": "65",
    "Points": "150.8",
    "Risk": "3.3",
    "Upside": "5.3",
    "ADP": "10.10",
    "Tier": "10",
    "Outlook": "The dude just gets it done. No, he won’t win you your league but Doubs has shown us through two years in the league that he can play. He had a very solid year two jump last season with almost 700 yards and eight TDs, and he is more than capable of providing WR3-type numbers when given the opportunity. Of course, there are a lot of players in this Packers receiving corps who could earn some snaps, so that will keep his ADP way down. We like him as a bench option for your squad.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Gabe Davis",
    "Team": "JAX",
    "Bye Week": "12",
    "Rank": "66",
    "Points": "149.1",
    "Risk": "5.3",
    "Upside": "4.7",
    "ADP": "13.03",
    "Tier": "10",
    "Outlook": "Look, you know what you’re getting with “Gabe The Babe”. If you click the button in your draft, get ready for the best and worst weeks of your life. Davis’ yards per route run and targets per route run have dropped in three straight seasons, and now he’s leaving Josh Allen and the Bills’ potent offense. Will he have a couple of massive games? Probably. Will he also completely disappear for weeks on end? Definitely.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Demarcus Robinson",
    "Team": "LAR",
    "Bye Week": "6",
    "Rank": "67",
    "Points": "148.6",
    "Risk": "3.7",
    "Upside": "4.7",
    "ADP": "19.08",
    "Tier": "10",
    "Outlook": "Robinson was quietly pretty good for the Rams last year as the WR3, especially down the stretch. In fact, he led the team in end zone targets from Week 12 on after he overtook Tutu Atwell for the WR3 job while adding a 17.5% target share. With Tyler Higbee coming off a late-season torn ACL, Robinson could be involved yet again behind Puka and Kupp. It’s going to be tough for him to be a consistent producer as long as both guys are healthy, but if either Kupp or Puka miss time, D Rob would be an immediate plug-and-play option off the waiver wire.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Roman Wilson",
    "Team": "PIT",
    "Bye Week": "9",
    "Rank": "68",
    "Points": "146.3",
    "Risk": "4.7",
    "Upside": "5.0",
    "ADP": "15.07",
    "Tier": "10",
    "Outlook": "Wilson’s competition for playing time out of the gate as a rookie: Van Jefferson, Denzel Mims, Calvin Austin, and Quez Watkins. Ya know, the boys! Sure, the passing volume will be low, but Wilson can win with efficiency as he did in college. At Michigan, he was second in this year’s WR class in EPA per target. We love him as a late-round target given the path for playing time as early as Week 1.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Wan'Dale Robinson",
    "Team": "NYG",
    "Bye Week": "11",
    "Rank": "69",
    "Points": "145.5",
    "Risk": "3.0",
    "Upside": "4.2",
    "ADP": "16.12",
    "Tier": "10",
    "Outlook": "Robinson’s rookie year was cut short due to a torn ACL, and in his second pro season, he went for just over 500 yards with everything close to the line of scrimmage. His 5.5-yard aDOT won’t produce fantasy numbers unless he is seeing a boatload of targets. The addition of Malik Nabers sixth overall says it is probably not going to happen.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Jermaine Burton",
    "Team": "CIN",
    "Bye Week": "12",
    "Rank": "70",
    "Points": "143.5",
    "Risk": "4.7",
    "Upside": "5.0",
    "ADP": "16.06",
    "Tier": "10",
    "Outlook": "Burton comes from two stud schools - Georgia and Alabama. He’s got the pedigree that says he could work out for fantasy if things click. There’s a wide range of outcomes here given his downfield role (over a 20-yard aDOT last season at Alabama!), and he is playing behind two studs in Chase and Higgins, so we’re not thrilled about his early season outlook. However, if Chase or Higgins happens to pick up an injury, Burton would be a really interesting add off the waiver wire.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Xavier Legette",
    "Team": "CAR",
    "Bye Week": "11",
    "Rank": "71",
    "Points": "141.7",
    "Risk": "6.0",
    "Upside": "6.3",
    "ADP": "11.11",
    "Tier": "10",
    "Outlook": "A fifth-year breakout out at South Carolina, the Panthers traded up to keep him close to home. It’s a really fun story and we’re rooting for things to work out. That said, this production profile combined with what Bryce Young did as a rookie gives you zero confidence. It would not be surprising at all to see Legette pop up for some massive games and finish as a top-36 option. It would also not be surprising to see him do almost nothing as a rookie while competing with Diontae Johnson and Adam Thielen for targets. If you’re looking for a late-round target with a massive range of outcomes, Legette is your dude.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Jahan Dotson",
    "Team": "WAS",
    "Bye Week": "14",
    "Rank": "72",
    "Points": "141.0",
    "Risk": "5.3",
    "Upside": "4.5",
    "ADP": "13.10",
    "Tier": "10",
    "Outlook": "Yikes. Dotson went full first-team all cardio in 2023 with an abysmal 0.82 yards per route run rate. How bad was his year? Among 120 WRs who saw 25+ targets last season, Dotson ranked 105th. Considering the Commanders threw at one of the highest rates in football, it’s obviously concerning that Dotson was borderline irrelevant for fantasy. Perhaps he can be a post-hype sleeper in 2024, but nothing he did in 2023 gives you any confidence whatsoever.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Darius Slayton",
    "Team": "NYG",
    "Bye Week": "11",
    "Rank": "73",
    "Points": "140.1",
    "Risk": "3.3",
    "Upside": "4.7",
    "ADP": "23.09",
    "Tier": "10",
    "Outlook": "Slayton’s the type of guy who just always seems to have three to five very solid fantasy performances late in the year, so just know at some point this year, Slayton will probably make the waiver wire show. Plan accordingly.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Dontayvion Wicks",
    "Team": "GB",
    "Bye Week": "10",
    "Rank": "74",
    "Points": "138.1",
    "Risk": "4.3",
    "Upside": "5.7",
    "ADP": "14.12",
    "Tier": "10",
    "Outlook": "On paper, Wicks is probably the odd man out for snaps entering Week 1, but perhaps he shouldn’t be. He matched Reed’s efficiency with a 2.04 yards per route run mark as a 5th-round rookie. Not bad! It’s tough to project playing time right now with everyone healthy, but if anyone else on this depth chart misses time, Wicks looks talented enough to capitalize on the opportunity in an offense we want exposure to in 2024.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Khalil Shakir",
    "Team": "BUF",
    "Bye Week": "12",
    "Rank": "75",
    "Points": "136.5",
    "Risk": "3.0",
    "Upside": "5.0",
    "ADP": "11.08",
    "Tier": "10",
    "Outlook": "Shakir didn’t do much as a rookie, but he developed into a boom-bust option with some nice moments in year two while playing 52% of the snaps. The Bills WR room is a complete overhaul after the Diggs trade, so there’s certainly an opportunity for someone to emerge. And while Shakir’s underlying metrics look strong (1.84 yards per route run last season), the fact that he only ran 28 routes per game from Week 7 on says he is more likely to be part of this WR committee than a dominant fantasy force.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Zay Jones",
    "Team": "ARI",
    "Bye Week": "11",
    "Rank": "76",
    "Points": "135.4",
    "Risk": "2.5",
    "Upside": "4.5",
    "ADP": "21.03",
    "Tier": "10",
    "Outlook": "“The Spot Start” as he’s known around Ballers HQ, Zay Jones finds himself in the desert to compete with Michael Wilson for the WR2 job across from Marvin Harrison Jr. He had a forgettable 2023 thanks to knee and hamstring injuries, but he is just two years removed from a WR26 finish in 2022. Talented enough to produce when given the opportunity, Jones is on the radar as a late-round pick in the event that he does get the WR2 snaps in what projects to be a much improved Cardinals offense in 2024 with Kyler now fully healthy.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Michael Wilson",
    "Team": "ARI",
    "Bye Week": "11",
    "Rank": "77",
    "Points": "125.8",
    "Risk": "3.3",
    "Upside": "3.7",
    "ADP": "16.10",
    "Tier": "10",
    "Outlook": "Wilson averaged a 14% target share per game last year and just 1.36 yards per route run on a depth chart that didn’t have Marvin Harrison Jr. Those types of numbers don’t move the needle, and now his target competition got a lot tougher. We expect him to compete with Zay Jones for the WR2 across from Marv, but that doesn’t mean he’ll be very relevant for fantasy.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Marvin Mims Jr.",
    "Team": "DEN",
    "Bye Week": "14",
    "Rank": "78",
    "Points": "125.7",
    "Risk": "5.0",
    "Upside": "5.3",
    "ADP": "17.04",
    "Tier": "10",
    "Outlook": "Jerry Jeudy is now in Cleveland, so on paper, Mims has an inside track to playing time in year two. Unfortunately, nothing he did as a rookie gives you any confidence he can capitalize on the projected opportunity. He is worth a late round pick based on that opportunity, but don’t hesitate to move on if he doesn’t do much to start the year.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Ricky Pearsall",
    "Team": "SF",
    "Bye Week": "9",
    "Rank": "79",
    "Points": "123.7",
    "Risk": "6.0",
    "Upside": "5.0",
    "ADP": "13.10",
    "Tier": "10",
    "Outlook": "We’re usually excited about first round rookie WRs, even in redraft leagues. For 2024, it’s really hard to paint a positive picture for Pearsall to see enough targets to be relevant. Deebo and Aiyuk are playing at a very high level, CMC gets a ton of looks out of the backfield, and George Kittle is going to pop off for four or five huge weeks as he does every year. That said, in the event of an Aiyuk or Deebo injury, we know exactly who to pick up off waivers.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Rondale Moore",
    "Team": "ATL",
    "Bye Week": "12",
    "Rank": "80",
    "Points": "116.0",
    "Risk": "3.0",
    "Upside": "3.0",
    "ADP": "23.11",
    "Tier": "10",
    "Outlook": "Remember when Jonathan Gannon did the “Pew Pew Pew” thing with Rondale when he met him?... Spoiler: the fireworks did not happen. It resulted in 3.6 targets per game last year. At this point, we know what we’re getting with Moore, which is not a lot of fantasy points. Low aDOT targets for fantasy are cute but not worth beans.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Rashod Bateman",
    "Team": "BAL",
    "Bye Week": "14",
    "Rank": "81",
    "Points": "114.5",
    "Risk": "4.3",
    "Upside": "4.7",
    "ADP": "18.10",
    "Tier": "10",
    "Outlook": "Behind Mark Andrews and Zay Flowers, there is not much left to go around when it comes to fantasy goodness - just ask anyone who was drafting Odell Beckham and Bateman last season. This staff has shown a willingness to use a WR committee at times, so just as you’re ready to believe you’ve found the WR2 to have in Baltimore, get ready for Nelson Agholor to randomly enter the game and catch a 20-yard TD. Outside of an injury to Zay Flowers in season, we’re not interested in drafting Bateman.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Elijah Moore",
    "Team": "CLE",
    "Bye Week": "10",
    "Rank": "82",
    "Points": "113.5",
    "Risk": "4.3",
    "Upside": "2.3",
    "ADP": "24.02",
    "Tier": "10",
    "Outlook": "Man, the Elijah Moore truthers are in shambles! He was brought in via trade last off-season after a falling out with the Jets only to somehow do nothing despite seeing over 100 targets. No need to fall into the trap for a third straight season.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Odell Beckham Jr.",
    "Team": "MIA",
    "Bye Week": "6",
    "Rank": "83",
    "Points": "113.1",
    "Risk": "4.0",
    "Upside": "2.3",
    "ADP": "20.05",
    "Tier": "10",
    "Outlook": "The Ravens paying OBJ $15M last year was confusing to say the least. For reference, he was paid like a top-20 WR, yet he caught just 35 passes all season and then barely played in the playoffs. Now 31 years old, OBJ’s days in our fantasy lineups are over although Miami gave him an incentive-laden deal (worth up to $8 million) to see if he has any magic left. Perhaps he’s a guy we’re picking up off waivers later this year in the event Tyreek or Waddle gets injured.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Jalin Hyatt",
    "Team": "NYG",
    "Bye Week": "11",
    "Rank": "84",
    "Points": "112.4",
    "Risk": "4.3",
    "Upside": "4.3",
    "ADP": "21.10",
    "Tier": "10",
    "Outlook": "It was not exactly the best rookie year for the former Tennessee Volunteer. Just one weekly finish inside the top-24 can’t give you any confidence heading into Year 2. Perhaps he wins the WR3 job for the Giants, but let’s be real, does it matter?",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Trey Palmer",
    "Team": "TB",
    "Bye Week": "11",
    "Rank": "85",
    "Points": "110.8",
    "Risk": "3.7",
    "Upside": "3.3",
    "ADP": "24.09",
    "Tier": "10",
    "Outlook": "The 6th round pick had some moments in the slot as a rookie for the Buccaneers seeing 68 total targets and three scores. However, with Chris Godwin moving back into his preferred slot role and the team's selection of Jalen McMillan in the 3rd round, Palmer likely will be fighting for snaps and scraps from this team's passing pie.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Tyler Boyd",
    "Team": "TEN",
    "Bye Week": "5",
    "Rank": "86",
    "Points": "106.3",
    "Risk": "3.0",
    "Upside": "2.3",
    "ADP": "20.11",
    "Tier": "10",
    "Outlook": "Boyd reunites with his former OC in Cincy, Brian Callahan, who’s now the head coach in Tennessee. He’ll fill the slot role for the Titans, but unless Hopkins or Ridley suffers an injury, it probably won’t mean much for fantasy. For reference, he only had three top-36 fantasy weeks last season in Cincy and that was with Tee Higgins in and out of the lineup most of the year.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "DJ Chark",
    "Team": "LAC",
    "Bye Week": "5",
    "Rank": "87",
    "Points": "100.4",
    "Risk": "3.3",
    "Upside": "3.3",
    "ADP": "21.11",
    "Tier": "10",
    "Outlook": "That WR16 season back in 2019 feels like years ago…because it was. Since then, Chark’s fantasy points per game has declined in five straight seasons, and now he’ll be on his fourth NFL franchise in four years. He goes to one of the most run-heavy schemes in football with the Chargers and Greg Roman. Chark's contract says he's not a lock to make the roster. If he does, he'll probably catch a couple of long bombs from Justin Herbert. Good luck trying to predict when those will happen.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Kendrick Bourne",
    "Team": "NE",
    "Bye Week": "14",
    "Rank": "88",
    "Points": "99.8",
    "Risk": "5.3",
    "Upside": "3.3",
    "ADP": "23.11",
    "Tier": "10",
    "Outlook": "New England simply cannot help themselves when it comes to three-year contracts for veteran WRs…for exactly $33 million. They gave the exact same contract to Bourne, JuJu, and DeVante Parker in recent seasons. To Bourne’s credit, at least he was actually good on the field before tearing his ACL. Quietly fantasy’s WR27 on the back of 55(!) targets prior to his injury last season, Bourne is on the radar as a sleeper for super deep leagues.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Kalif Raymond",
    "Team": "DET",
    "Bye Week": "5",
    "Rank": "89",
    "Points": "97.9",
    "Risk": "3.3",
    "Upside": "3.0",
    "ADP": "57.11",
    "Tier": "10",
    "Outlook": "Josh Reynolds is now in Denver, so in theory, Raymond has a path to snaps in this Lions offense. At best, though, Raymond will operate as the WR3, which usually doesn’t mean much in an offense that heavily features their TE and one of the best pass-catching backs in the league in Jahmyr Gibbs. We’re not expecting much.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Troy Franklin",
    "Team": "DEN",
    "Bye Week": "14",
    "Rank": "90",
    "Points": "96.6",
    "Risk": "6.7",
    "Upside": "4.7",
    "ADP": "13.01",
    "Tier": "10",
    "Outlook": "The competition for playing time in year one: Courtland Sutton, Marvin Mims, Josh Reynolds, Fireball Jones (Tim Patrick) off a torn Achilles. It’s really not hard to see the path here for a talented prospect who produced at a high level in college. He slid a bit in the NFL Draft, but there’s a good chance that keeps his ADP in check. He is a really fun late-round flier in fantasy this year. As long as the opportunity cost is low, we’re fine adding Franklin to your bench with the hopes that he emerges in an ambiguous WR room.  Be willing to cut him and move on if he duds early and wave your arms saying, “Move along! Nothing to see here!”",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Jalen McMillan",
    "Team": "TB",
    "Bye Week": "11",
    "Rank": "91",
    "Points": "95.9",
    "Risk": "5.3",
    "Upside": "3.3",
    "ADP": "20.05",
    "Tier": "10",
    "Outlook": "We know it’ll be the Evans and Godwin show in Tampa, but that WR3 role is up for grabs. After the team used a third-round pick on the former Husky, we think he’s got a good chance to beat out Trey Palmer for that job. If he does, he could have a few weeks as a streaming candidate off the waiver wire.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Josh Reynolds",
    "Team": "DEN",
    "Bye Week": "14",
    "Rank": "92",
    "Points": "94.0",
    "Risk": "3.7",
    "Upside": "2.7",
    "ADP": "24.06",
    "Tier": "10",
    "Outlook": "Reynolds has been able to stick around the NFL as a WR3/4 for NFL teams for years. In fact, he is entering Year 8 in the NFL, which means we know what he is by now - a potential waiver wire pickup in the event of an injury on the depth chart and probably nothing more.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Malachi Corley",
    "Team": "NYJ",
    "Bye Week": "12",
    "Rank": "93",
    "Points": "93.5",
    "Risk": "5.3",
    "Upside": "4.7",
    "ADP": "16.06",
    "Tier": "10",
    "Outlook": "Corley was taken in the third round by Gang Green, and he profiles as the starting slot WR right away. For fantasy, that will probably cap his upside if he’s not out there in 2WR sets. Expect somewhat of a slow start for the rookie, but there’s room to grow if things click.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Jalen Tolbert",
    "Team": "DAL",
    "Bye Week": "7",
    "Rank": "94",
    "Points": "88.8",
    "Risk": "4.7",
    "Upside": "2.3",
    "ADP": "23.02",
    "Tier": "10",
    "Outlook": "On paper, Tolbert projects as the WR3 in Dallas to start the year. Unfortunately, we’re not really sure how good he is at football. He was selected in the third round of the NFL Draft back in 2022, and in two years gathered just 39 total targets. He is not really a guy we’re drafting, but worth monitoring given that Cooks is turning 31 later this year, and no one behind him on the depth chart scares you.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Devontez Walker",
    "Team": "BAL",
    "Bye Week": "14",
    "Rank": "95",
    "Points": "84.0",
    "Risk": "5.0",
    "Upside": "4.7",
    "ADP": "20.09",
    "Tier": "10",
    "Outlook": "Not worth drafting in redraft leagues, Walker is likely to start the season as the WR4/5 on the Baltimore depth chart. With Lamar’s rushing ability and Derrick Henry pounding the rock at the goal line, call us crazy, but we’re not really targeting depth pieces in this Ravens passing game.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Jonathan Mingo",
    "Team": "CAR",
    "Bye Week": "11",
    "Rank": "96",
    "Points": "81.9",
    "Risk": "5.3",
    "Upside": "4.0",
    "ADP": "26.09",
    "Tier": "10",
    "Outlook": "Mingo averaged an abysmal 0.78 yards per route run as a rookie. Buzz, your girlfriend…WOOF! Anything below 1 YPRR is a recipe for failure at the NFL level. This current Carolina regime didn’t draft him, and immediately after the season was over, they traded for Diontae Johnson then drafted Xavier Legette in round one. That tells you all you need to know.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "A.T. Perry",
    "Team": "NO",
    "Bye Week": "12",
    "Rank": "97",
    "Points": "80.3",
    "Risk": "3.3",
    "Upside": "2.3",
    "ADP": "24.03",
    "Tier": "10",
    "Outlook": "Here’s a fun fact for you to share with your league-mates at your upcoming draft:  According to NextGenStats, AT Perry led all WRs in QB passer rating when targeted. While that little factoid with an incredibly small sample size is technically true, it does not mean he’ll be relevant for fantasy moving forward. Perry is at best the WR3 in New Orleans to enter the year and was not a highly coveted prospect coming out of school.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Treylon Burks",
    "Team": "TEN",
    "Bye Week": "5",
    "Rank": "98",
    "Points": "73.0",
    "Risk": "3.5",
    "Upside": "2.0",
    "ADP": "24.07",
    "Tier": "10",
    "Outlook": "This current coaching staff and regime did not draft Treylon. So, if they believed he could be a starter, they probably wouldn’t have paid through the roof for Ridley and brought in Tyler Boyd to man the slot. Pour one out….",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Luke McCaffrey",
    "Team": "WAS",
    "Bye Week": "14",
    "Rank": "99",
    "Points": "71.3",
    "Risk": "5.3",
    "Upside": "3.7",
    "ADP": "17.05",
    "Tier": "10",
    "Outlook": "Does that last name look familiar? It should! CMC’s younger brother, Luke, is still developing as a WR. He began his college career at Nebraska as a QB then transferred to Rice and made the switch to WR in 2022. So in reality, this guy has only been playing WR for two years, and he was still drafted in the third round - impressive!. He played over 70% of his snaps from the slot in college, which works out nicely after Washington lost Curtis Samuel this offseason. Unfortunately, Jayden Daniels should run a lot leading to a less than fortunate outlook in Year 1. McCaffrey is a name worth monitoring to see if he’s earning starter reps.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "Javon Baker",
    "Team": "NE",
    "Bye Week": "14",
    "Rank": "100",
    "Points": "47.7",
    "Risk": "7.0",
    "Upside": "4.2",
    "ADP": "19.11",
    "Tier": "10",
    "Outlook": "The Pats are in the middle of a full rebuild, so they doubled up in the NFL Draft at wide receiver, pairing Baker with Polk. In theory, he could have a path to a starting job on the perimeter, but a lot will have to go right for that to mean anything in fantasy. For now, he’s a name to monitor this summer. He could be a guy who pops late in the year.",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  },
  {
    "Name": "JuJu Smith-Schuster",
    "Team": "NE",
    "Bye Week": "14",
    "Rank": "101",
    "Points": "43.2",
    "Risk": "6.0",
    "Upside": "2.0",
    "ADP": "57.05",
    "Tier": "10",
    "Outlook": "The drop-off in play from Smith-Schuster over the last three years has been quite sad. Does this guy even find the field in 2WR sets? And if he does, does it even matter? Probably not. Hey, we’ll always have those Pittsburgh days!",
    "Dynasty": "Unlock with the 2024 UDK+. Get the UDK+.",
    "Markers": "Mark Drafted                      Mark Keeper"
  }
]